----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS/cleaned/compute_returns_sample.log
  log type:  text
 opened on:  19 Sep 2025, 09:10:03

. 
. set more off

. 
. local master "/Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS/cleaned/hrs_2020_2022_master.dta"

. capture confirm file "`master'"

. if _rc {
.     di as error "ERROR: master file not found -> `master'"
.     exit 198
. }

. 
. use "`master'", clear

. di as txt "Using master file: `master'"
Using master file: /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS/cleaned/hrs_2020_2022_master.dta

. 
. * ---------------------------------------------------------------------
. * Define analysis sample: households with primary residence values in both years
. * ---------------------------------------------------------------------
. di as txt "=== Defining analysis sample based on primary residence values ==="
=== Defining analysis sample based on primary residence values ===

. 
. * Count non-missing primary residence values in each year
. egen n_res_2022 = rownonmiss(SH020)

. egen n_res_2020 = rownonmiss(RH020)

. 
. * Define sample: must have primary residence value in both 2020 and 2022
. gen sample_res_both = (n_res_2022 > 0) & (n_res_2020 > 0)

. 
. * Report sample statistics
. di as txt "Sample definition results:"
Sample definition results:

. tab sample_res_both, missing

sample_res_ |
       both |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,034       70.29       70.29
          1 |      4,242       29.71      100.00
------------+-----------------------------------
      Total |     14,276      100.00

. quietly count if sample_res_both == 1

. local n_sample = r(N)

. quietly count

. local n_total = r(N)

. di as txt "Households in analysis sample: `n_sample' out of `n_total' (" %4.1f 100*`n_sample'/`n_total' "%)"
Households in analysis sample: 4242 out of 14276 (29.7%)

. 
. * ---------------------------------------------------------------------
. * Create masked per-asset/class components for sample-restricted analysis
. * ---------------------------------------------------------------------
. di as txt "=== Creating sample-restricted component variables ==="
=== Creating sample-restricted component variables ===

. 
. * Interest/dividends components
. di as txt "Masking interest/dividend components..."
Masking interest/dividend components...

. gen double int_re_2022_sample = .
(14,276 missing values generated)

. replace int_re_2022_sample = int_re_2022 if sample_res_both
(299 real changes made)

. 
. gen double int_bus_2022_sample = .
(14,276 missing values generated)

. replace int_bus_2022_sample = int_bus_2022 if sample_res_both
(111 real changes made)

. 
. gen double int_ira_2022_sample = .
(14,276 missing values generated)

. replace int_ira_2022_sample = int_ira_2022 if sample_res_both
(13 real changes made)

. 
. gen double int_stk_2022_sample = .
(14,276 missing values generated)

. replace int_stk_2022_sample = int_stk_2022 if sample_res_both
(284 real changes made)

. 
. gen double int_bnd_2022_sample = .
(14,276 missing values generated)

. replace int_bnd_2022_sample = int_bnd_2022 if sample_res_both
(43 real changes made)

. 
. gen double int_cash_2022_sample = .
(14,276 missing values generated)

. replace int_cash_2022_sample = int_cash_2022 if sample_res_both
(1,086 real changes made)

. 
. gen double int_cds_2022_sample = .
(14,276 missing values generated)

. replace int_cds_2022_sample = int_cds_2022 if sample_res_both
(103 real changes made)

. 
. * Net investment flows components
. di as txt "Masking net investment flow components..."
Masking net investment flow components...

. gen double flow_bus_2022_sample = .
(14,276 missing values generated)

. replace flow_bus_2022_sample = flow_bus_2022 if sample_res_both
(3 real changes made)

. 
. gen double flow_stk_private_2022_sample = .
(14,276 missing values generated)

. replace flow_stk_private_2022_sample = flow_stk_private_2022 if sample_res_both
(83 real changes made)

. 
. gen double flow_stk_public_2022_sample = .
(14,276 missing values generated)

. replace flow_stk_public_2022_sample = flow_stk_public_2022 if sample_res_both
(117 real changes made)

. 
. gen double flow_re_2022_sample = .
(14,276 missing values generated)

. replace flow_re_2022_sample = flow_re_2022 if sample_res_both
(192 real changes made)

. 
. gen double flow_ira_2022_sample = .
(14,276 missing values generated)

. replace flow_ira_2022_sample = flow_ira_2022 if sample_res_both
(4,242 real changes made)

. 
. gen double flow_ira_2022_neg_sample = .
(14,276 missing values generated)

. replace flow_ira_2022_neg_sample = -flow_ira_2022_sample if sample_res_both
(4,242 real changes made)

. 
. gen double flow_residences_2022_sample = .
(14,276 missing values generated)

. replace flow_residences_2022_sample = flow_residences_2022 if sample_res_both
(1,090 real changes made)

. 
. * Mortgage payment components
. di as txt "Masking mortgage payment components..."
Masking mortgage payment components...

. gen double mort1_pay_annual_sample = .
(14,276 missing values generated)

. replace mort1_pay_annual_sample = mort1_pay_annual if sample_res_both
(1,679 real changes made)

. 
. gen double mort2_pay_annual_sample = .
(14,276 missing values generated)

. replace mort2_pay_annual_sample = mort2_pay_annual if sample_res_both
(36 real changes made)

. 
. gen double secmort_pay_annual_sample = .
(14,276 missing values generated)

. replace secmort_pay_annual_sample = secmort_pay_annual if sample_res_both
(82 real changes made)

. 
. * Capital gains components
. di as txt "Masking capital gains components..."
Masking capital gains components...

. gen double cg_bus_2022_sample = .
(14,276 missing values generated)

. replace cg_bus_2022_sample = cg_bus_2022 if sample_res_both
(214 real changes made)

. 
. gen double cg_re_2022_sample = .
(14,276 missing values generated)

. replace cg_re_2022_sample = cg_re_2022 if sample_res_both
(352 real changes made)

. 
. gen double cg_stk_2022_sample = .
(14,276 missing values generated)

. replace cg_stk_2022_sample = cg_stk_2022 if sample_res_both
(554 real changes made)

. 
. gen double cg_ira_2022_sample = .
(14,276 missing values generated)

. replace cg_ira_2022_sample = cg_ira_2022 if sample_res_both
(4,242 real changes made)

. 
. gen double cg_bnd_2022_sample = .
(14,276 missing values generated)

. replace cg_bnd_2022_sample = cg_bnd_2022 if sample_res_both
(54 real changes made)

. 
. gen double cg_res_total_2022_sample = .
(14,276 missing values generated)

. replace cg_res_total_2022_sample = cg_res_total_2022 if sample_res_both
(4,242 real changes made)

. 
. * Net worth component
. di as txt "Masking net worth component..."
Masking net worth component...

. gen double networth_A2020_sample = .
(14,276 missing values generated)

. replace networth_A2020_sample = networth_A2020 if sample_res_both
(4,242 real changes made)

. 
. * ---------------------------------------------------------------------
. * Compute sample-restricted totals
. * ---------------------------------------------------------------------
. di as txt "=== Computing sample-restricted totals ==="
=== Computing sample-restricted totals ===

. 
. * Interest/dividends total
. gen double yc_2022_sample = .
(14,276 missing values generated)

. egen yc_2022_temp = rowtotal(int_re_2022_sample int_bus_2022_sample int_ira_2022_sample int_stk_2022_sample int_bnd_2022_s
> ample int_cash_2022_sample int_cds_2022_sample) if sample_res_both
(10,034 missing values generated)

. replace yc_2022_sample = yc_2022_temp if sample_res_both
(4,242 real changes made)

. drop yc_2022_temp

. 
. di as txt "Interest/dividends total (yc_2022_sample) summary:"
Interest/dividends total (yc_2022_sample) summary:

. summarize yc_2022_sample, detail

                       yc_2022_sample
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,242
25%            0              0       Sum of wgt.       4,242

50%            0                      Mean               7136
                        Largest       Std. dev.      42328.98
75%           40         768000
90%         8000         800000       Variance       1.79e+09
95%        28800         852000       Skewness       12.36248
99%       180000         960000       Kurtosis         201.15

. tabstat yc_2022_sample, stats(n mean sd p50 min max) format(%12.2f)

    Variable |            N         Mean           SD          p50          Min          Max
-------------+------------------------------------------------------------------------------
yc_2022_sa~e |      4242.00      7136.00     42328.98         0.00         0.00    960000.00
--------------------------------------------------------------------------------------------

. 
. * Net investment flows total
. gen double F_2022_sample = .
(14,276 missing values generated)

. egen F_2022_temp = rowtotal(flow_bus_2022_sample flow_stk_private_2022_sample flow_stk_public_2022_sample flow_re_2022_sam
> ple flow_ira_2022_neg_sample flow_residences_2022_sample) if sample_res_both
(10,034 missing values generated)

. replace F_2022_sample = F_2022_temp if sample_res_both
(4,242 real changes made)

. drop F_2022_temp

. 
. di as txt "Net investment flows total (F_2022_sample) summary:"
Net investment flows total (F_2022_sample) summary:

. summarize F_2022_sample, detail

                        F_2022_sample
-------------------------------------------------------------
      Percentiles      Smallest
 1%      -368000       -6400000
 5%      -102500       -2660000
10%       -50000       -2250000       Obs               4,242
25%       -11000       -1500000       Sum of wgt.       4,242

50%            0                      Mean          -9600.707
                        Largest       Std. dev.      175567.2
75%            0        1580000
90%            0        2550000       Variance       3.08e+10
95%        33000        2837500       Skewness      -8.986911
99%       380000        3406000       Kurtosis       502.0507

. tabstat F_2022_sample, stats(n mean sd p50 min max) format(%12.2f)

    Variable |            N         Mean           SD          p50          Min          Max
-------------+------------------------------------------------------------------------------
F_2022_sam~e |      4242.00     -9600.71    175567.16         0.00  -6400000.00   3406000.00
--------------------------------------------------------------------------------------------

. 
. * Debt payments total
. gen double yd_2022_sample = .
(14,276 missing values generated)

. egen yd_2022_temp = rowtotal(mort1_pay_annual_sample mort2_pay_annual_sample secmort_pay_annual_sample) if sample_res_both
(10,034 missing values generated)

. replace yd_2022_sample = yd_2022_temp if sample_res_both
(4,242 real changes made)

. drop yd_2022_temp

. 
. di as txt "Debt payments total (yd_2022_sample) summary:"
Debt payments total (yd_2022_sample) summary:

. summarize yd_2022_sample, detail

                       yd_2022_sample
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,242
25%            0              0       Sum of wgt.       4,242

50%            0                      Mean           6843.674
                        Largest       Std. dev.      11609.43
75%        12000          94800
90%        21600         100800       Variance       1.35e+08
95%        27600         144000       Skewness       4.639505
99%        46800         264000       Kurtosis       68.48698

. tabstat yd_2022_sample, stats(n mean sd p50 min max) format(%12.2f)

    Variable |            N         Mean           SD          p50          Min          Max
-------------+------------------------------------------------------------------------------
yd_2022_sa~e |      4242.00      6843.67     11609.43         0.00         0.00    264000.00
--------------------------------------------------------------------------------------------

. 
. * Capital gains total
. gen double cg_2022_sample = .
(14,276 missing values generated)

. egen cg_2022_temp = rowtotal(cg_bus_2022_sample cg_re_2022_sample cg_stk_2022_sample cg_ira_2022_sample cg_bnd_2022_sample
>  cg_res_total_2022_sample) if sample_res_both
(10,034 missing values generated)

. replace cg_2022_sample = cg_2022_temp if sample_res_both
(4,242 real changes made)

. drop cg_2022_temp

. 
. di as txt "Capital gains total (cg_2022_sample) summary:"
Capital gains total (cg_2022_sample) summary:

. summarize cg_2022_sample, detail

                       cg_2022_sample
-------------------------------------------------------------
      Percentiles      Smallest
 1%      -945000      -3.14e+09
 5%      -253600       -3823000
10%       -83200       -3155000       Obs               4,242
25%            0       -3090000       Sum of wgt.       4,242

50%        56000                      Mean          -578826.4
                        Largest       Std. dev.      4.83e+07
75%       174430       1.15e+07
90%       475000       1.26e+07       Variance       2.33e+15
95%       840000       1.46e+07       Skewness      -65.08726
99%      2185270       1.71e+07       Kurtosis       4238.238

. tabstat cg_2022_sample, stats(n mean sd p50 min max) format(%12.2f)

    Variable |            N         Mean           SD          p50          Min          Max
-------------+------------------------------------------------------------------------------
cg_2022_sa~e |      4242.00   -578826.43  48274349.04     56000.00    -3.14e+09  17114116.00
--------------------------------------------------------------------------------------------

. 
. * Beginning net worth (already computed, just masked)
. gen double A_2020_sample = .
(14,276 missing values generated)

. replace A_2020_sample = networth_A2020_sample if sample_res_both
(4,242 real changes made)

. 
. di as txt "Beginning net worth (A_2020_sample) summary:"
Beginning net worth (A_2020_sample) summary:

. summarize A_2020_sample, detail

                        A_2020_sample
-------------------------------------------------------------
      Percentiles      Smallest
 1%         3000        -301000
 5%        40500        -270000
10%        68000        -165000       Obs               4,242
25%       146000        -159000       Sum of wgt.       4,242

50%       317000                      Mean            1415213
                        Largest       Std. dev.      4.84e+07
75%       715000       1.42e+07
90%      1531695       1.85e+07       Variance       2.34e+15
95%      2538500       2.27e+07       Skewness       65.05175
99%      5450000       3.15e+09       Kurtosis       4235.146

. tabstat A_2020_sample, stats(n mean sd p50 min max) format(%12.2f)

    Variable |            N         Mean           SD          p50          Min          Max
-------------+------------------------------------------------------------------------------
A_2020_sam~e |      4242.00   1415212.82  48364323.32    317000.00   -301000.00     3.15e+09
--------------------------------------------------------------------------------------------

. 
. * ---------------------------------------------------------------------
. * Compute sample-restricted returns
. * ---------------------------------------------------------------------
. di as txt "=== Computing sample-restricted returns ==="
=== Computing sample-restricted returns ===

. 
. * Raw return calculation
. gen double r_2022_unchecked_sample = .
(14,276 missing values generated)

. replace r_2022_unchecked_sample = (yc_2022_sample + cg_2022_sample - yd_2022_sample) / (A_2020_sample + 0.5*F_2022_sample)
>  if sample_res_both
(4,238 real changes made)

. 
. * Clean return: exclude non-positive denominators
. gen double r_2022_sample = .
(14,276 missing values generated)

. replace r_2022_sample = r_2022_unchecked_sample if sample_res_both
(4,238 real changes made)

. replace r_2022_sample = . if (A_2020_sample + 0.5*F_2022_sample) <= 0 | missing(A_2020_sample + 0.5*F_2022_sample)
(47 real changes made, 47 to missing)

. 
. * Report return statistics
. di as txt "Summary stats for raw return (r_2022_unchecked_sample):"
Summary stats for raw return (r_2022_unchecked_sample):

. summarize r_2022_unchecked_sample, detail

                   r_2022_unchecked_sample
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.9979802      -59.66747
 5%    -.4226849         -43.12
10%     -.236025      -20.51158       Obs               4,238
25%            0       -16.9121       Sum of wgt.       4,238

50%     .1926715                      Mean           .5853785
                        Largest       Std. dev.      4.615935
75%     .5147556       53.93067
90%     1.157724       75.16129       Variance       21.30685
95%     1.961841       120.7694       Skewness       25.74564
99%     7.407407       202.3429       Kurtosis       1009.921

. tabstat r_2022_unchecked_sample, stats(n mean sd p50 min max) format(%12.4f)

    Variable |            N         Mean           SD          p50          Min          Max
-------------+------------------------------------------------------------------------------
r_2022_unc~e |    4238.0000       0.5854       4.6159       0.1927     -59.6675     202.3429
--------------------------------------------------------------------------------------------

. 
. di as txt "Summary stats for cleaned return (r_2022_sample):"
Summary stats for cleaned return (r_2022_sample):

. summarize r_2022_sample, detail

                        r_2022_sample
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.7470085      -3.722222
 5%    -.3860849      -3.467862
10%    -.2158859       -2.22163       Obs               4,191
25%            0      -2.005128       Sum of wgt.       4,191

50%     .1981546                      Mean           .6496228
                        Largest       Std. dev.      4.451051
75%     .5199021       53.93067
90%     1.158133       75.16129       Variance       19.81186
95%     1.961841       120.7694       Skewness       29.87563
99%     7.534588       202.3429       Kurtosis       1168.986

. tabstat r_2022_sample, stats(n mean sd p50 min max) format(%12.4f)

    Variable |            N         Mean           SD          p50          Min          Max
-------------+------------------------------------------------------------------------------
r_2022_sam~e |    4191.0000       0.6496       4.4511       0.1982      -3.7222     202.3429
--------------------------------------------------------------------------------------------

. 
. * Count valid returns
. quietly count if !missing(r_2022_sample)

. local n_valid_returns = r(N)

. di as txt "Records with valid r_2022_sample computed = `n_valid_returns' out of `n_sample' in sample"
Records with valid r_2022_sample computed = 4191 out of 4242 in sample

. 
. * ---------------------------------------------------------------------
. * Diagnostics: show extremes and component breakdowns
. * ---------------------------------------------------------------------
. di as txt "=== Diagnostics: extreme returns and component inspection ==="
=== Diagnostics: extreme returns and component inspection ===

. 
. di as txt "Top 20 positive returns:"
Top 20 positive returns:

. gsort -r_2022_sample

. list HHID RSUBHH r_2022_sample yc_2022_sample cg_2022_sample yd_2022_sample A_2020_sample F_2022_sample in 1/20

     +------------------------------------------------------------------------------------+
     |   HHID   RSUBHH   r_2022_s~   yc_202~e   cg_202~e   yd_202~e   A_2020~e   F_2022~e |
     |------------------------------------------------------------------------------------|
  1. | 542873        0   202.34286      18000     719000      28800     107000    -207000 |
  2. | 071750        0   120.76942          0     496000          0       4107          0 |
  3. | 521706        0    75.16129          0    1165000          0     128000    -225000 |
  4. | 500742        0   53.930667          0     422000      17520     145000    -275000 |
  5. | 056038        1          47          0     470000          0      10000          0 |
     |------------------------------------------------------------------------------------|
  6. | 072912        0       43.75          0     350000          0       8000          0 |
  7. | 526166        1   43.733333      12000     130000      10800       3000          0 |
  8. | 033944        0   43.428571          0     328000      24000      72000    -130000 |
  9. | 173152        0          42          0    1050000          0     425000    -800000 |
 10. | 501977        0   27.477724          0     645000      22080      32670     -20000 |
     |------------------------------------------------------------------------------------|
 11. | 544898        0   23.488625     128000    1751090          0     257000    -354000 |
 12. | 535218        0   22.989474          0     240000      21600      41500     -64000 |
 13. | 524503        0        21.8        400      65000          0       3000          0 |
 14. | 532858        0        20.5          0     205000          0      40000     -60000 |
 15. | 540817        0   20.215122          0     171200       5436       8200          0 |
     |------------------------------------------------------------------------------------|
 16. | 543275        0      19.125          0     765000          0     192500    -305000 |
 17. | 527580        0   19.067406          0     741131          0      38869          0 |
 18. | 544252        0   18.509091          0     115000      13200       8000      -5000 |
 19. | 014224        0       17.75          0     142000          0       9000      -2000 |
 20. | 524219        0     16.0505          4     150000      21600      33000     -50000 |
     +------------------------------------------------------------------------------------+

. 
. di as txt "Top 20 negative returns:"
Top 20 negative returns:

. gsort r_2022_sample

. list HHID RSUBHH r_2022_sample yc_2022_sample cg_2022_sample yd_2022_sample A_2020_sample F_2022_sample in 1/20

     +----------------------------------------------------------------------------------------+
     |   HHID   RSUBHH   r_2022_s~e   yc_202~e   cg_2022_~e   yd_202~e   A_2020_~e   F_2022~e |
     |----------------------------------------------------------------------------------------|
  1. | 187575        1   -3.7222222      12000      -280000          0       82000     -20000 |
  2. | 544707        0   -3.4678625          0      -220000      12000       66900          0 |
  3. | 541507        0   -2.2216296         12         6500      36504       13500          0 |
  4. | 903053        0   -2.0051282          0       -65000      13200       39000          0 |
  5. | 501328        0   -1.6020972      96000     -1075150      21600      325650     598000 |
     |----------------------------------------------------------------------------------------|
  6. | 502751        0   -1.4503991          0      -636000          0      280500     316000 |
  7. | 543338        0   -1.3087216       1200     -1039000      57600      465000     744000 |
  8. | 213391        1   -1.1568889          0        -5000       5412        9000          0 |
  9. | 500035        0   -1.1430334        120      -426300          0      381000     -16300 |
 10. | 542662        1   -1.0997442          0       -21500          0       20300      -1500 |
     |----------------------------------------------------------------------------------------|
 11. | 502196        0   -1.0838755       1800      -776500          0      480000     469500 |
 12. | 502271        2   -1.0371603          0      -374000          0      253100     215000 |
 13. | 045175        0   -1.0105852          0      -500000       6000      500700          0 |
 14. | 500277        2   -1.0015936          0      -225000      26400      101000     300000 |
 15. | 912430        0    -.9979802      97200   -3.144e+09      30000   3.150e+09     350000 |
     |----------------------------------------------------------------------------------------|
 16. | 915426        0   -.97012658          0      -364000      19200      395000          0 |
 17. | 543224        0   -.96973415        160       -65000      30000       15300     165000 |
 18. | 541454        0   -.96061776          0      -610000      12000      470000     355000 |
 19. | 014234        1   -.94678261          0      -108880          0      115000          0 |
 20. | 901467        0   -.94368219          0      -660000          0      699388          0 |
     +----------------------------------------------------------------------------------------+

. 
. * ---------------------------------------------------------------------
. * Per-asset/class component summaries for sample
. * ---------------------------------------------------------------------
. di as txt "=== Per-asset/class component summaries (sample only) ==="
=== Per-asset/class component summaries (sample only) ===

. 
. di as txt "Interest/dividend components:"
Interest/dividend components:

. foreach var in int_re_2022 int_bus_2022 int_ira_2022 int_stk_2022 int_bnd_2022 int_cash_2022 int_cds_2022 {
  2.     di as txt "Summary for `var'_sample:"
  3.     summarize `var'_sample, detail
  4. }
Summary for int_re_2022_sample:

                     int_re_2022_sample
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%         3600              0
10%         6000              0       Obs                 299
25%        10800              0       Sum of wgt.         299

50%        21600                      Mean           43126.09
                        Largest       Std. dev.      78300.88
75%        37200         360000
90%        96000         360000       Variance       6.13e+09
95%       180000         372000       Skewness       6.620825
99%       360000         960000       Kurtosis       67.47995
Summary for int_bus_2022_sample:

                     int_bus_2022_sample
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%          400              0
10%         2400              0       Obs                 111
25%        16800              0       Sum of wgt.         111

50%        36000                      Mean           84399.75
                        Largest       Std. dev.      111871.2
75%       104000         360000
90%       228000         480000       Variance       1.25e+10
95%       348000         480000       Skewness        2.26357
99%       480000         600000       Kurtosis       8.494436
Summary for int_ira_2022_sample:

                     int_ira_2022_sample
-------------------------------------------------------------
      Percentiles      Smallest
 1%          840            840
 5%          840           2100
10%         2100           5256       Obs                  13
25%         6900           6900       Sum of wgt.          13

50%         8400                      Mean           26080.15
                        Largest       Std. dev.      51399.15
75%        12000          12000
90%        48500          26246       Variance       2.64e+09
95%       192000          48500       Skewness       2.877652
99%       192000         192000       Kurtosis       9.825897
Summary for int_stk_2022_sample:

                     int_stk_2022_sample
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            4              0       Obs                 284
25%          200              0       Sum of wgt.         284

50%         1230                      Mean           16969.59
                        Largest       Std. dev.      61110.63
75%         8600         240000
90%        32000         480000       Variance       3.73e+09
95%        72000         520000       Skewness       7.002499
99%       480000         596000       Kurtosis       57.98756
Summary for int_bnd_2022_sample:

                     int_bnd_2022_sample
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                  43
25%          350              0       Sum of wgt.          43

50%         4200                      Mean           12281.26
                        Largest       Std. dev.      21189.04
75%        13200          36000
90%        30000          40000       Variance       4.49e+08
95%        40000          60000       Skewness        3.47873
99%       120000         120000       Kurtosis       17.08649
Summary for int_cash_2022_sample:

                    int_cash_2022_sample
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,086
25%           12              0       Sum of wgt.       1,086

50%           60                      Mean           1859.814
                        Largest       Std. dev.      23719.55
75%          240          51600
90%         1200         144000       Variance       5.63e+08
95%         3200         240000       Skewness       26.75804
99%        24000         720000       Kurtosis       785.7667
Summary for int_cds_2022_sample:

                     int_cds_2022_sample
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 103
25%            8              0       Sum of wgt.         103

50%          180                      Mean               2928
                        Largest       Std. dev.      9434.604
75%         1200          32000
90%         3884          36000       Variance       8.90e+07
95%        12000          40000       Skewness       5.207387
99%        40000          72000       Kurtosis       33.25133

. 
. di as txt "Net investment flow components:"
Net investment flow components:

. foreach var in flow_bus_2022 flow_stk_private_2022 flow_stk_public_2022 flow_re_2022 flow_ira_2022 flow_residences_2022 {
  2.     di as txt "Summary for `var'_sample:"
  3.     summarize `var'_sample, detail
  4. }
Summary for flow_bus_2022_sample:

                    flow_bus_2022_sample
-------------------------------------------------------------
      Percentiles      Smallest
 1%       -55000         -55000
 5%       -55000              0
10%       -55000        2750000       Obs                   3
25%       -55000              .       Sum of wgt.           3

50%            0                      Mean           898333.3
                        Largest       Std. dev.       1603826
75%      2750000              .
90%      2750000         -55000       Variance       2.57e+12
95%      2750000              0       Skewness       .7061714
99%      2750000        2750000       Kurtosis            1.5
Summary for flow_stk_private_2022_sample:

                flow_stk_private_2022_sample
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -2000000       -2000000
 5%      -200000        -300000
10%      -100000        -250000       Obs                  83
25%       -25000        -250000       Sum of wgt.          83

50%        -2000                      Mean          -6019.277
                        Largest       Std. dev.      258963.1
75%        50000         300000
90%       175000         300000       Variance       6.71e+10
95%       250000         500000       Skewness      -5.322144
99%       600000         600000       Kurtosis       44.07174
Summary for flow_stk_public_2022_sample:

                 flow_stk_public_2022_sample
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%          469              0
10%         1600              0       Obs                 117
25%        10000              4       Sum of wgt.         117

50%        24000                      Mean           77759.67
                        Largest       Std. dev.      148876.1
75%        78000         600000
90%       212000         600000       Variance       2.22e+10
95%       300000         730000       Skewness       3.717705
99%       730000        1000000       Kurtosis       19.05245
Summary for flow_re_2022_sample:

                     flow_re_2022_sample
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -1500000       -6400000
 5%      -560000       -1500000
10%      -290000       -1200000       Obs                 192
25%       -61000       -1040000       Sum of wgt.         192

50%       -10000                      Mean            9296.88
                        Largest       Std. dev.        656369
75%       132500        1700000
90%       250000        1750000       Variance       4.31e+11
95%       770000        2170000       Skewness       -3.79123
99%      2170000        3500000       Kurtosis       53.64447
Summary for flow_ira_2022_sample:

                    flow_ira_2022_sample
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,242
25%            0              0       Sum of wgt.       4,242

50%            0                      Mean           7697.256
                        Largest       Std. dev.      33457.55
75%            0         405000
90%        16000         460000       Variance       1.12e+09
95%        43000         700000       Skewness       11.09816
99%       150000         895000       Kurtosis       200.9263
Summary for flow_residences_2022_sample:

                 flow_residences_2022_sample
-------------------------------------------------------------
      Percentiles      Smallest
 1%      -550000       -2660000
 5%      -221000        -850000
10%      -100000        -800000       Obs               1,090
25%       -40000        -730000       Sum of wgt.       1,090

50%       -16000                      Mean          -19406.17
                        Largest       Std. dev.      169305.3
75%        -5000         760000
90%        40000         895000       Variance       2.87e+10
95%       220000         925000       Skewness      -2.821827
99%       556000         950000       Kurtosis       63.42572

. 
. di as txt "Mortgage payment components:"
Mortgage payment components:

. foreach var in mort1_pay_annual mort2_pay_annual secmort_pay_annual {
  2.     di as txt "Summary for `var'_sample:"
  3.     summarize `var'_sample, detail
  4. }
Summary for mort1_pay_annual_sample:

                   mort1_pay_annual_sample
-------------------------------------------------------------
      Percentiles      Smallest
 1%         2904            135
 5%         4800            792
10%         6000           1200       Obs               1,679
25%         9000           1560       Sum of wgt.       1,679

50%        14160                      Mean           16280.07
                        Largest       Std. dev.      11533.77
75%        21000          66000
90%        28800          72000       Variance       1.33e+08
95%        35400          72000       Skewness       6.845081
99%        50400         264000       Kurtosis       130.4737
Summary for mort2_pay_annual_sample:

                   mort2_pay_annual_sample
-------------------------------------------------------------
      Percentiles      Smallest
 1%          480            480
 5%         1200           1200
10%         2040           1968       Obs                  36
25%         3522           2040       Sum of wgt.          36

50%         5490                      Mean           7122.333
                        Largest       Std. dev.      5576.629
75%         9780          13440
90%        13440          15600       Variance       3.11e+07
95%        15768          15768       Skewness       2.100536
99%        30000          30000       Kurtosis       8.952357
Summary for secmort_pay_annual_sample:

                  secmort_pay_annual_sample
-------------------------------------------------------------
      Percentiles      Smallest
 1%          600            600
 5%         2508           1620
10%         4080           2244       Obs                  82
25%         7980           2400       Sum of wgt.          82

50%        13788                      Mean           17563.76
                        Largest       Std. dev.      18495.02
75%        21504          48000
90%        33600          54000       Variance       3.42e+08
95%        45600          59412       Skewness        4.25375
99%       144000         144000       Kurtosis        28.1027

. 
. di as txt "Capital gains components:"
Capital gains components:

. foreach var in cg_bus_2022 cg_re_2022 cg_stk_2022 cg_ira_2022 cg_bnd_2022 cg_res_total_2022 {
  2.     di as txt "Summary for `var'_sample:"
  3.     summarize `var'_sample, detail
  4. }
Summary for cg_bus_2022_sample:

                     cg_bus_2022_sample
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -1000000       -1500000
 5%      -424000       -1000000
10%      -200000       -1000000       Obs                 214
25%        -3000       -1000000       Sum of wgt.         214

50%        25000                      Mean           252873.4
                        Largest       Std. dev.       1044861
75%       200000        3000000
90%       850000        5000000       Variance       1.09e+12
95%      1400000        7000000       Skewness       6.059469
99%      5000000       1.03e+07       Kurtosis       50.50523
Summary for cg_re_2022_sample:

                      cg_re_2022_sample
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -2500000      -1.47e+08
 5%      -519000       -3400000
10%      -230000       -2600000       Obs                 352
25%       -10000       -2500000       Sum of wgt.         352

50%        32500                      Mean          -226630.4
                        Largest       Std. dev.       7932697
75%       163000        3310000
90%       699992        5300000       Variance       6.29e+13
95%      1200000        9300000       Skewness      -18.18283
99%      3310000       1.23e+07       Kurtosis       338.0674
Summary for cg_stk_2022_sample:

                     cg_stk_2022_sample
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -1000000       -4100000
 5%      -358000       -2300000
10%      -153000       -1900000       Obs                 554
25%       -11800       -1550000       Sum of wgt.         554

50%        10000                      Mean           136698.3
                        Largest       Std. dev.      684908.1
75%       115000        4000000
90%       473000        4600000       Variance       4.69e+11
95%      1000000        5000000       Skewness       4.088251
99%      2980000        7553000       Kurtosis        41.0811
Summary for cg_ira_2022_sample:

                     cg_ira_2022_sample
-------------------------------------------------------------
      Percentiles      Smallest
 1%      -770000       -4070000
 5%      -185000       -3000000
10%       -69000       -2760000       Obs               4,242
25%            0       -1850000       Sum of wgt.       4,242

50%            0                      Mean           26642.33
                        Largest       Std. dev.      367910.2
75%            0        2800000
90%       138000        3280000       Variance       1.35e+11
95%       330000        4965000       Skewness       18.80552
99%      1060000       1.56e+07       Kurtosis       769.9858
Summary for cg_bnd_2022_sample:

                     cg_bnd_2022_sample
-------------------------------------------------------------
      Percentiles      Smallest
 1%      -700000        -700000
 5%      -305000        -500000
10%      -230000        -305000       Obs                  54
25%      -100000        -255000       Sum of wgt.          54

50%         -346                      Mean          -12557.91
                        Largest       Std. dev.      190606.6
75%        29000         283000
90%       205000         321000       Variance       3.63e+10
95%       321000         400000       Skewness      -.5247318
99%       500000         500000       Kurtosis       6.218447
Summary for cg_res_total_2022_sample:

                  cg_res_total_2022_sample
-------------------------------------------------------------
      Percentiles      Smallest
 1%      -427000      -3.00e+09
 5%       -80000       -5600000
10%       -20000       -1605000       Obs               4,242
25%         9000       -1505000       Sum of wgt.       4,242

50%        50000                      Mean          -617112.7
                        Largest       Std. dev.      4.60e+07
75%       126000        1700000
90%       250000        1700000       Variance       2.12e+15
95%       400000        1800000       Skewness       -65.1045
99%       900000        9090000       Kurtosis       4239.731

. 
. * ---------------------------------------------------------------------
. * Save dataset with new sample-restricted variables
. * ---------------------------------------------------------------------
. save "`master'", replace
file /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS/cleaned/hrs_2020_2022_master.dta saved

. di as txt "Saved sample-restricted return variables to master: `master'"
Saved sample-restricted return variables to master: /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS/cleaned
> /hrs_2020_2022_master.dta

. 
. log close
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS/cleaned/compute_returns_sample.log
  log type:  text
 closed on:  19 Sep 2025, 09:10:03
----------------------------------------------------------------------------------------------------------------------------
