----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/cleaned/com
> pute_capital_gains_2022_simple_residences.log
  log type:  text
 opened on:  29 Sep 2025, 11:57:42

. 
. set more off

. 
. local master "/Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/cleaned/
> hrs_rand_2020_2022_master.dta"

. capture confirm file "`master'"

. if _rc {
.     di as error "ERROR: master file not found -> `master'"
.     exit 198
. }

. use "`master'", clear

. di as txt "Using master file: `master'"
Using master file: /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/clean
> ed/hrs_rand_2020_2022_master.dta

. 
. * ---------------------------------------------------------------------
. * Variables expected (RAND lowercase)
. * Business:    sq148 (2022), rq148 (2020), flow: flow_bus_2022
. * Real estate: sq134 (2022), rq134 (2020), flow: flow_re_2022
. * Stocks:      sq317 (2022), rq317 (2020), flow: flow_stk_2022
. * IRA:         sq166_1/2/3 (2022), rq166_1/2/3 (2020), flow: flow_ira_2022
. * Bonds:       sq331 (2022), rq331 (2020), no flows
. * Residences:  sh020 + sh162 (2022), rh020 + rh162 (2020), flow: flow_residences_2022
. * ---------------------------------------------------------------------
. 
. di as txt "Proceeding with capital gains computation..."
Proceeding with capital gains computation...

. 
. * ---------------------------------------------------------------------
. * Optional: clean sentinel special-missing codes for value vars (adjust if already cleaned)
. * ---------------------------------------------------------------------
. local misscodes 9999998 9999999 -8 -9 999999998 999999999

. local valuevars "sq148 rq148 sq134 rq134 sq317 rq317 sq166_1 rq166_1 sq166_2 rq166_2 sq166_3
>  rq166_3 sq331 rq331 sh020 rh020 sh162 rh162"

. di as txt "Recoding common sentinel codes to missing for value vars (if present)..."
Recoding common sentinel codes to missing for value vars (if present)...

. foreach v of local valuevars {
  2.     capture confirm variable `v'
  3.     if _rc continue
  4.     foreach mc of local misscodes {
  5.         quietly replace `v' = . if `v' == `mc'
  6.     }
  7.     di as txt " Summary for `v' (post-recode):"
  8.     summarize `v', detail
  9. }
 Summary for sq148 (post-recode):

               business or farm equity amount
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 587
25%        15000              0       Sum of wgt.         587

50%       150000                      Mean           545994.7
                        Largest       Std. dev.       1398337
75%       500000       1.00e+07
90%      1200000       1.00e+07       Variance       1.96e+12
95%      2000000       1.20e+07       Skewness       7.527613
99%      7000000       2.00e+07       Kurtosis       82.25828
 Summary for rq148 (post-recode):

               business or farm equity amount
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 572
25%        15000              0       Sum of wgt.         572

50%       127500                      Mean           500951.5
                        Largest       Std. dev.       1277093
75%       460000        7000000
90%      1200000        8000000       Variance       1.63e+12
95%      2000000       1.00e+07       Skewness       8.358759
99%      5000000       2.00e+07       Kurtosis       106.7893
 Summary for sq134 (post-recode):

                    real estate asset amt
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%         5000              0
10%        15000              0       Obs                 901
25%        65000              0       Sum of wgt.         901

50%       200000                      Mean           505574.2
                        Largest       Std. dev.       1206028
75%       480000        9000000
90%      1000000       1.00e+07       Variance       1.45e+12
95%      2000000       1.30e+07       Skewness       7.300845
99%      6500000       1.80e+07       Kurtosis       77.36954
 Summary for rq134 (post-recode):

                    real estate asset amt
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%         6000              0
10%        15000              0       Obs                 865
25%        50000              0       Sum of wgt.         865

50%       150000                      Mean           572288.3
                        Largest       Std. dev.       5157707
75%       350000        7000000
90%       900000        8000000       Variance       2.66e+13
95%      1500000       1.00e+07       Skewness       28.18453
99%      5000000       1.50e+08       Kurtosis       816.3991
 Summary for sq317 (post-recode):

                     stocks total value
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%          500              0
10%         2500              0       Obs               1,316
25%        20000              0       Sum of wgt.       1,316

50%       100000                      Mean           431372.1
                        Largest       Std. dev.       1119903
75%       400000        8018000
90%      1000000       1.00e+07       Variance       1.25e+12
95%      2000000       1.86e+07       Skewness       9.364518
99%      5000000       2.00e+07       Kurtosis       135.4693
 Summary for rq317 (post-recode):

                     stocks total value
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0         -20000
 5%         1200              0
10%         3000              0       Obs               1,286
25%        20000              0       Sum of wgt.       1,286

50%       100000                      Mean           382130.5
                        Largest       Std. dev.      904364.3
75%       400000        6300000
90%      1000000        7000000       Variance       8.18e+11
95%      1600000       1.22e+07       Skewness       7.901657
99%      4000000       1.60e+07       Kurtosis        102.758
 Summary for sq166_1 (post-recode):

                  amount in ira account - 1
-------------------------------------------------------------
      Percentiles      Smallest
 1%          752              0
 5%         5000              0
10%        11000              0       Obs               2,481
25%        40000              0       Sum of wgt.       2,481

50%       117000                      Mean           272413.1
                        Largest       Std. dev.      594243.6
75%       300000        5000000
90%       690000       1.00e+07       Variance       3.53e+11
95%       965000       1.02e+07       Skewness       13.06958
99%      2000000       1.63e+07       Kurtosis       281.8683
 Summary for rq166_1 (post-recode):

                  amount in ira account - 1
-------------------------------------------------------------
      Percentiles      Smallest
 1%         1000              0
 5%         4000              0
10%        10000              0       Obs               2,433
25%        33000              0       Sum of wgt.       2,433

50%       100000                      Mean           225127.9
                        Largest       Std. dev.      394835.2
75%       250000        4000000
90%       600000        4200000       Variance       1.56e+11
95%       850000        5500000       Skewness       6.042237
99%      1932945        7000000       Kurtosis        67.6434
 Summary for sq166_2 (post-recode):

                  amount in ira account - 2
-------------------------------------------------------------
      Percentiles      Smallest
 1%          350              0
 5%         4000              0
10%         8000              0       Obs               1,261
25%        25000              0       Sum of wgt.       1,261

50%        75000                      Mean             150722
                        Largest       Std. dev.      244379.2
75%       182000        1900000
90%       350000        2000000       Variance       5.97e+10
95%       550000        2500000       Skewness       4.992485
99%      1225000        3400000       Kurtosis        43.7281
 Summary for rq166_2 (post-recode):

                  amount in ira account - 2
-------------------------------------------------------------
      Percentiles      Smallest
 1%          100              0
 5%         3000              0
10%         6000              0       Obs               1,264
25%        20350              0       Sum of wgt.       1,264

50%        60000                      Mean           119514.5
                        Largest       Std. dev.      186303.8
75%       145500        1400000
90%       291000        1755000       Variance       3.47e+10
95%       440000        2000000       Skewness       4.535554
99%       900000        2200000       Kurtosis        34.7467
 Summary for sq166_3 (post-recode):

                  amount in ira account - 3
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%         3000              0
10%         6064              0       Obs                 523
25%        25000              0       Sum of wgt.         523

50%        68000                      Mean           175351.9
                        Largest       Std. dev.      299222.7
75%       200000        1948534
90%       412000        2000000       Variance       8.95e+10
95%       630000        2200000       Skewness       3.922881
99%      1700000        2500000       Kurtosis       22.61314
 Summary for rq166_3 (post-recode):

                  amount in ira account - 3
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%         1800              0
10%         5000              0       Obs                 516
25%        20000              0       Sum of wgt.         516

50%        50000                      Mean           131487.9
                        Largest       Std. dev.      213233.5
75%       150000        1390000
90%       365000        1406986       Variance       4.55e+10
95%       550000        1500000       Skewness        3.77734
99%      1000000        2000000       Kurtosis        23.4069
 Summary for sq331 (post-recode):

                   bond assets total value
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%          100              0
10%          700              0       Obs                 210
25%        10000              0       Sum of wgt.         210

50%        71000                      Mean           222551.4
                        Largest       Std. dev.      475363.8
75%       250000        2000000
90%       520500        2000000       Variance       2.26e+11
95%      1000000        3000000       Skewness       5.301784
99%      2000000        4500000       Kurtosis       39.94891
 Summary for rq331 (post-recode):

                   bond assets total value
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%         1000              0
10%         4000              0       Obs                 208
25%        22500              0       Sum of wgt.         208

50%        76500                      Mean           203434.5
                        Largest       Std. dev.      352682.7
75%       210000        1300000
90%       500000        1400000       Variance       1.24e+11
95%       800000        2200000       Skewness       4.113335
99%      1400000        3000000       Kurtosis       26.51187
 Summary for sh020 (post-recode):

                     home present value
-------------------------------------------------------------
      Percentiles      Smallest
 1%        20000              0
 5%        60000              0
10%        90000              0       Obs               6,154
25%       175000              0       Sum of wgt.       6,154

50%       300000                      Mean           408425.8
                        Largest       Std. dev.        437600
75%       500000        5500000
90%       800000        6000000       Variance       1.91e+11
95%      1000000        9000000       Skewness       6.168932
99%      2000000       1.00e+07       Kurtosis       86.37908
 Summary for rh020 (post-recode):

                     home present value
-------------------------------------------------------------
      Percentiles      Smallest
 1%        20000              0
 5%        50000              0
10%        80000              0       Obs               6,015
25%       140000              0       Sum of wgt.       6,015

50%       239000                      Mean           987662.9
                        Largest       Std. dev.      4.08e+07
75%       400000        8500000
90%       650000       1.00e+07       Variance       1.66e+15
95%       850000       1.00e+09       Skewness       68.64432
99%      1600000       3.00e+09       Kurtosis       4930.013
 Summary for sh162 (post-recode):

                 purchase price second home
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%         5000              0       Obs                 938
25%        15000              0       Sum of wgt.         938

50%        54000                      Mean           133688.4
                        Largest       Std. dev.      286554.8
75%       160000        1300000
90%       334000        1500000       Variance       8.21e+10
95%       495000        1900000       Skewness         12.785
99%      1000000        6500000       Kurtosis       264.4955
 Summary for rh162 (post-recode):

                 purchase price second home
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%         2000              0
10%         6000              0       Obs                 977
25%        13500              0       Sum of wgt.         977

50%        50000                      Mean           120430.4
                        Largest       Std. dev.      193620.9
75%       150000        1600000
90%       310000        1800000       Variance       3.75e+10
95%       465000        1800000       Skewness       4.187411
99%       975000        2000000       Kurtosis       29.70291

. 
. * Totals for IRA and residences
. capture drop v_ira_2022 v_ira_2020 v_res_2022 v_res_2020

. egen double v_ira_2022 = rowtotal(sq166_1 sq166_2 sq166_3)

. egen double v_ira_2020 = rowtotal(rq166_1 rq166_2 rq166_3)

. replace v_ira_2022 = . if missing(sq166_1) & missing(sq166_2) & missing(sq166_3)
(11,883 real changes made, 11,883 to missing)

. replace v_ira_2020 = . if missing(rq166_1) & missing(rq166_2) & missing(rq166_3)
(11,920 real changes made, 11,920 to missing)

. di as txt "IRA totals (2022 and 2020; missing when all components missing):"
IRA totals (2022 and 2020; missing when all components missing):

. summarize v_ira_2022 v_ira_2020, detail

                         v_ira_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%          752              0
 5%         5000              0
10%        13000              0       Obs               2,559
25%        45000              0       Sum of wgt.       2,559

50%       143000                      Mean             374219
                        Largest       Std. dev.      739893.8
75%       410000        6900000
90%       950000       1.02e+07       Variance       5.47e+11
95%      1392000       1.07e+07       Skewness        8.22171
99%      3200000       1.65e+07       Kurtosis       127.0115

                         v_ira_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%          900              0
 5%         5000              0
10%        10000              0       Obs               2,522
25%        40000              0       Sum of wgt.       2,522

50%       118000                      Mean             303985
                        Largest       Std. dev.      522220.2
75%       340000        4700000
90%       813000        5600000       Variance       2.73e+11
95%      1180000        5940000       Skewness       4.899273
99%      2605000        8250000       Kurtosis       44.27868

. quietly count if !missing(v_ira_2022) & !missing(v_ira_2020)

. di as txt "Observations with BOTH IRA V_2022 & V_2020 present = " r(N)
Observations with BOTH IRA V_2022 & V_2020 present = 1599

. * Overlap diagnostics for IRA components (2022 and 2020)
. capture drop ok_ira22_1 ok_ira22_2 ok_ira22_3 ira22_pattern ok_ira20_1 ok_ira20_2 ok_ira20_3
>  ira20_pattern

. gen byte ok_ira22_1 = !missing(sq166_1)

. gen byte ok_ira22_2 = !missing(sq166_2)

. gen byte ok_ira22_3 = !missing(sq166_3)

. gen byte ira22_pattern = ok_ira22_1*4 + ok_ira22_2*2 + ok_ira22_3

. label define iraPat2 0 "none" 1 "3 only" 2 "2 only" 3 "2+3" 4 "1 only" 5 "1+3" 6 "1+2" 7 "1+
> 2+3", replace

. label values ira22_pattern iraPat2

. di as txt "Counts of presence patterns for IRA 2022 components (sq166_1/2/3):"
Counts of presence patterns for IRA 2022 components (sq166_1/2/3):

. tab ira22_pattern, missing

ira22_patte |
         rn |      Freq.     Percent        Cum.
------------+-----------------------------------
       none |     11,883       82.28       82.28
     3 only |          8        0.06       82.34
     2 only |         58        0.40       82.74
        2+3 |         12        0.08       82.82
     1 only |      1,276        8.84       91.66
        1+3 |         14        0.10       91.75
        1+2 |        702        4.86       96.61
      1+2+3 |        489        3.39      100.00
------------+-----------------------------------
      Total |     14,442      100.00

. gen byte ok_ira20_1 = !missing(rq166_1)

. gen byte ok_ira20_2 = !missing(rq166_2)

. gen byte ok_ira20_3 = !missing(rq166_3)

. gen byte ira20_pattern = ok_ira20_1*4 + ok_ira20_2*2 + ok_ira20_3

. label define iraPat0 0 "none" 1 "3 only" 2 "2 only" 3 "2+3" 4 "1 only" 5 "1+3" 6 "1+2" 7 "1+
> 2+3", replace

. label values ira20_pattern iraPat0

. di as txt "Counts of presence patterns for IRA 2020 components (rq166_1/2/3):"
Counts of presence patterns for IRA 2020 components (rq166_1/2/3):

. tab ira20_pattern, missing

ira20_patte |
         rn |      Freq.     Percent        Cum.
------------+-----------------------------------
       none |     11,920       82.54       82.54
     3 only |         15        0.10       82.64
     2 only |         53        0.37       83.01
        2+3 |         21        0.15       83.15
     1 only |      1,230        8.52       91.67
        1+3 |         13        0.09       91.76
        1+2 |        723        5.01       96.77
      1+2+3 |        467        3.23      100.00
------------+-----------------------------------
      Total |     14,442      100.00

. 
. egen double v_res_2022 = rowtotal(sh020 sh162)

. egen double v_res_2020 = rowtotal(rh020 rh162)

. replace v_res_2022 = . if missing(sh020) & missing(sh162)
(8,138 real changes made, 8,138 to missing)

. replace v_res_2020 = . if missing(rh020) & missing(rh162)
(8,263 real changes made, 8,263 to missing)

. di as txt "Residence totals (combined primary + secondary; missing when both components miss
> ing):"
Residence totals (combined primary + secondary; missing when both components missing):

. summarize v_res_2022 v_res_2020, detail

                         v_res_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%        12000              0
 5%        50000              0
10%        85000              0       Obs               6,304
25%       165000              0       Sum of wgt.       6,304

50%       300000                      Mean           418599.6
                        Largest       Std. dev.      478718.5
75%       500000        6000000
90%       848000        9000000       Variance       2.29e+11
95%      1135000       1.00e+07       Skewness       7.076668
99%      2100000       1.20e+07       Kurtosis        113.613

                         v_res_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%        10000              0
 5%        45000              0
10%        75000              0       Obs               6,179
25%       130000              0       Sum of wgt.       6,179

50%       240000                      Mean           980490.8
                        Largest       Std. dev.      4.02e+07
75%       400000        8600000
90%       700000       1.00e+07       Variance       1.62e+15
95%       900000       1.00e+09       Skewness        69.5729
99%      1950000       3.00e+09       Kurtosis       5064.338

. quietly count if !missing(v_res_2022) & !missing(v_res_2020)

. di as txt "Observations with BOTH V_res_2022 & V_2020 present = " r(N)
Observations with BOTH V_res_2022 & V_2020 present = 4317

. * Overlap diagnostics for residence components (2022 and 2020)
. capture drop ok_res22_p ok_res22_s res22_pattern ok_res20_p ok_res20_s res20_pattern

. gen byte ok_res22_p = !missing(sh020)

. gen byte ok_res22_s = !missing(sh162)

. gen byte res22_pattern = ok_res22_p*2 + ok_res22_s

. label define resPat22 0 "none" 1 "sec only" 2 "prim only" 3 "prim+sec", replace

. label values res22_pattern resPat22

. di as txt "Counts of presence patterns for residence 2022 components (sh020/sh162):"
Counts of presence patterns for residence 2022 components (sh020/sh162):

. tab res22_pattern, missing

res22_patte |
         rn |      Freq.     Percent        Cum.
------------+-----------------------------------
       none |      8,138       56.35       56.35
   sec only |        150        1.04       57.39
  prim only |      5,366       37.16       94.54
   prim+sec |        788        5.46      100.00
------------+-----------------------------------
      Total |     14,442      100.00

. gen byte ok_res20_p = !missing(rh020)

. gen byte ok_res20_s = !missing(rh162)

. gen byte res20_pattern = ok_res20_p*2 + ok_res20_s

. label define resPat20 0 "none" 1 "sec only" 2 "prim only" 3 "prim+sec", replace

. label values res20_pattern resPat20

. di as txt "Counts of presence patterns for residence 2020 components (rh020/rh162):"
Counts of presence patterns for residence 2020 components (rh020/rh162):

. tab res20_pattern, missing

res20_patte |
         rn |      Freq.     Percent        Cum.
------------+-----------------------------------
       none |      8,263       57.22       57.22
   sec only |        164        1.14       58.35
  prim only |      5,202       36.02       94.37
   prim+sec |        813        5.63      100.00
------------+-----------------------------------
      Total |     14,442      100.00

. 
. * Capital gains per class
. capture drop cg_bus_2022 cg_re_2022 cg_stk_2022 cg_ira_2022 cg_bnd_2022 cg_res_total_2022

. 
. gen double cg_bus_2022 = .
(14,442 missing values generated)

. replace cg_bus_2022 = (sq148 - rq148) - cond(missing(flow_bus_2022),0,flow_bus_2022) if !mis
> sing(sq148) & !missing(rq148)
(249 real changes made)

. di as txt "Business cg (cg_bus_2022) summary:"
Business cg (cg_bus_2022) summary:

. summarize cg_bus_2022, detail

                         cg_bus_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -1000000       -1500000
 5%      -400000       -1000000
10%      -200000       -1000000       Obs                 249
25%            0       -1000000       Sum of wgt.         249

50%        10000                      Mean           223861.6
                        Largest       Std. dev.      978859.7
75%       199000        3100000
90%       808000        5000000       Variance       9.58e+11
95%      1300000        7000000       Skewness       6.426471
99%      5000000       1.03e+07       Kurtosis       57.09662

. quietly count if !missing(cg_bus_2022)

. di as txt "Records with cg_bus_2022 computed = " r(N)
Records with cg_bus_2022 computed = 249

. * Tabulation of cases for business capital gains
. capture drop bus_cases

. gen byte bus_cases = .
(14,442 missing values generated)

. replace bus_cases = 1 if !missing(sq148) & !missing(rq148) & !missing(flow_bus_2022)  // bot
> h years + flow
(37 real changes made)

. replace bus_cases = 2 if !missing(sq148) & !missing(rq148) & missing(flow_bus_2022)   // bot
> h years, no flow
(212 real changes made)

. replace bus_cases = 3 if missing(sq148) | missing(rq148)                              // mis
> sing years
(14,193 real changes made)

. label define busCases 1 "both years + flow" 2 "both years, no flow" 3 "missing years", repla
> ce

. label values bus_cases busCases

. di as txt "Business capital gains cases:"
Business capital gains cases:

. tab bus_cases, missing

          bus_cases |      Freq.     Percent        Cum.
--------------------+-----------------------------------
  both years + flow |         37        0.26        0.26
both years, no flow |        212        1.47        1.72
      missing years |     14,193       98.28      100.00
--------------------+-----------------------------------
              Total |     14,442      100.00

. 
. gen double cg_re_2022 = .
(14,442 missing values generated)

. replace cg_re_2022 = (sq134 - rq134) - cond(missing(flow_re_2022),0,flow_re_2022) if !missin
> g(sq134) & !missing(rq134)
(400 real changes made)

. di as txt "Real estate cg (cg_re_2022) summary:"
Real estate cg (cg_re_2022) summary:

. summarize cg_re_2022, detail

                         cg_re_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -2350000      -1.47e+08
 5%      -513500       -3400000
10%      -215000       -2600000       Obs                 400
25%       -10000       -2500000       Sum of wgt.         400

50%        37500                      Mean          -182054.5
                        Largest       Std. dev.       7442634
75%       165000        3310000
90%       674996        5300000       Variance       5.54e+13
95%      1144000        9300000       Skewness      -19.38229
99%      3135000       1.23e+07       Kurtosis        384.142

. quietly count if !missing(cg_re_2022)

. di as txt "Records with cg_re_2022 computed = " r(N)
Records with cg_re_2022 computed = 400

. * Tabulation of cases for real estate capital gains
. capture drop re_cases

. gen byte re_cases = .
(14,442 missing values generated)

. replace re_cases = 1 if !missing(sq134) & !missing(rq134) & !missing(flow_re_2022)  // both 
> years + flow
(118 real changes made)

. replace re_cases = 2 if !missing(sq134) & !missing(rq134) & missing(flow_re_2022)   // both 
> years, no flow
(282 real changes made)

. replace re_cases = 3 if missing(sq134) | missing(rq134)                              // miss
> ing years
(14,042 real changes made)

. label define reCases 1 "both years + flow" 2 "both years, no flow" 3 "missing years", replac
> e

. label values re_cases reCases

. di as txt "Real estate capital gains cases:"
Real estate capital gains cases:

. tab re_cases, missing

           re_cases |      Freq.     Percent        Cum.
--------------------+-----------------------------------
  both years + flow |        118        0.82        0.82
both years, no flow |        282        1.95        2.77
      missing years |     14,042       97.23      100.00
--------------------+-----------------------------------
              Total |     14,442      100.00

. 
. gen double cg_stk_2022 = .
(14,442 missing values generated)

. replace cg_stk_2022 = (sq317 - rq317) - cond(missing(flow_stk_2022),0,flow_stk_2022) if !mis
> sing(sq317) & !missing(rq317)
(679 real changes made)

. di as txt "Stocks cg (cg_stk_2022) summary:"
Stocks cg (cg_stk_2022) summary:

. summarize cg_stk_2022, detail

                         cg_stk_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -1500000       -4100000
 5%      -358000       -2600000
10%      -169000       -2300000       Obs                 679
25%       -15000       -2300000       Sum of wgt.         679

50%         9000                      Mean           116533.9
                        Largest       Std. dev.      689664.2
75%       100000        4600000
90%       420000        5000000       Variance       4.76e+11
95%       900000        6424489       Skewness        4.29513
99%      2980000        7553000       Kurtosis       43.95301

. quietly count if !missing(cg_stk_2022)

. di as txt "Records with cg_stk_2022 computed = " r(N)
Records with cg_stk_2022 computed = 679

. * Tabulation of cases for stocks capital gains
. capture drop stk_cases

. gen byte stk_cases = .
(14,442 missing values generated)

. replace stk_cases = 1 if !missing(sq317) & !missing(rq317) & !missing(flow_stk_2022)  // bot
> h years + flow
(147 real changes made)

. replace stk_cases = 2 if !missing(sq317) & !missing(rq317) & missing(flow_stk_2022)   // bot
> h years, no flow
(532 real changes made)

. replace stk_cases = 3 if missing(sq317) | missing(rq317)                              // mis
> sing years
(13,763 real changes made)

. label define stkCases 1 "both years + flow" 2 "both years, no flow" 3 "missing years", repla
> ce

. label values stk_cases stkCases

. di as txt "Stocks capital gains cases:"
Stocks capital gains cases:

. tab stk_cases, missing

          stk_cases |      Freq.     Percent        Cum.
--------------------+-----------------------------------
  both years + flow |        147        1.02        1.02
both years, no flow |        532        3.68        4.70
      missing years |     13,763       95.30      100.00
--------------------+-----------------------------------
              Total |     14,442      100.00

. 
. gen double cg_ira_2022 = .
(14,442 missing values generated)

. replace cg_ira_2022 = (v_ira_2022 - v_ira_2020) - cond(missing(flow_ira_2022),0,flow_ira_202
> 2) if !missing(v_ira_2022) & !missing(v_ira_2020)
(1,599 real changes made)

. di as txt "IRA cg (cg_ira_2022) summary:"
IRA cg (cg_ira_2022) summary:

. summarize cg_ira_2022, detail

                         cg_ira_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%      -770000       -2760000
 5%      -280000       -1900000
10%      -123639       -1850000       Obs               1,599
25%       -30500       -1600000       Sum of wgt.       1,599

50%         2200                      Mean           64484.53
                        Largest       Std. dev.      520242.8
75%        76000        2634000
90%       276000        2800000       Variance       2.71e+11
95%       600000        3280000       Skewness        17.1202
99%      1571538       1.56e+07       Kurtosis       496.7231

. quietly count if !missing(cg_ira_2022)

. di as txt "Records with cg_ira_2022 computed = " r(N)
Records with cg_ira_2022 computed = 1599

. * Tabulation of cases for IRA capital gains
. capture drop ira_cases

. gen byte ira_cases = .
(14,442 missing values generated)

. replace ira_cases = 1 if !missing(v_ira_2022) & !missing(v_ira_2020) & !missing(flow_ira_202
> 2)  // both years + flow
(831 real changes made)

. replace ira_cases = 2 if !missing(v_ira_2022) & !missing(v_ira_2020) & missing(flow_ira_2022
> )   // both years, no flow
(768 real changes made)

. replace ira_cases = 3 if missing(v_ira_2022) | missing(v_ira_2020)                          
>     // missing years
(12,843 real changes made)

. label define iraCases 1 "both years + flow" 2 "both years, no flow" 3 "missing years", repla
> ce

. label values ira_cases iraCases

. di as txt "IRA capital gains cases:"
IRA capital gains cases:

. tab ira_cases, missing

          ira_cases |      Freq.     Percent        Cum.
--------------------+-----------------------------------
  both years + flow |        831        5.75        5.75
both years, no flow |        768        5.32       11.07
      missing years |     12,843       88.93      100.00
--------------------+-----------------------------------
              Total |     14,442      100.00

. 
. gen double cg_bnd_2022 = .
(14,442 missing values generated)

. replace cg_bnd_2022 = (sq331 - rq331) if !missing(sq331) & !missing(rq331)
(65 real changes made)

. di as txt "Bonds cg (cg_bnd_2022) summary:"
Bonds cg (cg_bnd_2022) summary:

. summarize cg_bnd_2022, detail

                         cg_bnd_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%      -700000        -700000
 5%      -255000        -500000
10%      -200000        -305000       Obs                  65
25%       -50000        -255000       Sum of wgt.          65

50%            0                      Mean            -1741.4
                        Largest       Std. dev.      181766.7
75%        50000         283000
90%       205000         321000       Variance       3.30e+10
95%       283000         400000       Skewness       -.604528
99%       500000         500000       Kurtosis       6.476906

. quietly count if !missing(cg_bnd_2022)

. di as txt "Records with cg_bnd_2022 computed = " r(N)
Records with cg_bnd_2022 computed = 65

. * Tabulation of cases for bonds capital gains (no flows)
. capture drop bnd_cases

. gen byte bnd_cases = .
(14,442 missing values generated)

. replace bnd_cases = 1 if !missing(sq331) & !missing(rq331)  // both years present
(65 real changes made)

. replace bnd_cases = 2 if missing(sq331) | missing(rq331)    // missing years
(14,377 real changes made)

. label define bndCases 1 "both years present" 2 "missing years", replace

. label values bnd_cases bndCases

. di as txt "Bonds capital gains cases:"
Bonds capital gains cases:

. tab bnd_cases, missing

         bnd_cases |      Freq.     Percent        Cum.
-------------------+-----------------------------------
both years present |         65        0.45        0.45
     missing years |     14,377       99.55      100.00
-------------------+-----------------------------------
             Total |     14,442      100.00

. 
. gen double cg_res_total_2022 = .
(14,442 missing values generated)

. replace cg_res_total_2022 = (v_res_2022 - v_res_2020) - cond(missing(flow_residences_2022),0
> ,flow_residences_2022) if !missing(v_res_2022) & !missing(v_res_2020)
(4,317 real changes made)

. di as txt "Combined residences cg (cg_res_total_2022) summary:"
Combined residences cg (cg_res_total_2022) summary:

. summarize cg_res_total_2022, detail

                      cg_res_total_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%      -470000      -3.00e+09
 5%      -100000       -5600000
10%       -20000       -2290000       Obs               4,317
25%         6500       -1605000       Sum of wgt.       4,317

50%        50000                      Mean            -604872
                        Largest       Std. dev.      4.56e+07
75%       127000        1800000
90%       250000        2500000       Variance       2.08e+15
95%       405000        2705000       Skewness       -65.6776
99%       915000        9090000       Kurtosis       4314.698

. quietly count if !missing(cg_res_total_2022)

. di as txt "Records with cg_res_total_2022 computed = " r(N)
Records with cg_res_total_2022 computed = 4317

. * Tabulation of cases for residences capital gains
. capture drop res_cases

. gen byte res_cases = .
(14,442 missing values generated)

. replace res_cases = 1 if !missing(v_res_2022) & !missing(v_res_2020) & !missing(flow_residen
> ces_2022)  // both years + flow
(1,110 real changes made)

. replace res_cases = 2 if !missing(v_res_2022) & !missing(v_res_2020) & missing(flow_residenc
> es_2022)   // both years, no flow
(3,207 real changes made)

. replace res_cases = 3 if missing(v_res_2022) | missing(v_res_2020)                          
>     // missing years
(10,125 real changes made)

. label define resCases 1 "both years + flow" 2 "both years, no flow" 3 "missing years", repla
> ce

. label values res_cases resCases

. di as txt "Residences capital gains cases:"
Residences capital gains cases:

. tab res_cases, missing

          res_cases |      Freq.     Percent        Cum.
--------------------+-----------------------------------
  both years + flow |      1,110        7.69        7.69
both years, no flow |      3,207       22.21       29.89
      missing years |     10,125       70.11      100.00
--------------------+-----------------------------------
              Total |     14,442      100.00

. 
. * Totals and cross-class diagnostics moved to compute_returns
. 
. save "`master'", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/cleaned/hrs_rand_2020_2022_mast
    > er.dta saved

. di as txt "Saved capital gains vars back to master: `master'"
Saved capital gains vars back to master: /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Co
> de/Data/HRS_RAND/cleaned/hrs_rand_2020_2022_master.dta

. 
. log close
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/cleaned/com
> pute_capital_gains_2022_simple_residences.log
  log type:  text
 closed on:  29 Sep 2025, 11:57:42
----------------------------------------------------------------------------------------------
