------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/cleaned
> /compute_bus_returns_2022.log
  log type:  text
 opened on:   2 Oct 2025, 12:34:13

. 
. set more off

. 
. * ---------------------------------------------------------------------
. * Prerequisites: run these 8 scripts first (manually)
. * - extract_household_2020_ret_calc_end
. * - extract_household_2022_ret_calc_start
. * - merge_2020_2022
. * - compute_int_inc_div_2020_2022
. * - compute_net_inv_flows_2020_2022
. * - compute_debt_payments_2020_2022
. * - compute_cap_gains_2020_2022
. * - compute_beg_per_net_worth_2020_2022
. * ---------------------------------------------------------------------
. 
. local master "/Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/clea
> ned/hrs_rand_2020_2022_master.dta"

. capture confirm file "`master'"

. if _rc {
.     di as error "ERROR: master file not found -> `master'"
.     exit 198
. }

. 
. use "`master'", clear

. di as txt "Using master file: `master'"
Using master file: /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/c
> leaned/hrs_rand_2020_2022_master.dta

. 
. * ---------------------------------------------------------------------
. * Raw variable locals (align with compute_int_inc_div_2020_2022.do)
. * ---------------------------------------------------------------------
. local f2022_bus  sq153

. local a2022_bus  sq155

. 
. * ---------------------------------------------------------------------
. * Define BUSINESS sample
. * Baseline: households with business values in BOTH years (sq148 & rq148)
. * Augmented: OR any numerator signal (income amount+freq, or raw buy/sell flow)
. * ---------------------------------------------------------------------
. di as txt "=== Defining business asset sample ==="
=== Defining business asset sample ===

. 
. gen byte has_business_both = !missing(sq148) & !missing(rq148)

. gen byte bus_exposure = 0

. * Income exposure: amount present AND mapped frequency multiplier present
. replace bus_exposure = 1 if !missing(`a2022_bus') & !missing(`f2022_bus'_mult)
(212 real changes made)

. * Flow exposure: any raw buy/sell present
. replace bus_exposure = 1 if !missing(sr050) | !missing(sr055)
(77 real changes made)

. 
. * Business sample: baseline OR exposure
. gen byte bus_sample = has_business_both | bus_exposure

. 
. di as txt "Sample definition results:"
Sample definition results:

. tab bus_sample, missing

 bus_sample |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,002       96.95       96.95
          1 |        440        3.05      100.00
------------+-----------------------------------
      Total |     14,442      100.00

. quietly count if bus_sample == 1

. local n_bus_sample = r(N)

. quietly count

. local n_total = r(N)

. di as txt "Households in business asset sample: `n_bus_sample' out of `n_total' (" %4.1f
>  100*`n_bus_sample'/`n_total' "%)"
Households in business asset sample: 440 out of 14442 ( 3.0%)

. 
. di as txt "Additional inclusions due to numerator exposure:"
Additional inclusions due to numerator exposure:

. tab bus_exposure if !has_business_both, missing

bus_exposur |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,002       98.65       98.65
          1 |        191        1.35      100.00
------------+-----------------------------------
      Total |     14,193      100.00

. 
. * ---------------------------------------------------------------------
. * Denominator components
. * ---------------------------------------------------------------------
. di as txt "=== Denominator components (A_2020, F_2022) ==="
=== Denominator components (A_2020, F_2022) ===

. 
. capture drop A_2020

. gen double A_2020 = networth_A2020 if bus_sample
(14,080 missing values generated)

. 
. * ---------------------------------------------------------------------
. * Denominator flows: total flows across all asset classes (flow_total_2022)
. * Treat missing as 0 within the business sample
. * ---------------------------------------------------------------------
. di as txt "=== Using total flows (F_2022) component for denominator ==="
=== Using total flows (F_2022) component for denominator ===

. 
. capture drop F_2022

. gen double F_2022 = flow_total_2022 if bus_sample
(14,180 missing values generated)

. replace F_2022 = 0 if missing(F_2022) & bus_sample
(178 real changes made)

. 
. di as txt "Total flows (F_2022) summary:"
Total flows (F_2022) summary:

. summarize F_2022 if bus_sample, detail

                           F_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -1078000       -2660000
 5%    -243388.5       -1840000
10%       -93750       -1500000       Obs                 440
25%        -9000       -1200000       Sum of wgt.         440

50%            0                      Mean           17421.03
                        Largest       Std. dev.      373324.7
75%         5800        1463000
90%       126000        2550000       Variance       1.39e+11
95%       343050        2862500       Skewness       2.490904
99%      1456000        3450000       Kurtosis       39.65105

. tabstat F_2022 if bus_sample, stats(n mean sd p50 min max) format(%12.2f)

    Variable |            N         Mean           SD          p50          Min
-------------+-----------------------------------------------------------------
      F_2022 |       440.00     17421.03    373324.68         0.00  -2660000.00
-------------------------------------------------------------------------------

    Variable |          Max
-------------+-------------
      F_2022 |   3450000.00
---------------------------

. 
. * ---------------------------------------------------------------------
. * Numerator components for BUSINESS
. *  - F_bus_2022: net investment flows into business (flow_bus_2022)
. *  - yc_bus_2022: business income (int_bus_2022)
. *  - cg_bus_2022: capital gains from business
. * Treat missing components as 0 within the business sample
. * ---------------------------------------------------------------------
. di as txt "=== Building numerator components for business ==="
=== Building numerator components for business ===

. 
. capture drop F_bus_2022 yc_bus_2022

. gen double F_bus_2022  = .
(14,442 missing values generated)

. gen double yc_bus_2022 = .
(14,442 missing values generated)

. 
. replace F_bus_2022  = cond(missing(flow_bus_2022),0,flow_bus_2022) if bus_sample
(440 real changes made)

. replace yc_bus_2022 = cond(missing(int_bus_2022), 0,int_bus_2022)  if bus_sample
(440 real changes made)

. 
. di as txt "Business flows (F_bus_2022) summary:"
Business flows (F_bus_2022) summary:

. summarize F_bus_2022 if bus_sample, detail

                         F_bus_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%      -200000       -1000000
 5%       -30000       -1000000
10%       -10000        -300000       Obs                 440
25%            0        -200000       Sum of wgt.         440

50%            0                      Mean           11684.66
                        Largest       Std. dev.      238311.3
75%            0         685670
90%            0        1450000       Variance       5.68e+10
95%            0        2750000       Skewness       10.81066
99%       256000        3500000       Kurtosis       149.2888

. tabstat F_bus_2022 if bus_sample, stats(n mean sd p50 min max) format(%12.2f)

    Variable |            N         Mean           SD          p50          Min
-------------+-----------------------------------------------------------------
  F_bus_2022 |       440.00     11684.66    238311.30         0.00  -1000000.00
-------------------------------------------------------------------------------

    Variable |          Max
-------------+-------------
  F_bus_2022 |   3500000.00
---------------------------

. 
. di as txt "Business income (yc_bus_2022) summary:"
Business income (yc_bus_2022) summary:

. summarize yc_bus_2022 if bus_sample, detail

                         yc_bus_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 440
25%            0              0       Sum of wgt.         440

50%            0                      Mean           39118.38
                        Largest       Std. dev.        101865
75%        36000         540000
90%       101842         600000       Variance       1.04e+10
95%       186000         936000       Skewness       5.211556
99%       540000         960000       Kurtosis       37.56287

. tabstat yc_bus_2022 if bus_sample, stats(n mean sd p50 min max) format(%12.2f)

    Variable |            N         Mean           SD          p50          Min
-------------+-----------------------------------------------------------------
 yc_bus_2022 |       440.00     39118.38    101865.00         0.00         0.00
-------------------------------------------------------------------------------

    Variable |          Max
-------------+-------------
 yc_bus_2022 |    960000.00
---------------------------

. 
. * Capital gains already constructed in compute_cap_gains_2020_2022.do as cg_bus_2022
. capture confirm variable cg_bus_2022

. if _rc {
.     di as error "ERROR: cg_bus_2022 not found. Run compute_cap_gains_2020_2022.do first.
> "
.     exit 198
. }

. 
. di as txt "Business capital gains (cg_bus_2022) summary:"
Business capital gains (cg_bus_2022) summary:

. summarize cg_bus_2022 if bus_sample, detail

                         cg_bus_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -1000000       -1500000
 5%      -400000       -1000000
10%      -200000       -1000000       Obs                 249
25%            0       -1000000       Sum of wgt.         249

50%        10000                      Mean           223861.6
                        Largest       Std. dev.      978859.7
75%       199000        3100000
90%       808000        5000000       Variance       9.58e+11
95%      1300000        7000000       Skewness       6.426471
99%      5000000       1.03e+07       Kurtosis       57.09662

. tabstat cg_bus_2022 if bus_sample, stats(n mean sd p50 min max) format(%12.2f)

    Variable |            N         Mean           SD          p50          Min
-------------+-----------------------------------------------------------------
 cg_bus_2022 |       249.00    223861.57    978859.70     10000.00  -1500000.00
-------------------------------------------------------------------------------

    Variable |          Max
-------------+-------------
 cg_bus_2022 |  10250000.00
---------------------------

. 
. * ---------------------------------------------------------------------
. * Compute BUSINESS returns
. * Denominator: A_2020 + 0.5*F_2022 (same across all asset-class return files)
. * Apply final ≥$10k threshold to this denominator and compute returns
. * ---------------------------------------------------------------------
. di as txt "=== Computing business asset returns ==="
=== Computing business asset returns ===

. 
. capture drop denom_bus_2022

. gen double denom_bus_2022 = A_2020 + 0.5*F_2022 if bus_sample
(14,080 missing values generated)

. 
. gen byte denom_bus_positive   = denom_bus_2022 > 0 if bus_sample
(14,002 missing values generated)

. gen byte denom_bus_above_10k  = denom_bus_2022 >= 10000 if bus_sample
(14,002 missing values generated)

. 
. di as txt "Business denominator (A_2020 + 0.5*F_2022) summary BEFORE final threshold:"
Business denominator (A_2020 + 0.5*F_2022) summary BEFORE final threshold:

. summarize denom_bus_2022 if bus_sample, detail

                       denom_bus_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%      -156500        -299300
 5%         4250        -296000
10%        61500        -157000       Obs                 362
25%       259400        -156500       Sum of wgt.         362

50%       701420                      Mean            1480065
                        Largest       Std. dev.       2122607
75%      1815000       1.09e+07
90%      3796750       1.14e+07       Variance       4.51e+12
95%      6180000       1.15e+07       Skewness       2.762024
99%     1.09e+07       1.45e+07       Kurtosis       11.98615

. tabstat denom_bus_2022 if bus_sample, stats(n mean sd p50 min max) format(%12.2f)

    Variable |            N         Mean           SD          p50          Min
-------------+-----------------------------------------------------------------
denom_bus_~2 |       362.00   1480065.11   2122607.30    701420.00   -299300.00
-------------------------------------------------------------------------------

    Variable |          Max
-------------+-------------
denom_bus_~2 |  14461500.00
---------------------------

. 
. * Count before applying denominator threshold
. quietly count if bus_sample == 1

. local n_initial_sample = r(N)

. di as txt "Initial sample size before denominator threshold: `n_initial_sample'"
Initial sample size before denominator threshold: 440

. 
. replace bus_sample = bus_sample & denom_bus_above_10k
(21 real changes made)

. 
. di as txt "Final sample size after denominator threshold (≥$10k):"
Final sample size after denominator threshold (≥$10k):

. quietly count if bus_sample == 1

. local n_final_sample = r(N)

. di as txt "Final business sample size: `n_final_sample'"
Final business sample size: 419

. 
. di as txt "Business denominator (A_2020 + 0.5*F_2022) summary AFTER final threshold:"
Business denominator (A_2020 + 0.5*F_2022) summary AFTER final threshold:

. summarize denom_bus_2022 if bus_sample, detail

                       denom_bus_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%        19000          10000
 5%        69961          10750
10%       145000          11300       Obs                 341
25%       314000          19000       Sum of wgt.         341

50%       785000                      Mean            1574603
                        Largest       Std. dev.       2151438
75%      1902500       1.09e+07
90%      3861000       1.14e+07       Variance       4.63e+12
95%      6270000       1.15e+07       Skewness       2.707161
99%     1.09e+07       1.45e+07       Kurtosis       11.55536

. tabstat denom_bus_2022 if bus_sample, stats(n mean sd p50 min max) format(%12.2f)

    Variable |            N         Mean           SD          p50          Min
-------------+-----------------------------------------------------------------
denom_bus_~2 |       341.00   1574602.54   2151437.96    785000.00     10000.00
-------------------------------------------------------------------------------

    Variable |          Max
-------------+-------------
denom_bus_~2 |  14461500.00
---------------------------

. 
. * Final return
. capture drop r_bus_2022

. gen double r_bus_2022 = .
(14,442 missing values generated)

. replace r_bus_2022 = (yc_bus_2022 + cond(missing(cg_bus_2022),0,cg_bus_2022) - F_bus_202
> 2) / denom_bus_2022 if bus_sample
(341 real changes made)

. 
. * ---------------------------------------------------------------------
. * Report return statistics
. * ---------------------------------------------------------------------
. di as txt "=== Business asset returns summary ==="
=== Business asset returns summary ===

. 
. di as txt "Summary stats for business asset returns (r_bus_2022):"
Summary stats for business asset returns (r_bus_2022):

. summarize r_bus_2022 if bus_sample, detail

                         r_bus_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.4772277      -1.333333
 5%      -.24961      -.5558257
10%    -.1308901      -.5434783       Obs                 341
25%            0      -.4772277       Sum of wgt.         341

50%     .0520043                      Mean           .2369856
                        Largest       Std. dev.      .8603321
75%     .2070822       3.287861
90%     .6349206       3.425385       Variance       .7401712
95%     1.051988        3.72093       Skewness       9.431011
99%     3.287861          12.55       Kurtosis       126.4901

. tabstat r_bus_2022 if bus_sample, stats(n mean sd p50 min max) format(%12.4f)

    Variable |            N         Mean           SD          p50          Min
-------------+-----------------------------------------------------------------
  r_bus_2022 |     341.0000       0.2370       0.8603       0.0520      -1.3333
-------------------------------------------------------------------------------

    Variable |          Max
-------------+-------------
  r_bus_2022 |      12.5500
---------------------------

. 
. quietly count if !missing(r_bus_2022) & bus_sample

. local n_valid_returns = r(N)

. di as txt "Records with valid r_bus_2022 computed = `n_valid_returns' out of `n_final_sa
> mple' in business sample"
Records with valid r_bus_2022 computed = 341 out of 419 in business sample

. 
. * ---------------------------------------------------------------------
. * Apply trimming (top and bottom 5%)
. * ---------------------------------------------------------------------
. di as txt "=== Applying 5% trimming to business asset returns ==="
=== Applying 5% trimming to business asset returns ===

. 
. _pctile r_bus_2022 if bus_sample & !missing(r_bus_2022), p(5 95)

. scalar trim_low = r(r1)

. scalar trim_high = r(r2)

. 
. di as txt "Trim thresholds: `=trim_low' to `=trim_high'"
Trim thresholds: -.249609984399376 to 1.051987767584098

. 
. capture drop r_bus_2022_trim

. gen double r_bus_2022_trim = r_bus_2022 if bus_sample & !missing(r_bus_2022) & inrange(r
> _bus_2022, trim_low, trim_high)
(14,135 missing values generated)

. 
. quietly count if !missing(r_bus_2022_trim)

. local n_trim = r(N)

. quietly count if bus_sample & !missing(r_bus_2022)

. local n_original = r(N)

. di as txt "Observations after 5% trimming: `n_trim' (dropped `=`n_original'-`n_trim'')"
Observations after 5% trimming: 307 (dropped 34)

. 
. di as txt "Trimmed business asset returns summary:"
Trimmed business asset returns summary:

. summarize r_bus_2022_trim, detail

                       r_bus_2022_trim
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.2255639        -.24961
 5%    -.1377091      -.2493261
10%    -.0678571      -.2287283       Obs                 307
25%            0      -.2255639       Sum of wgt.         307

50%     .0520043                      Mean           .1318535
                        Largest       Std. dev.      .2364093
75%     .1914191        .957193
90%     .4937685       .9647979       Variance       .0558894
95%     .6559958       1.002358       Skewness       1.669432
99%      .957193       1.051988       Kurtosis       5.849444

. tabstat r_bus_2022_trim, stats(n mean sd p50 min max) format(%12.4f)

    Variable |            N         Mean           SD          p50          Min
-------------+-----------------------------------------------------------------
r_bus_2022~m |     307.0000       0.1319       0.2364       0.0520      -0.2496
-------------------------------------------------------------------------------

    Variable |          Max
-------------+-------------
r_bus_2022~m |       1.0520
---------------------------

. 
. * ---------------------------------------------------------------------
. * Diagnostics: extremes and zero-value checks
. * ---------------------------------------------------------------------
. di as txt "=== Diagnostics: extremes and components (business) ==="
=== Diagnostics: extremes and components (business) ===

. 
. di as txt "Top 20 positive business returns:"
Top 20 positive business returns:

. gsort -r_bus_2022

. list hhid rsubhh r_bus_2022 yc_bus_2022 cg_bus_2022 F_bus_2022 A_2020 F_2022 denom_bus_2
> 022 in 1/20 if bus_sample

     +----------------------------------------------------------------------------------+
  1. |   hhid | rsubhh | r_bu~2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 544898 |      0 |     12.55 |   104000 |   900000 |        0 |  257000 | -354000 |
     |----------------------------------------------------------------------------------|
     |                                     d~s_2022                                     |
     |                                        80000                                     |
     +----------------------------------------------------------------------------------+

     +----------------------------------------------------------------------------------+
  2. |   hhid | rsubhh | r_bu~2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 540779 |      0 | 3.7209302 |        0 |    25000 |   -15000 |   17000 |  -12500 |
     |----------------------------------------------------------------------------------|
     |                                     d~s_2022                                     |
     |                                        10750                                     |
     +----------------------------------------------------------------------------------+

     +----------------------------------------------------------------------------------+
  3. |   hhid | rsubhh | r_bu~2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 546459 |      0 |  3.425385 |        0 |  3100000 |  -125000 | 1014000 | -145000 |
     |----------------------------------------------------------------------------------|
     |                                     d~s_2022                                     |
     |                                       941500                                     |
     +----------------------------------------------------------------------------------+

     +----------------------------------------------------------------------------------+
  4. |   hhid | rsubhh | r_bu~2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 524825 |      0 | 3.2878613 |    72000 |  1350000 |        0 |  475000 |  -85000 |
     |----------------------------------------------------------------------------------|
     |                                     d~s_2022                                     |
     |                                       432500                                     |
     +----------------------------------------------------------------------------------+

     +----------------------------------------------------------------------------------+
  5. |   hhid | rsubhh | r_bu~2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 546113 |      0 | 2.9594173 |    72000 |  1200000 |  -150000 |  580500 | -200000 |
     |----------------------------------------------------------------------------------|
     |                                     d~s_2022                                     |
     |                                       480500                                     |
     +----------------------------------------------------------------------------------+

     +----------------------------------------------------------------------------------+
  6. |   hhid | rsubhh | r_bu~2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 542650 |      0 |      2.48 |    74400 |        . |        0 |   30000 |       0 |
     |----------------------------------------------------------------------------------|
     |                                     d~s_2022                                     |
     |                                        30000                                     |
     +----------------------------------------------------------------------------------+

     +----------------------------------------------------------------------------------+
  7. |   hhid | rsubhh | r_bu~2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 521546 |      0 | 2.3076923 |    52000 |   425000 |        0 |  206700 |       0 |
     |----------------------------------------------------------------------------------|
     |                                     d~s_2022                                     |
     |                                       206700                                     |
     +----------------------------------------------------------------------------------+

     +----------------------------------------------------------------------------------+
  8. |   hhid | rsubhh | r_bu~2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 525948 |      0 | 2.1428571 |    40000 |        . |   -20000 |   38000 |  -20000 |
     |----------------------------------------------------------------------------------|
     |                                     d~s_2022                                     |
     |                                        28000                                     |
     +----------------------------------------------------------------------------------+

     +----------------------------------------------------------------------------------+
  9. |   hhid | rsubhh | r_bu~2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 500923 |      0 | 2.0325733 |   312000 |        . |        0 |   51000 |  205000 |
     |----------------------------------------------------------------------------------|
     |                                     d~s_2022                                     |
     |                                       153500                                     |
     +----------------------------------------------------------------------------------+

     +----------------------------------------------------------------------------------+
 10. |   hhid | rsubhh | r_bu~2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 050365 |      0 |         2 |        0 |        . |  -300000 |  200000 | -100000 |
     |----------------------------------------------------------------------------------|
     |                                     d~s_2022                                     |
     |                                       150000                                     |
     +----------------------------------------------------------------------------------+

     +----------------------------------------------------------------------------------+
 11. |   hhid | rsubhh | r_bu~2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 535234 |      0 |     1.875 |    60000 |        . |        0 |   32000 |       0 |
     |----------------------------------------------------------------------------------|
     |                                     d~s_2022                                     |
     |                                        32000                                     |
     +----------------------------------------------------------------------------------+

     +----------------------------------------------------------------------------------+
 12. |   hhid | rsubhh | r_bu~2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 022267 |      0 | 1.7816979 |        0 |   808000 |        0 |  453500 |       0 |
     |----------------------------------------------------------------------------------|
     |                                     d~s_2022                                     |
     |                                       453500                                     |
     +----------------------------------------------------------------------------------+

     +----------------------------------------------------------------------------------+
 13. |   hhid | rsubhh | r_bu~2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 540353 |      0 | 1.6013485 |   280000 |    50000 |   -50000 |  374800 | -275000 |
     |----------------------------------------------------------------------------------|
     |                                     d~s_2022                                     |
     |                                       237300                                     |
     +----------------------------------------------------------------------------------+

     +----------------------------------------------------------------------------------+
 14. |   hhid | rsubhh | r_bu~2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 542565 |      1 |      1.56 |    24000 |   210000 |        0 |  150000 |       0 |
     |----------------------------------------------------------------------------------|
     |                                     d~s_2022                                     |
     |                                       150000                                     |
     +----------------------------------------------------------------------------------+

     +----------------------------------------------------------------------------------+
 15. |   hhid | rsubhh | r_bu~2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 147421 |      0 | 1.4893617 |        0 |  7000000 |        0 | 4700000 |       0 |
     |----------------------------------------------------------------------------------|
     |                                     d~s_2022                                     |
     |                                      4700000                                     |
     +----------------------------------------------------------------------------------+

     +----------------------------------------------------------------------------------+
 16. |   hhid | rsubhh | r_bu~2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 912069 |      0 | 1.4610778 |   144000 |   100000 |        0 |  187000 |  -40000 |
     |----------------------------------------------------------------------------------|
     |                                     d~s_2022                                     |
     |                                       167000                                     |
     +----------------------------------------------------------------------------------+

     +----------------------------------------------------------------------------------+
 17. |   hhid | rsubhh | r_bu~2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 501144 |      0 | 1.1149826 |   480000 |        . |        0 |  483000 | -105000 |
     |----------------------------------------------------------------------------------|
     |                                     d~s_2022                                     |
     |                                       430500                                     |
     +----------------------------------------------------------------------------------+

     +----------------------------------------------------------------------------------+
 18. |   hhid | rsubhh | r_bu~2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 053102 |      0 | 1.0519878 |    36000 |   480000 |        0 |  490500 |       0 |
     |----------------------------------------------------------------------------------|
     |                                     d~s_2022                                     |
     |                                       490500                                     |
     +----------------------------------------------------------------------------------+

     +----------------------------------------------------------------------------------+
 19. |   hhid | rsubhh | r_bu~2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 500369 |      0 | 1.0023585 |        0 |   850000 |        0 |  848000 |       0 |
     |----------------------------------------------------------------------------------|
     |                                     d~s_2022                                     |
     |                                       848000                                     |
     +----------------------------------------------------------------------------------+

     +----------------------------------------------------------------------------------+
 20. |   hhid | rsubhh | r_bu~2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 541495 |      0 | .96479791 |   180000 |  5000000 |        0 | 5472000 | -206000 |
     |----------------------------------------------------------------------------------|
     |                                     d~s_2022                                     |
     |                                      5369000                                     |
     +----------------------------------------------------------------------------------+

. 
. di as txt "Top 20 negative business returns:"
Top 20 negative business returns:

. gsort r_bus_2022

. list hhid rsubhh r_bus_2022 yc_bus_2022 cg_bus_2022 F_bus_2022 A_2020 F_2022 denom_bus_2
> 022 in 1/20 if bus_sample

     +-----------------------------------------------------------------------------------+
  1. |   hhid | rsubhh | r_bus_2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 052277 |      0 | -1.3333333 |        0 |        . |    40000 |   10000 |   40000 |
     |-----------------------------------------------------------------------------------|
     |                                     d~s_2022                                      |
     |                                        30000                                      |
     +-----------------------------------------------------------------------------------+

     +-----------------------------------------------------------------------------------+
  2. |   hhid | rsubhh | r_bus_2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 061215 |      0 | -.55582575 |        0 |  -400000 |        0 |  719500 |     300 |
     |-----------------------------------------------------------------------------------|
     |                                     d~s_2022                                      |
     |                                       719650                                      |
     +-----------------------------------------------------------------------------------+

     +-----------------------------------------------------------------------------------+
  3. |   hhid | rsubhh | r_bus_2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 546181 |      0 | -.54347826 |        0 |   -20000 |        0 |   36800 |       0 |
     |-----------------------------------------------------------------------------------|
     |                                     d~s_2022                                      |
     |                                        36800                                      |
     +-----------------------------------------------------------------------------------+

     +-----------------------------------------------------------------------------------+
  4. |   hhid | rsubhh | r_bus_2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 084443 |      0 | -.47722772 |    36000 | -1000000 |        0 | 2019000 |    2000 |
     |-----------------------------------------------------------------------------------|
     |                                     d~s_2022                                      |
     |                                      2020000                                      |
     +-----------------------------------------------------------------------------------+

     +-----------------------------------------------------------------------------------+
  5. |   hhid | rsubhh | r_bus_2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 540913 |      0 | -.44642857 |        0 |  -125000 |        0 |  280000 |       0 |
     |-----------------------------------------------------------------------------------|
     |                                     d~s_2022                                      |
     |                                       280000                                      |
     +-----------------------------------------------------------------------------------+

     +-----------------------------------------------------------------------------------+
  6. |   hhid | rsubhh | r_bus_2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 545688 |      0 | -.40609137 |        0 |  -400000 |        0 | 1030000 |  -90000 |
     |-----------------------------------------------------------------------------------|
     |                                     d~s_2022                                      |
     |                                       985000                                      |
     +-----------------------------------------------------------------------------------+

     +-----------------------------------------------------------------------------------+
  7. |   hhid | rsubhh | r_bus_2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 527009 |      0 | -.39768208 |        0 |        . |  3500000 | 7076000 | 3450000 |
     |-----------------------------------------------------------------------------------|
     |                                     d~s_2022                                      |
     |                                      8801000                                      |
     +-----------------------------------------------------------------------------------+

     +-----------------------------------------------------------------------------------+
  8. |   hhid | rsubhh | r_bus_2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 045606 |      0 |  -.3842892 |        0 |        . |  1450000 | 3041700 | 1463000 |
     |-----------------------------------------------------------------------------------|
     |                                     d~s_2022                                      |
     |                                      3773200                                      |
     +-----------------------------------------------------------------------------------+

     +-----------------------------------------------------------------------------------+
  9. |   hhid | rsubhh | r_bus_2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 534862 |      0 | -.37696697 |        0 |  -895000 |   195000 | 2794000 |  195000 |
     |-----------------------------------------------------------------------------------|
     |                                     d~s_2022                                      |
     |                                      2891500                                      |
     +-----------------------------------------------------------------------------------+

     +-----------------------------------------------------------------------------------+
 10. |   hhid | rsubhh | r_bus_2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 182994 |      1 | -.37404871 |      416 |  -250000 |        0 |  667500 |    -500 |
     |-----------------------------------------------------------------------------------|
     |                                     d~s_2022                                      |
     |                                       667250                                      |
     +-----------------------------------------------------------------------------------+

     +-----------------------------------------------------------------------------------+
 11. |   hhid | rsubhh | r_bus_2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 905375 |      0 | -.36934671 |        0 |  -385670 |   685670 | 2437000 |  927270 |
     |-----------------------------------------------------------------------------------|
     |                                     d~s_2022                                      |
     |                                      2900635                                      |
     +-----------------------------------------------------------------------------------+

     +-----------------------------------------------------------------------------------+
 12. |   hhid | rsubhh | r_bus_2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 911714 |      0 | -.32271945 |        0 | -1500000 |        0 | 4648000 |       0 |
     |-----------------------------------------------------------------------------------|
     |                                     d~s_2022                                      |
     |                                      4648000                                      |
     +-----------------------------------------------------------------------------------+

     +-----------------------------------------------------------------------------------+
 13. |   hhid | rsubhh | r_bus_2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 049448 |      0 |  -.3203075 |        0 |  -250000 |        0 |  783000 |   -5000 |
     |-----------------------------------------------------------------------------------|
     |                                     d~s_2022                                      |
     |                                       780500                                      |
     +-----------------------------------------------------------------------------------+

     +-----------------------------------------------------------------------------------+
 14. |   hhid | rsubhh | r_bus_2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 901850 |      0 | -.31920939 |   216000 |  -606000 |   256000 | 2070000 |  -92500 |
     |-----------------------------------------------------------------------------------|
     |                                     d~s_2022                                      |
     |                                      2023750                                      |
     +-----------------------------------------------------------------------------------+

     +-----------------------------------------------------------------------------------+
 15. |   hhid | rsubhh | r_bus_2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 502623 |      0 |   -.296875 |        0 |   -95000 |        0 |  320000 |       0 |
     |-----------------------------------------------------------------------------------|
     |                                     d~s_2022                                      |
     |                                       320000                                      |
     +-----------------------------------------------------------------------------------+

     +-----------------------------------------------------------------------------------+
 16. |   hhid | rsubhh | r_bus_2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 529218 |      0 | -.28074866 |        0 |  -230000 |   -20000 |  758000 |  -20000 |
     |-----------------------------------------------------------------------------------|
     |                                     d~s_2022                                      |
     |                                       748000                                      |
     +-----------------------------------------------------------------------------------+

     +-----------------------------------------------------------------------------------+
 17. |   hhid | rsubhh | r_bus_2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 018896 |      0 | -.25251335 |        0 |  -503600 |        0 | 1994000 |     700 |
     |-----------------------------------------------------------------------------------|
     |                                     d~s_2022                                      |
     |                                      1994350                                      |
     +-----------------------------------------------------------------------------------+

     +-----------------------------------------------------------------------------------+
 18. |   hhid | rsubhh | r_bus_2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 501579 |      0 | -.24960998 |        0 |        . |   240000 |  841500 |  240000 |
     |-----------------------------------------------------------------------------------|
     |                                     d~s_2022                                      |
     |                                       961500                                      |
     +-----------------------------------------------------------------------------------+

     +-----------------------------------------------------------------------------------+
 19. |   hhid | rsubhh | r_bus_2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 525037 |      0 | -.24932615 |    15000 |  -200000 |        0 |  742000 |       0 |
     |-----------------------------------------------------------------------------------|
     |                                     d~s_2022                                      |
     |                                       742000                                      |
     +-----------------------------------------------------------------------------------+

     +-----------------------------------------------------------------------------------+
 20. |   hhid | rsubhh | r_bus_2022 | yc_bus~2 | cg_bus~2 | F_bus_~2 |  A_2020 |  F_2022 |
     | 545546 |      0 | -.22872827 |        0 |  -127500 |    -2500 |  550000 |   -7000 |
     |-----------------------------------------------------------------------------------|
     |                                     d~s_2022                                      |
     |                                       546500                                      |
     +-----------------------------------------------------------------------------------+

. 
. di as txt "Top 20 trimmed business returns:"
Top 20 trimmed business returns:

. gsort -r_bus_2022_trim

. list hhid rsubhh r_bus_2022_trim yc_bus_2022 cg_bus_2022 F_bus_2022 A_2020 F_2022 denom_
> bus_2022 in 1/20 if !missing(r_bus_2022_trim)

     +-------------------------------------------------------------------------+
  1. |   hhid | rsubhh | r_bus_2~m | yc_bus~2 | cg_bus~2 | F_bus_~2 |   A_2020 |
     | 053102 |      0 | 1.0519878 |    36000 |   480000 |        0 |   490500 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              d~s_2022              |
     |                     0              |                490500              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
  2. |   hhid | rsubhh | r_bus_2~m | yc_bus~2 | cg_bus~2 | F_bus_~2 |   A_2020 |
     | 500369 |      0 | 1.0023585 |        0 |   850000 |        0 |   848000 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              d~s_2022              |
     |                     0              |                848000              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
  3. |   hhid | rsubhh | r_bus_2~m | yc_bus~2 | cg_bus~2 | F_bus_~2 |   A_2020 |
     | 541495 |      0 | .96479791 |   180000 |  5000000 |        0 |  5472000 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              d~s_2022              |
     |               -206000              |               5369000              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
  4. |   hhid | rsubhh | r_bus_2~m | yc_bus~2 | cg_bus~2 | F_bus_~2 |   A_2020 |
     | 034763 |      2 | .95719298 |   228000 |  2500000 |        0 |  3600000 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              d~s_2022              |
     |              -1500000              |               2850000              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
  5. |   hhid | rsubhh | r_bus_2~m | yc_bus~2 | cg_bus~2 | F_bus_~2 |   A_2020 |
     | 544774 |      0 | .95465394 |   160000 |        . |        0 |   167600 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              d~s_2022              |
     |                     0              |                167600              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
  6. |   hhid | rsubhh | r_bus_2~m | yc_bus~2 | cg_bus~2 | F_bus_~2 |   A_2020 |
     | 542617 |      0 | .89655172 |    52000 |        . |        0 |    -5500 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              d~s_2022              |
     |                127000              |                 58000              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
  7. |   hhid | rsubhh | r_bus_2~m | yc_bus~2 | cg_bus~2 | F_bus_~2 |   A_2020 |
     | 915086 |      0 | .89161878 |        0 |   450000 |        0 |   503200 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              d~s_2022              |
     |                  3000              |                504700              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
  8. |   hhid | rsubhh | r_bus_2~m | yc_bus~2 | cg_bus~2 | F_bus_~2 |   A_2020 |
     | 184024 |      0 | .79681275 |        0 |   600000 |        0 |   753000 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              d~s_2022              |
     |                     0              |                753000              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
  9. |   hhid | rsubhh | r_bus_2~m | yc_bus~2 | cg_bus~2 | F_bus_~2 |   A_2020 |
     | 542204 |      0 | .79533404 |        0 |   150000 |        0 |   193600 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              d~s_2022              |
     |                -10000              |                188600              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 10. |   hhid | rsubhh | r_bus_2~m | yc_bus~2 | cg_bus~2 | F_bus_~2 |   A_2020 |
     | 500402 |      2 | .78014184 |        0 |  1100000 |        0 |  1355000 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              d~s_2022              |
     |                110000              |               1410000              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 11. |   hhid | rsubhh | r_bus_2~m | yc_bus~2 | cg_bus~2 | F_bus_~2 |   A_2020 |
     | 529523 |      0 | .76863951 |        0 |   200000 |        0 |   260200 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              d~s_2022              |
     |                     0              |                260200              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 12. |   hhid | rsubhh | r_bus_2~m | yc_bus~2 | cg_bus~2 | F_bus_~2 |   A_2020 |
     | 545596 |      0 |       .75 |    30000 |        . |        0 |    40000 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              d~s_2022              |
     |                     0              |                 40000              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 13. |   hhid | rsubhh | r_bus_2~m | yc_bus~2 | cg_bus~2 | F_bus_~2 |   A_2020 |
     | 917499 |      2 | .73529412 |        0 |  1000000 |        0 |  1400000 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              d~s_2022              |
     |                -80000              |               1360000              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 14. |   hhid | rsubhh | r_bus_2~m | yc_bus~2 | cg_bus~2 | F_bus_~2 |   A_2020 |
     | 500094 |      0 |  .6993865 |   104000 |        . |   -10000 |   268000 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              d~s_2022              |
     |               -210000              |                163000              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 15. |   hhid | rsubhh | r_bus_2~m | yc_bus~2 | cg_bus~2 | F_bus_~2 |   A_2020 |
     | 522517 |      0 | .67092652 |        0 |  1025000 |   -25000 |  1580000 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              d~s_2022              |
     |                -30000              |               1565000              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 16. |   hhid | rsubhh | r_bus_2~m | yc_bus~2 | cg_bus~2 | F_bus_~2 |   A_2020 |
     | 541556 |      0 |  .6559958 |        0 | 10250000 |  2750000 | 10158000 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              d~s_2022              |
     |               2550000              |              11433000              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 17. |   hhid | rsubhh | r_bus_2~m | yc_bus~2 | cg_bus~2 | F_bus_~2 |   A_2020 |
     | 180872 |      0 | .63583815 |   360000 |   850000 |        0 |  1903000 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              d~s_2022              |
     |                     0              |               1903000              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 18. |   hhid | rsubhh | r_bus_2~m | yc_bus~2 | cg_bus~2 | F_bus_~2 |   A_2020 |
     | 084201 |      0 | .63492063 |   600000 |   200000 |        0 |  1260000 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              d~s_2022              |
     |                     0              |               1260000              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 19. |   hhid | rsubhh | r_bus_2~m | yc_bus~2 | cg_bus~2 | F_bus_~2 |   A_2020 |
     | 546030 |      0 | .63488692 |        0 |  1100000 |        0 |  1732592 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              d~s_2022              |
     |                     0              |               1732592              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 20. |   hhid | rsubhh | r_bus_2~m | yc_bus~2 | cg_bus~2 | F_bus_~2 |   A_2020 |
     | 543200 |      0 | .62663185 |   240000 |        . |        0 |   383000 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              d~s_2022              |
     |                     0              |                383000              |
     +-------------------------------------------------------------------------+

. 
. * ---------------------------------------------------------------------
. * Zero-value checks for components (business)
. * ---------------------------------------------------------------------
. di as txt "=== Zero-value checks for components (business) ==="
=== Zero-value checks for components (business) ===

. quietly count if yc_bus_2022 == 0 & bus_sample

. di as txt "yc_bus_2022 equals 0 in sample: " r(N)
yc_bus_2022 equals 0 in sample: 226

. quietly count if cg_bus_2022 == 0 & bus_sample

. di as txt "cg_bus_2022 equals 0 in sample: " r(N)
cg_bus_2022 equals 0 in sample: 44

. quietly count if F_bus_2022 == 0 & bus_sample

. di as txt "F_bus_2022 equals 0 in sample: " r(N)
F_bus_2022 equals 0 in sample: 333

. 
. * ---------------------------------------------------------------------
. * Save back to master
. * ---------------------------------------------------------------------
. save "`master'", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/cleaned/hrs_rand_2020_2022_
    > master.dta saved

. di as txt "Saved business asset return variables to master: `master'"
Saved business asset return variables to master: /Volumes/SSD PRO/Github-forks/Chp2-Belief
> sandTrust/Code/Data/HRS_RAND/cleaned/hrs_rand_2020_2022_master.dta

. 
. di as txt "Done. Business asset returns computed with 5% trimming."
Done. Business asset returns computed with 5% trimming.

. 
. 
. 
end of do-file

. do "/Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/cleaned/comput
> e_retirement_returns_2020_2022.do"

. *----------------------------------------------------------------------
. * RAND: compute_retirement_returns.do
. * Compute returns for RETIREMENT (IRA) assets for 2022
. * Using lowercase RAND variable names
. *
. * Formula: r_ira = (yc_ira + cg_ira - F_ira) / (A_2020 + 0.5*F_2022)
. *
. * Where:
. * - yc_ira = IRA payouts/annuity income (int_ira_2022)
. * - cg_ira = capital gains for IRA (cg_ira_2022)
. * - F_ira  = net investment flows into IRA (flow_ira_2022)
. * - A_2020 = total beginning period net worth (networth_A2020)
. * - F_2022 = total net investment flows (flow_total_2022)
. *----------------------------------------------------------------------
. clear all

. capture log close
