----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/cleaned/com
> pute_net_worth_A2020.log
  log type:  text
 opened on:  24 Sep 2025, 18:55:45

. 
. set more off

. 
. local master "/Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/cleaned/
> hrs_rand_2020_2022_master.dta"

. capture confirm file "`master'"

. if _rc {
.     di as error "ERROR: master file not found -> `master'"
.     exit 198
. }

. 
. use "`master'", clear

. di as txt "Using master file: `master'"
Using master file: /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/clean
> ed/hrs_rand_2020_2022_master.dta

. 
. local assets_vars "rh020 rh162 rq134 rq148 rq317 rq166_1 rq166_2 rq166_3 rq331 rq345 rq357 r
> q371 rq381"

. local liab_vars   "rh032 rh171 rq478"

. 
. di as txt "Checking presence of required 2020 variables..."
Checking presence of required 2020 variables...

. foreach v of local assets_vars {
  2.     capture confirm variable `v'
  3.     if _rc di as err "  MISSING asset var: `v'"
  4.     else di as txt "  OK asset var: `v'"
  5. }
  OK asset var: rh020
  OK asset var: rh162
  OK asset var: rq134
  OK asset var: rq148
  OK asset var: rq317
  OK asset var: rq166_1
  OK asset var: rq166_2
  OK asset var: rq166_3
  OK asset var: rq331
  OK asset var: rq345
  OK asset var: rq357
  OK asset var: rq371
  OK asset var: rq381

. foreach v of local liab_vars {
  2.     capture confirm variable `v'
  3.     if _rc di as err "  MISSING liability var: `v'"
  4.     else di as txt "  OK liability var: `v'"
  5. }
  OK liability var: rh032
  OK liability var: rh171
  OK liability var: rq478

. 
. capture drop n_assets_2020 n_liab_2020

. egen n_assets_2020 = rownonmiss(`assets_vars')

. egen n_liab_2020   = rownonmiss(`liab_vars')

. 
. capture drop assets_total_2020 liab_total_2020

. egen assets_total_2020 = rowtotal(`assets_vars')

. recast double assets_total_2020

. replace assets_total_2020 = . if n_assets_2020 == 0
(5,233 real changes made, 5,233 to missing)

. di as txt "Summary: assets_total_2020 (post-rowtotal / set to missing when no components):"
Summary: assets_total_2020 (post-rowtotal / set to missing when no components):

. summarize assets_total_2020, detail

                      assets_total_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%          600              0
10%         2275              0       Obs               9,209
25%        25000              0       Sum of wgt.       9,209

50%       200000                      Mean           932449.3
                        Largest       Std. dev.      3.44e+07
75%       500600       2.09e+07
90%      1120000       2.27e+07       Variance       1.19e+15
95%      1885000       1.00e+09       Skewness       85.62512
99%      4700000       3.15e+09       Kurtosis       7662.614

. quietly count if !missing(assets_total_2020)

. di as txt "Records with non-missing assets_total_2020 = " r(N)
Records with non-missing assets_total_2020 = 9209

. 
. egen liab_total_2020 = rowtotal(`liab_vars')

. recast double liab_total_2020

. replace liab_total_2020 = . if n_liab_2020 == 0
(9,851 real changes made, 9,851 to missing)

. di as txt "Summary: liab_total_2020 (post-rowtotal / set to missing when no components):"
Summary: liab_total_2020 (post-rowtotal / set to missing when no components):

. summarize liab_total_2020, detail

                       liab_total_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%          190              0
 5%          600              0
10%         1500              0       Obs               4,591
25%         5000              0       Sum of wgt.       4,591

50%        35000                      Mean           91461.56
                        Largest       Std. dev.      141965.4
75%       124000        1250000
90%       250000        1360000       Variance       2.02e+10
95%       350000        2500000       Skewness       5.062946
99%       600000        2970000       Kurtosis       65.79104

. quietly count if !missing(liab_total_2020)

. di as txt "Records with non-missing liab_total_2020 = " r(N)
Records with non-missing liab_total_2020 = 4591

. 
. capture drop networth_A2020

. gen double networth_A2020 = .
(14,442 missing values generated)

. replace networth_A2020 = (cond(missing(assets_total_2020),0,assets_total_2020) - cond(missin
> g(liab_total_2020),0,liab_total_2020)) if n_assets_2020 > 0
(9,209 real changes made)

. 
. di as txt "Summary: networth_A2020 (assets_total_2020 - liab_total_2020):"
Summary: networth_A2020 (assets_total_2020 - liab_total_2020):

. summarize networth_A2020, detail

                       networth_A2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%       -43500       -2442000
 5%        -3000        -999400
10%          500        -941000       Obs               9,209
25%        16000        -577000       Sum of wgt.       9,209

50%       152000                      Mean           887303.7
                        Largest       Std. dev.      3.44e+07
75%       437000       2.09e+07
90%      1052000       2.27e+07       Variance       1.19e+15
95%      1752000       1.00e+09       Skewness       85.62901
99%      4645000       3.15e+09       Kurtosis       7663.093

. tabstat networth_A2020, stats(n mean sd p50 min max) format(%12.2f)

    Variable |            N         Mean           SD          p50          Min          Max
-------------+------------------------------------------------------------------------------
networt~2020 |      9209.00    887303.71  34444564.39    152000.00  -2442000.00     3.15e+09
--------------------------------------------------------------------------------------------

. 
. quietly count if !missing(networth_A2020)

. di as txt "Records with networth_A2020 computed = " r(N) " out of " _N
Records with networth_A2020 computed = 9209 out of 14442

. 
. di as txt "Extremes: top 20 highest networth_A2020:"
Extremes: top 20 highest networth_A2020:

. gsort -networth_A2020

. list hhid rsubhh networth_A2020 assets_total_2020 liab_total_2020 n_assets_2020 n_liab_2020 
> in 1/20

     +-------------------------------------------------------------------------+
     |   hhid   rsubhh   netw~2020   ass~2020   lia~2020   n_a~2020   n_l~2020 |
     |-------------------------------------------------------------------------|
  1. | 912430        0   3.150e+09   3.15e+09     400000          3          1 |
  2. | 909496        0   1.000e+09   1.00e+09     180000          4          1 |
  3. | 039257        0    22671500   2.27e+07        500          7          1 |
  4. | 540746        0    20900000   2.09e+07          .          6          0 |
  5. | 525030        0    18465000   1.85e+07          .         10          0 |
     |-------------------------------------------------------------------------|
  6. | 149257        0    14205000   1.42e+07          .          8          0 |
  7. | 540637        0    14140000   1.41e+07          .          4          0 |
  8. | 500005        0    13100000   1.31e+07          .         10          0 |
  9. | 112575        0    12939000   1.33e+07     340000         10          1 |
 10. | 137440        0    12676724   1.27e+07          .          4          0 |
     |-------------------------------------------------------------------------|
 11. | 500044        0    12240000   1.22e+07          .          6          0 |
 12. | 544811        0    11305000   1.13e+07          .          8          0 |
 13. | 543381        0    11000000   1.10e+07          .          3          0 |
 14. | 045931        0    10940000   1.09e+07          .          6          0 |
 15. | 534186        0    10821000   1.09e+07      32000          7          1 |
     |-------------------------------------------------------------------------|
 16. | 501894        0    10475000   1.05e+07          .          8          0 |
 17. | 541556        0    10158000   1.08e+07     650000          8          2 |
 18. | 501770        1    10100000   1.01e+07          .          6          0 |
 19. | 500505        0    10001300   1.00e+07       1700          4          1 |
 20. | 131812        0     9366397    9366397          .          6          0 |
     +-------------------------------------------------------------------------+

. 
. di as txt "Extremes: top 20 lowest networth_A2020:"
Extremes: top 20 lowest networth_A2020:

. gsort networth_A2020

. list hhid rsubhh networth_A2020 assets_total_2020 liab_total_2020 n_assets_2020 n_liab_2020 
> in 1/20

     +------------------------------------------------------------------------+
     |   hhid   rsubhh   net~2020   ass~2020   lia~2020   n_a~2020   n_l~2020 |
     |------------------------------------------------------------------------|
  1. | 540507        0   -2442000      58000    2500000          2          1 |
  2. | 532166        0    -999400        600    1000000          1          1 |
  3. | 501738        2    -941000    2029000    2970000          5          1 |
  4. | 540582        0    -577000      23000     600000          2          2 |
  5. | 534696        0    -482500      17500     500000          2          2 |
     |------------------------------------------------------------------------|
  6. | 541034        0    -433000      17000     450000          2          2 |
  7. | 525319        0    -348000       2000     350000          2          2 |
  8. | 540022        0    -336000      14000     350000          2          1 |
  9. | 542385        1    -314500      65500     380000          3          2 |
 10. | 522879        0    -301000     492000     793000          4          2 |
     |------------------------------------------------------------------------|
 11. | 544864        0    -299300        700     300000          2          1 |
 12. | 545550        0    -270000      40000     310000          1          2 |
 13. | 531922        0    -225000      30000     255000          3          2 |
 14. | 544518        0    -219000      61000     280000          5          2 |
 15. | 542074        0    -200000          0     200000          1          1 |
     |------------------------------------------------------------------------|
 16. | 535408        5    -188000      12000     200000          2          1 |
 17. | 540426        0    -171000      10000     181000          2          1 |
 18. | 520426        0    -166000       4000     170000          2          1 |
 19. | 541461        0    -165000     245000     410000          3          2 |
 20. | 542530        0    -164800       5200     170000          2          2 |
     +------------------------------------------------------------------------+

. 
. di as txt "Cases where assets missing but liabilities present (networth computed treating as
> sets=0):"
Cases where assets missing but liabilities present (networth computed treating assets=0):

. quietly count if n_assets_2020==0 & n_liab_2020>0

. di as txt "  count = " r(N)
  count = 274

. quietly list hhid rsubhh assets_total_2020 liab_total_2020 n_assets_2020 n_liab_2020 in 1/20
>  if n_assets_2020==0 & n_liab_2020>0

. 
. di as txt "Cases where liabilities missing but assets present (networth computed treating li
> ab=0):"
Cases where liabilities missing but assets present (networth computed treating liab=0):

. quietly count if n_liab_2020==0 & n_assets_2020>0

. di as txt "  count = " r(N)
  count = 4892

. quietly list hhid rsubhh assets_total_2020 liab_total_2020 n_assets_2020 n_liab_2020 in 1/20
>  if n_liab_2020==0 & n_assets_2020>0

. 
. save "`master'", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/cleaned/hrs_rand_2020_2022_mast
    > er.dta saved

. di as txt "Saved A2020 net worth back to master: `master'"
Saved A2020 net worth back to master: /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/
> Data/HRS_RAND/cleaned/hrs_rand_2020_2022_master.dta

. 
. log close
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/cleaned/com
> pute_net_worth_A2020.log
  log type:  text
 closed on:  24 Sep 2025, 18:55:45
----------------------------------------------------------------------------------------------
