--------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/cle
> aned/compute_fin_asset_returns.log
  log type:  text
 opened on:  23 Sep 2025, 20:00:22

. 
. set more off

. 
. * ---------------------------------------------------------------------
. * Note: Prerequisite scripts must be run first:
. * - extract_household_2020_ret_calc_end
. * - extract_household_2022_ret_calc_start  
. * - merge_2020_2022
. * - compute_int_inc_div_2020_2022
. * - compute_net_inv_flows_2020_2022
. * - compute_debt_payments_2020_2022
. * - compute_cap_gains_2020_2022
. * - compute_beg_per_net_worth_2020_2022
. * ---------------------------------------------------------------------
. 
. local master "/Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/
> cleaned/hrs_rand_2020_2022_master.dta"

. capture confirm file "`master'"

. if _rc {
.     di as error "ERROR: master file not found -> `master'"
.     exit 198
. }

. 
. use "`master'", clear

. di as txt "Using master file: `master'"
Using master file: /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RA
> ND/cleaned/hrs_rand_2020_2022_master.dta

. 
. * ---------------------------------------------------------------------
. * Define financial asset sample: households with stocks OR bonds in both years
. * ---------------------------------------------------------------------
. di as txt "=== Defining financial asset sample ==="
=== Defining financial asset sample ===

. 
. * Check for stocks in both years (sq317 and rq317)
. gen byte has_stocks_both = !missing(sq317) & !missing(rq317)

. 
. * Check for bonds in both years (sq331 and rq331)  
. gen byte has_bonds_both = !missing(sq331) & !missing(rq331)

. 
. * Financial asset sample: must have either stocks OR bonds in both years
. gen byte fin_sample = has_stocks_both | has_bonds_both

. 
. * Report sample statistics
. di as txt "Sample definition results:"
Sample definition results:

. tab fin_sample, missing

 fin_sample |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     13,737       95.12       95.12
          1 |        705        4.88      100.00
------------+-----------------------------------
      Total |     14,442      100.00

. quietly count if fin_sample == 1

. local n_fin_sample = r(N)

. quietly count

. local n_total = r(N)

. di as txt "Households in financial asset sample: `n_fin_sample' out of `n_total' (" 
> %4.1f 100*`n_fin_sample'/`n_total' "%)"
Households in financial asset sample: 705 out of 14442 ( 4.9%)

. 
. * Breakdown by asset type
. di as txt "Breakdown by asset type:"
Breakdown by asset type:

. tab has_stocks_both has_bonds_both, missing

has_stocks |    has_bonds_both
     _both |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,737         26 |    13,763 
         1 |       640         39 |       679 
-----------+----------------------+----------
     Total |    14,377         65 |    14,442 

. quietly count if has_stocks_both & has_bonds_both

. di as txt "Households with BOTH stocks and bonds in both years: " r(N)
Households with BOTH stocks and bonds in both years: 39

. quietly count if has_stocks_both & !has_bonds_both

. di as txt "Households with stocks only (both years): " r(N)
Households with stocks only (both years): 640

. quietly count if !has_stocks_both & has_bonds_both

. di as txt "Households with bonds only (both years): " r(N)
Households with bonds only (both years): 26

. 
. * ---------------------------------------------------------------------
. * Use total wealth (beginning of period net worth) as denominator
. * ---------------------------------------------------------------------
. di as txt "=== Using total wealth (A_2020) as denominator ==="
=== Using total wealth (A_2020) as denominator ===

. 
. * Use existing networth_A2020 (total beginning of period wealth)
. capture drop A_2020

. gen double A_2020 = networth_A2020 if fin_sample
(13,737 missing values generated)

. 
. * Apply wealth threshold (10k minimum) to restrict sample
. gen byte A_positive = A_2020 > 0 if fin_sample
(13,737 missing values generated)

. gen byte A_above_10k = A_2020 >= 10000 if fin_sample
(13,737 missing values generated)

. 
. di as txt "Total wealth (A_2020) summary (before final denominator threshold):"
Total wealth (A_2020) summary (before final denominator threshold):

. summarize A_2020 if fin_sample, detail

                           A_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%         2000         -49000
 5%        55000         -41700
10%       189000         -32000       Obs                 705
25%       459000         -31700       Sum of wgt.         705

50%       938000                      Mean            1588848
                        Largest       Std. dev.       2105237
75%      1850000       1.31e+07
90%      3683700       1.42e+07       Variance       4.43e+12
95%      5035000       1.85e+07       Skewness        4.09144
99%     1.05e+07       2.27e+07       Kurtosis       28.79231

. tabstat A_2020 if fin_sample, stats(n mean sd p50 min max) format(%12.2f)

    Variable |            N         Mean           SD          p50          Min
-------------+-----------------------------------------------------------------
      A_2020 |       705.00   1588847.66   2105236.84    938000.00    -49000.00
-------------------------------------------------------------------------------

    Variable |          Max
-------------+-------------
      A_2020 |  22671500.00
---------------------------

. 
. di as txt "Initial wealth threshold results:"
Initial wealth threshold results:

. quietly count if fin_sample == 1

. local n_initial_sample = r(N)

. di as txt "Initial sample size after beginning wealth threshold (≥$10k): `n_initial_
> sample'"
Initial sample size after beginning wealth threshold (≥$10k): 705

. tab A_positive if fin_sample, missing

 A_positive |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          6        0.85        0.85
          1 |        699       99.15      100.00
------------+-----------------------------------
      Total |        705      100.00

. tab A_above_10k if fin_sample, missing

A_above_10k |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         13        1.84        1.84
          1 |        692       98.16      100.00
------------+-----------------------------------
      Total |        705      100.00

. 
. * ---------------------------------------------------------------------
. * Compute financial asset flows (F_fin_2022) for numerator
. * ---------------------------------------------------------------------
. di as txt "=== Computing financial asset flows (F_fin_2022) for numerator ==="
=== Computing financial asset flows (F_fin_2022) for numerator ===

. 
. * Financial asset flows = stock flows only (bonds have no flows)
. capture drop F_fin_2022

. gen double F_fin_2022 = .
(14,442 missing values generated)

. * For stocks: use flow_stk_2022, treat missing as 0 if they have stocks in both year
> s
. * For bonds: no flows, so always 0
. replace F_fin_2022 = cond(missing(flow_stk_2022),0,flow_stk_2022) if fin_sample
(705 real changes made)

. 
. di as txt "Financial asset flows (F_fin_2022) summary:"
Financial asset flows (F_fin_2022) summary:

. summarize F_fin_2022 if fin_sample, detail

                         F_fin_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%      -100000       -2000000
 5%        -2000        -300000
10%            0        -250000       Obs                 705
25%            0        -200000       Sum of wgt.         705

50%            0                      Mean            11008.8
                        Largest       Std. dev.      123125.8
75%            0         600000
90%        10000         730000       Variance       1.52e+10
95%        78000        1000000       Skewness      -1.458358
99%       400000        1600000       Kurtosis       151.3284

. tabstat F_fin_2022 if fin_sample, stats(n mean sd p50 min max) format(%12.2f)

    Variable |            N         Mean           SD          p50          Min
-------------+-----------------------------------------------------------------
  F_fin_2022 |       705.00     11008.80    123125.79         0.00  -2000000.00
-------------------------------------------------------------------------------

    Variable |          Max
-------------+-------------
  F_fin_2022 |   1600000.00
---------------------------

. 
. * ---------------------------------------------------------------------
. * Use total flows (F_2022) as denominator
. * ---------------------------------------------------------------------
. di as txt "=== Using total flows (F_2022) as denominator ==="
=== Using total flows (F_2022) as denominator ===

. 
. * Use existing flow_total_2022 (total net investment flows)
. capture drop F_2022

. gen double F_2022 = flow_total_2022 if fin_sample
(13,953 missing values generated)

. * Treat missing total flows as 0 for financial sample
. replace F_2022 = 0 if missing(F_2022) & fin_sample
(216 real changes made)

. 
. di as txt "Total flows (F_2022) summary:"
Total flows (F_2022) summary:

. summarize F_2022 if fin_sample, detail

                           F_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%      -561000       -6400000
 5%      -120000       -2050000
10%       -50000       -1750000       Obs                 705
25%            0       -1000000       Sum of wgt.         705

50%            0                      Mean           32016.28
                        Largest       Std. dev.      375246.8
75%        28000        1456000
90%       150000        2550000       Variance       1.41e+11
95%       371100        2862500       Skewness      -5.164601
99%       950000        3450000       Kurtosis       143.3218

. tabstat F_2022 if fin_sample, stats(n mean sd p50 min max) format(%12.2f)

    Variable |            N         Mean           SD          p50          Min
-------------+-----------------------------------------------------------------
      F_2022 |       705.00     32016.28    375246.84         0.00  -6400000.00
-------------------------------------------------------------------------------

    Variable |          Max
-------------+-------------
      F_2022 |   3450000.00
---------------------------

. 
. * ---------------------------------------------------------------------
. * Compute financial asset interest income (yc_fin_2022)
. * ---------------------------------------------------------------------
. di as txt "=== Computing financial asset interest income (yc_fin_2022) ==="
=== Computing financial asset interest income (yc_fin_2022) ===

. 
. * Financial asset interest = stocks + bonds + checking/savings + CDs
. capture drop yc_fin_2022

. gen double yc_fin_2022 = .
(14,442 missing values generated)

. * Sum interest income from financial assets, treat missing as 0 if they have financi
> al assets
. replace yc_fin_2022 = cond(missing(int_stk_2022),0,int_stk_2022) + ///
>                      cond(missing(int_bnd_2022),0,int_bnd_2022) + ///
>                      cond(missing(int_cash_2022),0,int_cash_2022) + ///
>                      cond(missing(int_cds_2022),0,int_cds_2022) if fin_sample
(705 real changes made)

. 
. di as txt "Financial asset interest income (yc_fin_2022) summary:"
Financial asset interest income (yc_fin_2022) summary:

. summarize yc_fin_2022 if fin_sample, detail

                         yc_fin_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 705
25%            0              0       Sum of wgt.         705

50%           12                      Mean           7047.081
                        Largest       Std. dev.      40679.19
75%         1000         201000
90%        11400         240000       Variance       1.65e+09
95%        31500         520300       Skewness       14.12035
99%       120000         800000       Kurtosis       244.6143

. tabstat yc_fin_2022 if fin_sample, stats(n mean sd p50 min max) format(%12.2f)

    Variable |            N         Mean           SD          p50          Min
-------------+-----------------------------------------------------------------
 yc_fin_2022 |       705.00      7047.08     40679.19        12.00         0.00
-------------------------------------------------------------------------------

    Variable |          Max
-------------+-------------
 yc_fin_2022 |    800000.00
---------------------------

. 
. * ---------------------------------------------------------------------
. * Compute financial asset capital gains (cg_fin_2022)
. * ---------------------------------------------------------------------
. di as txt "=== Computing financial asset capital gains (cg_fin_2022) ==="
=== Computing financial asset capital gains (cg_fin_2022) ===

. 
. * Financial asset capital gains = stocks + bonds
. capture drop cg_fin_2022

. gen double cg_fin_2022 = .
(14,442 missing values generated)

. * Sum capital gains from financial assets, treat missing as 0 if they have financial
>  assets
. replace cg_fin_2022 = cond(missing(cg_stk_2022),0,cg_stk_2022) + ///
>                      cond(missing(cg_bnd_2022),0,cg_bnd_2022) if fin_sample
(705 real changes made)

. 
. di as txt "Financial asset capital gains (cg_fin_2022) summary:"
Financial asset capital gains (cg_fin_2022) summary:

. summarize cg_fin_2022 if fin_sample, detail

                         cg_fin_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -1200000       -4100000
 5%      -372000       -2600000
10%      -195000       -2300000       Obs                 705
25%       -17000       -2300000       Sum of wgt.         705

50%         6900                      Mean           112075.7
                        Largest       Std. dev.      681656.9
75%       100000        4600000
90%       400000        5000000       Variance       4.65e+11
95%       825000        6423425       Skewness       4.323212
99%      2880000        7553000       Kurtosis       44.54329

. tabstat cg_fin_2022 if fin_sample, stats(n mean sd p50 min max) format(%12.2f)

    Variable |            N         Mean           SD          p50          Min
-------------+-----------------------------------------------------------------
 cg_fin_2022 |       705.00    112075.67    681656.93      6900.00  -4100000.00
-------------------------------------------------------------------------------

    Variable |          Max
-------------+-------------
 cg_fin_2022 |   7553000.00
---------------------------

. 
. * ---------------------------------------------------------------------
. * Compute financial asset returns
. * ---------------------------------------------------------------------
. di as txt "=== Computing financial asset returns ==="
=== Computing financial asset returns ===

. 
. * Denominator: A_2020 + 0.5*F_2022
. capture drop denom_fin_2022

. gen double denom_fin_2022 = A_2020 + 0.5*F_2022 if fin_sample
(13,737 missing values generated)

. 
. * Check for positive denominators and apply final wealth threshold
. gen byte denom_fin_positive = denom_fin_2022 > 0 if fin_sample
(13,737 missing values generated)

. gen byte denom_fin_above_10k = denom_fin_2022 >= 10000 if fin_sample
(13,737 missing values generated)

. 
. di as txt "Financial asset denominator (A_2020 + 0.5*F_2022) summary BEFORE final th
> reshold:"
Financial asset denominator (A_2020 + 0.5*F_2022) summary BEFORE final threshold:

. summarize denom_fin_2022 if fin_sample, detail

                       denom_fin_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%       -15000        -130900
 5%        54000         -61200
10%       195000         -49000       Obs                 705
25%       457250         -32350       Sum of wgt.         705

50%       950000                      Mean            1604856
                        Largest       Std. dev.       2141048
75%      1863601       1.35e+07
90%      3615000       1.45e+07       Variance       4.58e+12
95%      4972500       1.88e+07       Skewness       4.078386
99%     1.14e+07       2.27e+07       Kurtosis       28.16701

. tabstat denom_fin_2022 if fin_sample, stats(n mean sd p50 min max) format(%12.2f)

    Variable |            N         Mean           SD          p50          Min
-------------+-----------------------------------------------------------------
denom_f~2022 |       705.00   1604855.80   2141047.57    950000.00   -130900.00
-------------------------------------------------------------------------------

    Variable |          Max
-------------+-------------
denom_f~2022 |  22671500.00
---------------------------

. 
. di as txt "Financial asset denominator thresholds:"
Financial asset denominator thresholds:

. tab denom_fin_positive if fin_sample, missing

denom_fin_p |
    ositive |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          8        1.13        1.13
          1 |        697       98.87      100.00
------------+-----------------------------------
      Total |        705      100.00

. tab denom_fin_above_10k if fin_sample, missing

denom_fin_a |
   bove_10k |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         13        1.84        1.84
          1 |        692       98.16      100.00
------------+-----------------------------------
      Total |        705      100.00

. 
. * Update financial sample to include final denominator threshold
. replace fin_sample = fin_sample & denom_fin_above_10k
(13 real changes made)

. 
. di as txt "Final sample restriction results:"
Final sample restriction results:

. quietly count if fin_sample == 1

. local n_final_sample = r(N)

. di as txt "Final sample size after denominator threshold (≥$10k): `n_final_sample'"
Final sample size after denominator threshold (≥$10k): 692

. di as txt "Observations dropped due to negative/small denominators: `=`n_initial_sam
> ple'-`n_final_sample''"
Observations dropped due to negative/small denominators: 13

. 
. di as txt "Financial asset denominator (A_2020 + 0.5*F_2022) summary AFTER final thr
> eshold:"
Financial asset denominator (A_2020 + 0.5*F_2022) summary AFTER final threshold:

. summarize denom_fin_2022 if fin_sample, detail

                       denom_fin_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%        19350          10000
 5%        98000          11000
10%       231000          11100       Obs                 692
25%     475504.5          11500       Sum of wgt.         692

50%       968400                      Mean            1635494
                        Largest       Std. dev.       2149261
75%      1904750       1.35e+07
90%      3630750       1.45e+07       Variance       4.62e+12
95%      5367500       1.88e+07       Skewness       4.073156
99%     1.15e+07       2.27e+07       Kurtosis       28.02164

. tabstat denom_fin_2022 if fin_sample, stats(n mean sd p50 min max) format(%12.2f)

    Variable |            N         Mean           SD          p50          Min
-------------+-----------------------------------------------------------------
denom_f~2022 |       692.00   1635493.84   2149260.52    968400.00     10000.00
-------------------------------------------------------------------------------

    Variable |          Max
-------------+-------------
denom_f~2022 |  22671500.00
---------------------------

. 
. * ---------------------------------------------------------------------
. * Summary of all key components before return calculation
. * ---------------------------------------------------------------------
. di as txt "=== Summary of all key components ==="
=== Summary of all key components ===

. 
. di as txt "Numerator components:"
Numerator components:

. di as txt "  Interest income (yc_fin_2022):"
  Interest income (yc_fin_2022):

. summarize yc_fin_2022 if fin_sample, detail

                         yc_fin_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 692
25%            0              0       Sum of wgt.         692

50%           12                      Mean           7175.942
                        Largest       Std. dev.      41049.01
75%         1090         201000
90%        12000         240000       Variance       1.69e+09
95%        32000         520300       Skewness       13.99152
99%       144000         800000       Kurtosis       240.1864

. di as txt "  Capital gains (cg_fin_2022):"
  Capital gains (cg_fin_2022):

. summarize cg_fin_2022 if fin_sample, detail

                         cg_fin_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -1500000       -4100000
 5%      -380000       -2600000
10%      -199000       -2300000       Obs                 692
25%       -20000       -2300000       Sum of wgt.         692

50%         6950                      Mean           113084.8
                        Largest       Std. dev.      687606.8
75%       100000        4600000
90%       400000        5000000       Variance       4.73e+11
95%       894996        6423425       Skewness       4.286265
99%      2980000        7553000       Kurtosis        43.8063

. di as txt "  Net investment flows (F_fin_2022):"
  Net investment flows (F_fin_2022):

. summarize F_fin_2022 if fin_sample, detail

                         F_fin_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%      -100000       -2000000
 5%        -2000        -250000
10%            0        -200000       Obs                 692
25%            0        -200000       Sum of wgt.         692

50%            0                      Mean           11639.02
                        Largest       Std. dev.      123704.8
75%            0         600000
90%        12000         730000       Variance       1.53e+10
95%        80000        1000000       Skewness       -1.45732
99%       500000        1600000       Kurtosis        151.285

. 
. di as txt "Denominator components:"
Denominator components:

. di as txt "  Beginning wealth (A_2020):"
  Beginning wealth (A_2020):

. summarize A_2020 if fin_sample, detail

                           A_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%        17000           9600
 5%        96500          10000
10%       227000          11000       Obs                 692
25%       474500          11500       Sum of wgt.         692

50%       956500                      Mean            1618900
                        Largest       Std. dev.       2113373
75%      1875253       1.31e+07
90%      3696000       1.42e+07       Variance       4.47e+12
95%      5110000       1.85e+07       Skewness       4.085986
99%     1.08e+07       2.27e+07       Kurtosis       28.64566

. di as txt "  Total flows (F_2022):"
  Total flows (F_2022):

. summarize F_2022 if fin_sample, detail

                           F_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%      -611000       -6400000
 5%      -120000       -2050000
10%       -50000       -1750000       Obs                 692
25%            0       -1000000       Sum of wgt.         692

50%            0                      Mean           33187.11
                        Largest       Std. dev.      378502.6
75%        30000        1456000
90%       152000        2550000       Variance       1.43e+11
95%       375000        2862500       Skewness      -5.135485
99%       950000        3450000       Kurtosis        141.125

. di as txt "  Final denominator (A_2020 + 0.5*F_2022):"
  Final denominator (A_2020 + 0.5*F_2022):

. summarize denom_fin_2022 if fin_sample, detail

                       denom_fin_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%        19350          10000
 5%        98000          11000
10%       231000          11100       Obs                 692
25%     475504.5          11500       Sum of wgt.         692

50%       968400                      Mean            1635494
                        Largest       Std. dev.       2149261
75%      1904750       1.35e+07
90%      3630750       1.45e+07       Variance       4.62e+12
95%      5367500       1.88e+07       Skewness       4.073156
99%     1.15e+07       2.27e+07       Kurtosis       28.02164

. 
. * Cross-tabulation of component presence
. di as txt "Component presence patterns:"
Component presence patterns:

. quietly count if !missing(yc_fin_2022) & fin_sample

. di as txt "  yc_fin_2022 non-missing: " r(N)
  yc_fin_2022 non-missing: 692

. quietly count if !missing(cg_fin_2022) & fin_sample

. di as txt "  cg_fin_2022 non-missing: " r(N)
  cg_fin_2022 non-missing: 692

. quietly count if !missing(F_fin_2022) & fin_sample

. di as txt "  F_fin_2022 non-missing: " r(N)
  F_fin_2022 non-missing: 692

. quietly count if !missing(A_2020) & fin_sample

. di as txt "  A_2020 non-missing: " r(N)
  A_2020 non-missing: 692

. quietly count if !missing(F_2022) & fin_sample

. di as txt "  F_2022 non-missing: " r(N)
  F_2022 non-missing: 692

. 
. * Return calculation (sample already filtered for positive denominators ≥$10k)
. capture drop r_fin_2022

. gen double r_fin_2022 = .
(14,442 missing values generated)

. replace r_fin_2022 = (yc_fin_2022 + cg_fin_2022 - F_fin_2022) / denom_fin_2022 if fi
> n_sample
(692 real changes made)

. 
. * ---------------------------------------------------------------------
. * Report return statistics
. * ---------------------------------------------------------------------
. di as txt "=== Financial asset returns summary ==="
=== Financial asset returns summary ===

. 
. di as txt "Summary stats for financial asset returns (r_fin_2022):"
Summary stats for financial asset returns (r_fin_2022):

. summarize r_fin_2022 if fin_sample, detail

                         r_fin_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.6466165      -2.633333
 5%    -.3300971      -1.419557
10%     -.179937      -.9520683       Obs                 692
25%    -.0350476      -.7853403       Sum of wgt.         692

50%     .0097633                      Mean           .0715752
                        Largest       Std. dev.      .3694235
75%     .1256258       2.242949
90%     .3319735       2.333333       Variance       .1364737
95%     .6322414       2.349256       Skewness       2.545212
99%     1.938484       3.464286       Kurtosis        26.7407

. tabstat r_fin_2022 if fin_sample, stats(n mean sd p50 min max) format(%12.4f)

    Variable |            N         Mean           SD          p50          Min
-------------+-----------------------------------------------------------------
  r_fin_2022 |     692.0000       0.0716       0.3694       0.0098      -2.6333
-------------------------------------------------------------------------------

    Variable |          Max
-------------+-------------
  r_fin_2022 |       3.4643
---------------------------

. 
. * Count valid returns
. quietly count if !missing(r_fin_2022) & fin_sample

. local n_valid_returns = r(N)

. di as txt "Records with valid r_fin_2022 computed = `n_valid_returns' out of `n_fin_
> sample' in financial sample"
Records with valid r_fin_2022 computed = 692 out of 705 in financial sample

. 
. * ---------------------------------------------------------------------
. * Apply trimming (top and bottom 5%)
. * ---------------------------------------------------------------------
. di as txt "=== Applying 5% trimming to financial asset returns ==="
=== Applying 5% trimming to financial asset returns ===

. 
. * Calculate trim thresholds (5% from each tail)
. _pctile r_fin_2022 if fin_sample & !missing(r_fin_2022), p(5 95)

. scalar trim_low = r(r1)

. scalar trim_high = r(r2)

. 
. di as txt "Trim thresholds: `=trim_low' to `=trim_high'"
Trim thresholds: -.3300970873786408 to .6322413691701464

. 
. * Create trimmed returns
. capture drop r_fin_2022_trim

. gen double r_fin_2022_trim = r_fin_2022 if fin_sample & !missing(r_fin_2022) & inran
> ge(r_fin_2022, trim_low, trim_high)
(13,818 missing values generated)

. 
. * Report trimming results
. quietly count if !missing(r_fin_2022_trim)

. local n_trim = r(N)

. quietly count if fin_sample & !missing(r_fin_2022)

. local n_original = r(N)

. di as txt "Observations after 5% trimming: `n_trim' (dropped `=`n_original'-`n_trim'
> ')"
Observations after 5% trimming: 624 (dropped 68)

. 
. * Trimmed returns summary
. di as txt "Trimmed financial asset returns summary:"
Trimmed financial asset returns summary:

. summarize r_fin_2022_trim, detail

                       r_fin_2022_trim
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.2928092      -.3300971
 5%    -.1917808      -.3270646
10%    -.1102536       -.322029       Obs                 624
25%    -.0229774      -.3177585       Sum of wgt.         624

50%     .0097633                      Mean           .0454196
                        Largest       Std. dev.      .1508367
75%     .1081561       .6009215
90%     .2514714        .602066       Variance       .0227517
95%     .3391985       .6174765       Skewness       .8173236
99%     .5049046       .6322414       Kurtosis        4.67145

. tabstat r_fin_2022_trim, stats(n mean sd p50 min max) format(%12.4f)

    Variable |            N         Mean           SD          p50          Min
-------------+-----------------------------------------------------------------
r_fin_2022~m |     624.0000       0.0454       0.1508       0.0098      -0.3301
-------------------------------------------------------------------------------

    Variable |          Max
-------------+-------------
r_fin_2022~m |       0.6322
---------------------------

. 
. * ---------------------------------------------------------------------
. * Diagnostics: show extremes and component breakdowns
. * ---------------------------------------------------------------------
. di as txt "=== Diagnostics: extreme returns and component inspection ==="
=== Diagnostics: extreme returns and component inspection ===

. 
. di as txt "Top 20 positive financial asset returns:"
Top 20 positive financial asset returns:

. gsort -r_fin_2022

. list hhid rsubhh r_fin_2022 yc_fin_2022 cg_fin_2022 F_fin_2022 A_2020 F_2022 denom_f
> in_2022 in 1/20 if fin_sample

     +------------------------------------------------------------------------+
  1. |   hhid | rsubhh | r_fi~2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 022242 |      0 | 3.4642857 |        0 |    97000 |        0 |   28000 |
     |------------------------------------------------------------------------|
     |               F_2022              |              den~2022              |
     |                    0              |                 28000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
  2. |   hhid | rsubhh | r_fi~2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 546280 |      0 | 2.3492561 |        0 |  1500000 |        0 | 3838500 |
     |------------------------------------------------------------------------|
     |               F_2022              |              den~2022              |
     |             -6400000              |                638500              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
  3. |   hhid | rsubhh | r_fi~2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 542121 |      2 | 2.3333333 |        0 |    70000 |        0 |   30000 |
     |------------------------------------------------------------------------|
     |               F_2022              |              den~2022              |
     |                    0              |                 30000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
  4. |   hhid | rsubhh | r_fi~2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 212649 |      0 | 2.2429495 |    61560 |  4600000 | -2000000 | 3845000 |
     |------------------------------------------------------------------------|
     |               F_2022              |              den~2022              |
     |             -1750000              |               2970000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
  5. |   hhid | rsubhh | r_fi~2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 527967 |      1 | 2.0769231 |        0 |  1350000 |        0 |  650000 |
     |------------------------------------------------------------------------|
     |               F_2022              |              den~2022              |
     |                    0              |                650000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
  6. |   hhid | rsubhh | r_fi~2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 075831 |      0 |  2.060044 |      300 |  2880000 |        0 | 1322000 |
     |------------------------------------------------------------------------|
     |               F_2022              |              den~2022              |
     |               152348              |               1398174              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
  7. |   hhid | rsubhh | r_fi~2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 050598 |      0 | 1.9384835 |        0 |  1365000 |    10000 |  694000 |
     |------------------------------------------------------------------------|
     |               F_2022              |              den~2022              |
     |                10000              |                699000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
  8. |   hhid | rsubhh | r_fi~2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 502452 |      0 | 1.7154936 |       40 |  7553000 |    30000 | 4367100 |
     |------------------------------------------------------------------------|
     |               F_2022              |              den~2022              |
     |                36500              |               4385350              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
  9. |   hhid | rsubhh | r_fi~2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 038510 |      0 | 1.4807947 |      120 |   939000 |        0 |  640000 |
     |------------------------------------------------------------------------|
     |               F_2022              |              den~2022              |
     |               -11600              |                634200              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 10. |   hhid | rsubhh | r_fi~2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 183461 |      0 | 1.4352191 |     1200 |  1800000 |        0 | 1255000 |
     |------------------------------------------------------------------------|
     |               F_2022              |              den~2022              |
     |                    0              |               1255000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 11. |   hhid | rsubhh | r_fi~2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 543927 |      0 | 1.3399154 |        0 |  2375000 |        0 | 1785000 |
     |------------------------------------------------------------------------|
     |               F_2022              |              den~2022              |
     |               -25000              |               1772500              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 12. |   hhid | rsubhh | r_fi~2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 545526 |      0 | 1.2902502 |    32144 |  2000000 |        0 | 1575000 |
     |------------------------------------------------------------------------|
     |               F_2022              |              den~2022              |
     |                    0              |               1575000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 13. |   hhid | rsubhh | r_fi~2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 116031 |      0 | 1.2408181 |   800000 |   221197 |        0 |  823003 |
     |------------------------------------------------------------------------|
     |               F_2022              |              den~2022              |
     |                    0              |                823003              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 14. |   hhid | rsubhh | r_fi~2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 122692 |      0 | 1.0693281 |        0 |  3000000 |        0 | 2788000 |
     |------------------------------------------------------------------------|
     |               F_2022              |              den~2022              |
     |                35000              |               2805500              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 15. |   hhid | rsubhh | r_fi~2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 534003 |      0 | 1.0239405 |     1440 |   274000 |        0 |  266000 |
     |------------------------------------------------------------------------|
     |               F_2022              |              den~2022              |
     |                 6000              |                269000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 16. |   hhid | rsubhh | r_fi~2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 545750 |      0 | .97312326 |        0 |  2100000 |        0 | 2158000 |
     |------------------------------------------------------------------------|
     |               F_2022              |              den~2022              |
     |                    0              |               2158000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 17. |   hhid | rsubhh | r_fi~2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 543556 |      0 |        .9 |        0 |     9900 |        0 |   11000 |
     |------------------------------------------------------------------------|
     |               F_2022              |              den~2022              |
     |                    0              |                 11000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 18. |   hhid | rsubhh | r_fi~2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 022600 |      0 | .84798643 |      120 |   600000 |        0 |  700000 |
     |------------------------------------------------------------------------|
     |               F_2022              |              den~2022              |
     |                15400              |                707700              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 19. |   hhid | rsubhh | r_fi~2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 502156 |      0 | .82437621 |      120 |  2980000 |        0 | 3518000 |
     |------------------------------------------------------------------------|
     |               F_2022              |              den~2022              |
     |               194000              |               3615000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 20. |   hhid | rsubhh | r_fi~2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 500896 |      0 | .78834425 |        0 |   349000 |        0 |  442700 |
     |------------------------------------------------------------------------|
     |               F_2022              |              den~2022              |
     |                    0              |                442700              |
     +------------------------------------------------------------------------+

. 
. di as txt "Top 20 negative financial asset returns:"
Top 20 negative financial asset returns:

. gsort r_fin_2022

. list hhid rsubhh r_fin_2022 yc_fin_2022 cg_fin_2022 F_fin_2022 A_2020 F_2022 denom_f
> in_2022 in 1/20 if fin_sample

     +-------------------------------------------------------------------------+
  1. |   hhid | rsubhh | r_fin_2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 546470 |      0 | -2.6333333 |        0 |   -44000 |    35000 |   12500 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              den~2022              |
     |                 35000              |                 30000              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
  2. |   hhid | rsubhh | r_fin_2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 526941 |      0 | -1.4195569 |      240 | -2300000 |  1000000 | 2127000 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              den~2022              |
     |                395000              |               2324500              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
  3. |   hhid | rsubhh | r_fin_2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 137464 |      1 | -.95206829 |        0 |  -380000 |   200000 |  701200 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              den~2022              |
     |               -184000              |                609200              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
  4. |   hhid | rsubhh | r_fin_2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 540465 |      0 | -.78534031 |        0 |  -600000 |   600000 | 1228000 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              den~2022              |
     |                600000              |               1528000              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
  5. |   hhid | rsubhh | r_fin_2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 918201 |      0 |  -.7021978 |      760 |  -103000 |        0 |  145600 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              den~2022              |
     |                     0              |                145600              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
  6. |   hhid | rsubhh | r_fin_2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 526899 |      2 | -.66746089 |      912 |  -215000 |   140000 |  515000 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              den~2022              |
     |                 31000              |                530500              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
  7. |   hhid | rsubhh | r_fin_2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 211335 |      0 | -.64661654 |        0 |  -340000 |    90000 |  620000 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              den~2022              |
     |                 90000              |                665000              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
  8. |   hhid | rsubhh | r_fin_2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 013820 |      0 | -.62619644 |      120 | -1900000 |        0 | 3040000 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              den~2022              |
     |                -12000              |               3034000              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
  9. |   hhid | rsubhh | r_fin_2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 033502 |      0 | -.60060069 |      120 |  -690000 |    90000 | 1353500 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              den~2022              |
     |               -110000              |               1298500              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 10. |   hhid | rsubhh | r_fin_2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 044300 |      0 | -.57407407 |        0 |   -23000 |     8000 |   55000 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              den~2022              |
     |                 -2000              |                 54000              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 11. |   hhid | rsubhh | r_fin_2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 543100 |      0 | -.52913722 |       12 |  -590000 |        0 | 1180000 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              den~2022              |
     |               -130000              |               1115000              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 12. |   hhid | rsubhh | r_fin_2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 084194 |      0 | -.50949721 |        0 |  -228000 |        0 |  446000 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              den~2022              |
     |                  3000              |                447500              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 13. |   hhid | rsubhh | r_fin_2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 084246 |      0 |        -.5 |        0 |  -200000 |        0 |  398000 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              den~2022              |
     |                  4000              |                400000              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 14. |   hhid | rsubhh | r_fin_2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 050788 |      0 | -.49225778 |        0 |  -511318 |        0 | 1038720 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              den~2022              |
     |                     0              |               1038720              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 15. |   hhid | rsubhh | r_fin_2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 032821 |      0 | -.49188426 |       12 |  -425000 |        0 |  864000 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              den~2022              |
     |                     0              |                864000              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 16. |   hhid | rsubhh | r_fin_2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 012588 |      0 | -.48540351 |     1332 |   -21000 |     8000 |   53000 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              den~2022              |
     |                  8000              |                 57000              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 17. |   hhid | rsubhh | r_fin_2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 546116 |      0 | -.47131148 |        0 | -2300000 |        0 | 5905000 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              den~2022              |
     |              -2050000              |               4880000              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 18. |   hhid | rsubhh | r_fin_2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 531063 |      0 | -.46686747 |        0 | -1550000 |        0 | 3320000 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              den~2022              |
     |                     0              |               3320000              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 19. |   hhid | rsubhh | r_fin_2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 050825 |      1 | -.46544343 |     7800 |  -160000 |        0 |  320000 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              den~2022              |
     |                 14000              |                327000              |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 20. |   hhid | rsubhh | r_fin_2022 | yc_~2022 | cg_fin~2 | F_f~2022 |  A_2020 |
     | 524533 |      0 | -.46467918 |       12 |  -260000 |        0 |  557000 |
     |-------------------------------------------------------------------------|
     |                F_2022              |              den~2022              |
     |                  5000              |                559500              |
     +-------------------------------------------------------------------------+

. 
. di as txt "Top 20 trimmed financial asset returns:"
Top 20 trimmed financial asset returns:

. gsort -r_fin_2022_trim

. list hhid rsubhh r_fin_2022_trim yc_fin_2022 cg_fin_2022 F_fin_2022 A_2020 F_2022 de
> nom_fin_2022 in 1/20 if !missing(r_fin_2022_trim)

     +-------------------------------------------------------------------------+
  1. |   hhid | rsubhh | r_fin_2~m | yc_~2022 | cg_fin~2 | F_f~2022 |   A_2020 |
     | 147589 |      0 | .63224137 |        0 |  2150000 |        0 |  3460000 |
     |-------------------------------------------------------------------------|
     |               F_2022              |              den~2022               |
     |              -118800              |               3400600               |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
  2. |   hhid | rsubhh | r_fin_2~m | yc_~2022 | cg_fin~2 | F_f~2022 |   A_2020 |
     | 521288 |      0 | .61747654 |      156 |   500000 |        0 |   810000 |
     |-------------------------------------------------------------------------|
     |               F_2022              |              den~2022               |
     |                    0              |                810000               |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
  3. |   hhid | rsubhh | r_fin_2~m | yc_~2022 | cg_fin~2 | F_f~2022 |   A_2020 |
     | 030683 |      0 | .60206604 |        0 |   475000 |        0 |   788950 |
     |-------------------------------------------------------------------------|
     |               F_2022              |              den~2022               |
     |                    0              |                788950               |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
  4. |   hhid | rsubhh | r_fin_2~m | yc_~2022 | cg_fin~2 | F_f~2022 |   A_2020 |
     | 532216 |      0 | .60092146 |    84000 |  2655000 |        0 |  4633000 |
     |-------------------------------------------------------------------------|
     |               F_2022              |              den~2022               |
     |              -150000              |               4558000               |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
  5. |   hhid | rsubhh | r_fin_2~m | yc_~2022 | cg_fin~2 | F_f~2022 |   A_2020 |
     | 500299 |      0 |  .5187013 |      120 |  1917000 |        0 |  3696000 |
     |-------------------------------------------------------------------------|
     |               F_2022              |              den~2022               |
     |                    0              |               3696000               |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
  6. |   hhid | rsubhh | r_fin_2~m | yc_~2022 | cg_fin~2 | F_f~2022 |   A_2020 |
     | 137440 |      0 | .50671017 |        0 |  6423425 |        0 | 12676724 |
     |-------------------------------------------------------------------------|
     |               F_2022              |              den~2022               |
     |                    0              |              12676724               |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
  7. |   hhid | rsubhh | r_fin_2~m | yc_~2022 | cg_fin~2 | F_f~2022 |   A_2020 |
     | 543014 |      0 | .50490463 |     1200 |   490000 |  -250000 |  1593000 |
     |-------------------------------------------------------------------------|
     |               F_2022              |              den~2022               |
     |              -250000              |               1468000               |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
  8. |   hhid | rsubhh | r_fin_2~m | yc_~2022 | cg_fin~2 | F_f~2022 |   A_2020 |
     | 522502 |      0 | .50175922 |    40000 |  1500000 |  -100000 |  3310000 |
     |-------------------------------------------------------------------------|
     |               F_2022              |              den~2022               |
     |               -83000              |               3268500               |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
  9. |   hhid | rsubhh | r_fin_2~m | yc_~2022 | cg_fin~2 | F_f~2022 |   A_2020 |
     | 521117 |      0 | .50003947 |       60 |   780000 |    20000 |  1510000 |
     |-------------------------------------------------------------------------|
     |               F_2022              |              den~2022               |
     |                20000              |               1520000               |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 10. |   hhid | rsubhh | r_fin_2~m | yc_~2022 | cg_fin~2 | F_f~2022 |   A_2020 |
     | 034884 |      0 | .47612318 |   144000 |  1500000 |        0 |  3467888 |
     |-------------------------------------------------------------------------|
     |               F_2022              |              den~2022               |
     |               -30000              |               3452888               |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 11. |   hhid | rsubhh | r_fin_2~m | yc_~2022 | cg_fin~2 | F_f~2022 |   A_2020 |
     | 131872 |      0 | .46903628 |        0 |   320000 |        0 |   678000 |
     |-------------------------------------------------------------------------|
     |               F_2022              |              den~2022               |
     |                 8500              |                682250               |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 12. |   hhid | rsubhh | r_fin_2~m | yc_~2022 | cg_fin~2 | F_f~2022 |   A_2020 |
     | 052188 |      0 | .44257549 |        0 |   321000 |        0 |   712000 |
     |-------------------------------------------------------------------------|
     |               F_2022              |              den~2022               |
     |                26600              |                725300               |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 13. |   hhid | rsubhh | r_fin_2~m | yc_~2022 | cg_fin~2 | F_f~2022 |   A_2020 |
     | 546265 |      0 | .44020089 |    49680 |   894996 |        4 |  2142000 |
     |-------------------------------------------------------------------------|
     |               F_2022              |              den~2022               |
     |                 8004              |               2146002               |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 14. |   hhid | rsubhh | r_fin_2~m | yc_~2022 | cg_fin~2 | F_f~2022 |   A_2020 |
     | 145282 |      0 | .43455948 |       12 |   400000 |        0 |   919000 |
     |-------------------------------------------------------------------------|
     |               F_2022              |              den~2022               |
     |                 3000              |                920500               |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 15. |   hhid | rsubhh | r_fin_2~m | yc_~2022 | cg_fin~2 | F_f~2022 |   A_2020 |
     | 526116 |      0 |  .4208972 |      720 |   900000 |        0 |  2220000 |
     |-------------------------------------------------------------------------|
     |               F_2022              |              den~2022               |
     |              -160000              |               2140000               |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 16. |   hhid | rsubhh | r_fin_2~m | yc_~2022 | cg_fin~2 | F_f~2022 |   A_2020 |
     | 526837 |      0 | .41422594 |        0 |   990000 |        0 |  2155000 |
     |-------------------------------------------------------------------------|
     |               F_2022              |              den~2022               |
     |               470000              |               2390000               |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 17. |   hhid | rsubhh | r_fin_2~m | yc_~2022 | cg_fin~2 | F_f~2022 |   A_2020 |
     | 909171 |      0 |  .4137931 |        0 |   120000 |        0 |   290000 |
     |-------------------------------------------------------------------------|
     |               F_2022              |              den~2022               |
     |                    0              |                290000               |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 18. |   hhid | rsubhh | r_fin_2~m | yc_~2022 | cg_fin~2 | F_f~2022 |   A_2020 |
     | 076941 |      0 | .40828829 |     3200 |   450000 |        0 |  1105000 |
     |-------------------------------------------------------------------------|
     |               F_2022              |              den~2022               |
     |                10000              |               1110000               |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 19. |   hhid | rsubhh | r_fin_2~m | yc_~2022 | cg_fin~2 | F_f~2022 |   A_2020 |
     | 525162 |      0 |  .3989404 |     2400 |   600000 |        0 |  1510000 |
     |-------------------------------------------------------------------------|
     |               F_2022              |              den~2022               |
     |                    0              |               1510000               |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 20. |   hhid | rsubhh | r_fin_2~m | yc_~2022 | cg_fin~2 | F_f~2022 |   A_2020 |
     | 050903 |      0 | .39525692 |        0 |   200000 |        0 |   506000 |
     |-------------------------------------------------------------------------|
     |               F_2022              |              den~2022               |
     |                    0              |                506000               |
     +-------------------------------------------------------------------------+

. 
. * ---------------------------------------------------------------------
. * Verification of summed variables and sample logic
. * ---------------------------------------------------------------------
. di as txt "=== Verification of summed variables and sample logic ==="
=== Verification of summed variables and sample logic ===

. 
. * Check that all observations in sample have the summed variables
. quietly count if fin_sample

. local n_sample = r(N)

. di as txt "Total observations in financial sample: `n_sample'"
Total observations in financial sample: 692

. 
. * Verify interest income total (yc_fin_2022)
. quietly count if !missing(yc_fin_2022) & fin_sample

. di as txt "yc_fin_2022 non-missing in sample: " r(N) " (should equal `n_sample')"
yc_fin_2022 non-missing in sample: 692 (should equal 692)

. quietly count if missing(yc_fin_2022) & fin_sample

. di as txt "yc_fin_2022 missing in sample: " r(N) " (should equal 0)"
yc_fin_2022 missing in sample: 0 (should equal 0)

. 
. * Verify capital gains total (cg_fin_2022)
. quietly count if !missing(cg_fin_2022) & fin_sample

. di as txt "cg_fin_2022 non-missing in sample: " r(N) " (should equal `n_sample')"
cg_fin_2022 non-missing in sample: 692 (should equal 692)

. quietly count if missing(cg_fin_2022) & fin_sample

. di as txt "cg_fin_2022 missing in sample: " r(N) " (should equal 0)"
cg_fin_2022 missing in sample: 0 (should equal 0)

. 
. * Verify financial flows total (F_fin_2022)
. quietly count if !missing(F_fin_2022) & fin_sample

. di as txt "F_fin_2022 non-missing in sample: " r(N) " (should equal `n_sample')"
F_fin_2022 non-missing in sample: 692 (should equal 692)

. quietly count if missing(F_fin_2022) & fin_sample

. di as txt "F_fin_2022 missing in sample: " r(N) " (should equal 0)"
F_fin_2022 missing in sample: 0 (should equal 0)

. 
. * Verify denominator (denom_fin_2022)
. quietly count if !missing(denom_fin_2022) & fin_sample

. di as txt "denom_fin_2022 non-missing in sample: " r(N) " (should equal `n_sample')"
denom_fin_2022 non-missing in sample: 692 (should equal 692)

. quietly count if missing(denom_fin_2022) & fin_sample

. di as txt "denom_fin_2022 missing in sample: " r(N) " (should equal 0)"
denom_fin_2022 missing in sample: 0 (should equal 0)

. 
. * Check for zero values (should be possible if all components are missing)
. quietly count if yc_fin_2022 == 0 & fin_sample

. di as txt "yc_fin_2022 equals 0 in sample: " r(N) " (households with no interest inc
> ome)"
yc_fin_2022 equals 0 in sample: 323 (households with no interest income)

. quietly count if cg_fin_2022 == 0 & fin_sample

. di as txt "cg_fin_2022 equals 0 in sample: " r(N) " (households with no capital gain
> s)"
cg_fin_2022 equals 0 in sample: 53 (households with no capital gains)

. quietly count if F_fin_2022 == 0 & fin_sample

. di as txt "F_fin_2022 equals 0 in sample: " r(N) " (households with no stock flows)"
F_fin_2022 equals 0 in sample: 548 (households with no stock flows)

. 
. * Summary of summed variables
. di as txt "Summary of summed variables:"
Summary of summed variables:

. di as txt "  Interest income total (yc_fin_2022):"
  Interest income total (yc_fin_2022):

. summarize yc_fin_2022 if fin_sample, detail

                         yc_fin_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 692
25%            0              0       Sum of wgt.         692

50%           12                      Mean           7175.942
                        Largest       Std. dev.      41049.01
75%         1090         201000
90%        12000         240000       Variance       1.69e+09
95%        32000         520300       Skewness       13.99152
99%       144000         800000       Kurtosis       240.1864

. di as txt "  Capital gains total (cg_fin_2022):"
  Capital gains total (cg_fin_2022):

. summarize cg_fin_2022 if fin_sample, detail

                         cg_fin_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -1500000       -4100000
 5%      -380000       -2600000
10%      -199000       -2300000       Obs                 692
25%       -20000       -2300000       Sum of wgt.         692

50%         6950                      Mean           113084.8
                        Largest       Std. dev.      687606.8
75%       100000        4600000
90%       400000        5000000       Variance       4.73e+11
95%       894996        6423425       Skewness       4.286265
99%      2980000        7553000       Kurtosis        43.8063

. di as txt "  Financial flows total (F_fin_2022):"
  Financial flows total (F_fin_2022):

. summarize F_fin_2022 if fin_sample, detail

                         F_fin_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%      -100000       -2000000
 5%        -2000        -250000
10%            0        -200000       Obs                 692
25%            0        -200000       Sum of wgt.         692

50%            0                      Mean           11639.02
                        Largest       Std. dev.      123704.8
75%            0         600000
90%        12000         730000       Variance       1.53e+10
95%        80000        1000000       Skewness       -1.45732
99%       500000        1600000       Kurtosis        151.285

. di as txt "  Final denominator (denom_fin_2022):"
  Final denominator (denom_fin_2022):

. summarize denom_fin_2022 if fin_sample, detail

                       denom_fin_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%        19350          10000
 5%        98000          11000
10%       231000          11100       Obs                 692
25%     475504.5          11500       Sum of wgt.         692

50%       968400                      Mean            1635494
                        Largest       Std. dev.       2149261
75%      1904750       1.35e+07
90%      3630750       1.45e+07       Variance       4.62e+12
95%      5367500       1.88e+07       Skewness       4.073156
99%     1.15e+07       2.27e+07       Kurtosis       28.02164

. 
. * ---------------------------------------------------------------------
. * Save dataset with new financial asset return variables
. * ---------------------------------------------------------------------
. save "`master'", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/cleaned/hrs_rand_2020_2
    > 022_master.dta saved

. di as txt "Saved financial asset return variables to master: `master'"
Saved financial asset return variables to master: /Volumes/SSD PRO/Github-forks/Chp2-B
> eliefsandTrust/Code/Data/HRS_RAND/cleaned/hrs_rand_2020_2022_master.dta

. 
. di as txt "Done. Financial asset returns computed with 5% trimming."
Done. Financial asset returns computed with 5% trimming.

. 
end of do-file

