----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/cleaned/com
> pute_total_returns_2022.log
  log type:  text
 opened on:  29 Sep 2025, 11:57:43

. 
. di as txt "=== COMPUTING TOTAL RETURNS TO NET WORTH ==="
=== COMPUTING TOTAL RETURNS TO NET WORTH ===

. di as txt "All prerequisite scripts have been run successfully"
All prerequisite scripts have been run successfully

. di as txt ""


. 
. * ---------------------------------------------------------------------
. * Step 3: Load the master dataset with all computed variables
. * ---------------------------------------------------------------------
. di as txt "=== Loading master dataset ==="
=== Loading master dataset ===

. 
. local master "/Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/cleaned/
> hrs_rand_2020_2022_master.dta"

. capture confirm file "`master'"

. if _rc {
.     di as error "ERROR: master file not found -> `master'"
.     exit 198
. }

. 
. use "`master'", clear

. di as txt "Using master file: `master'"
Using master file: /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/clean
> ed/hrs_rand_2020_2022_master.dta

. 
. * ---------------------------------------------------------------------
. * Step 4: Check for required variables
. * ---------------------------------------------------------------------
. di as txt "=== Checking for required asset class return variables ==="
=== Checking for required asset class return variables ===

. 
. local missing_vars ""

. capture confirm variable r_fin_2022

. if _rc local missing_vars "`missing_vars' r_fin_2022"

. capture confirm variable r_bus_2022

. if _rc local missing_vars "`missing_vars' r_bus_2022"

. capture confirm variable r_ira_2022

. if _rc local missing_vars "`missing_vars' r_ira_2022"

. capture confirm variable r_re_2022

. if _rc local missing_vars "`missing_vars' r_re_2022"

. capture confirm variable r_res_2022

. if _rc local missing_vars "`missing_vars' r_res_2022"

. 
. if "`missing_vars'" != "" {
.     di as error "ERROR: Missing required variables:`missing_vars'"
.     di as error "Prerequisite scripts may have failed."
.     exit 198
. }

. 
. di as txt "All required asset class return variables found!"
All required asset class return variables found!

. 
. * ---------------------------------------------------------------------
. * Step 5: List available return variables
. * ---------------------------------------------------------------------
. di as txt "=== Available asset class return variables ==="
=== Available asset class return variables ===

. di as txt "  r_fin_2022: Financial asset returns"
  r_fin_2022: Financial asset returns

. di as txt "  r_bus_2022: Business asset returns"
  r_bus_2022: Business asset returns

. di as txt "  r_ira_2022: Retirement asset returns"
  r_ira_2022: Retirement asset returns

. di as txt "  r_re_2022: Real estate returns"
  r_re_2022: Real estate returns

. di as txt "  r_res_2022: Residential housing returns"
  r_res_2022: Residential housing returns

. 
. * ---------------------------------------------------------------------
. * Step 6: Define sample for total returns computation
. * ---------------------------------------------------------------------
. di as txt "=== Defining sample for total returns computation ==="
=== Defining sample for total returns computation ===

. 
. * Sample: households with non-missing returns for at least 1 of the 5 asset classes
. gen byte has_any_returns = 0

. replace has_any_returns = 1 if !missing(r_fin_2022)
(1,887 real changes made)

. replace has_any_returns = 1 if !missing(r_bus_2022)
(175 real changes made)

. replace has_any_returns = 1 if !missing(r_ira_2022)
(767 real changes made)

. replace has_any_returns = 1 if !missing(r_re_2022)
(169 real changes made)

. replace has_any_returns = 1 if !missing(r_res_2022)
(1,882 real changes made)

. 
. quietly count if has_any_returns == 1

. local n_sample = r(N)

. quietly count

. local n_total = r(N)

. di as txt "Households with at least one asset class return: `n_sample' out of `n_total' (" %
> 4.1f 100*`n_sample'/`n_total' "%)"
Households with at least one asset class return: 4880 out of 14442 (33.8%)

. 
. * Breakdown by number of asset classes with returns
. egen byte n_asset_returns = rownonmiss(r_fin_2022 r_bus_2022 r_ira_2022 r_re_2022 r_res_2022
> )

. tab n_asset_returns if has_any_returns, missing

n_asset_ret |
       urns |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,168       44.43       44.43
          2 |      1,464       30.00       74.43
          3 |        986       20.20       94.63
          4 |        228        4.67       99.30
          5 |         34        0.70      100.00
------------+-----------------------------------
      Total |      4,880      100.00

. 
. * ---------------------------------------------------------------------
. * Detailed overlap analysis
. * ---------------------------------------------------------------------
. di as txt "=== Detailed overlap analysis ==="
=== Detailed overlap analysis ===

. 
. * Count non-missing returns for each asset class
. quietly count if !missing(r_fin_2022)

. local n_fin = r(N)

. quietly count if !missing(r_bus_2022)

. local n_bus = r(N)

. quietly count if !missing(r_ira_2022)

. local n_ira = r(N)

. quietly count if !missing(r_re_2022)

. local n_re = r(N)

. quietly count if !missing(r_res_2022)

. local n_res = r(N)

. 
. di as txt "Individual asset class return counts:"
Individual asset class return counts:

. di as txt "  Financial returns (r_fin_2022): `n_fin'"
  Financial returns (r_fin_2022): 1887

. di as txt "  Business returns (r_bus_2022): `n_bus'"
  Business returns (r_bus_2022): 341

. di as txt "  Retirement returns (r_ira_2022): `n_ira'"
  Retirement returns (r_ira_2022): 1869

. di as txt "  Real estate returns (r_re_2022): `n_re'"
  Real estate returns (r_re_2022): 591

. di as txt "  Residential returns (r_res_2022): `n_res'"
  Residential returns (r_res_2022): 4448

. 
. 
. * ---------------------------------------------------------------------
. * Step 7: Compute total returns (raw and trimmed)
. * ---------------------------------------------------------------------
. di as txt "=== Computing total returns ==="
=== Computing total returns ===

. 
. * Raw total returns: sum across all asset classes, treat missing as 0 within sample
. capture drop r_total_2022

. gen double r_total_2022 = .
(14,442 missing values generated)

. replace r_total_2022 = cond(missing(r_fin_2022), 0, r_fin_2022) + ///
>                       cond(missing(r_bus_2022), 0, r_bus_2022) + ///
>                       cond(missing(r_ira_2022), 0, r_ira_2022) + ///
>                       cond(missing(r_re_2022), 0, r_re_2022) + ///
>                       cond(missing(r_res_2022), 0, r_res_2022) ///
>                       if has_any_returns
(4,880 real changes made)

. 
. * Trimmed total returns: sum across trimmed asset class returns
. capture drop r_total_2022_trimmed

. gen double r_total_2022_trimmed = .
(14,442 missing values generated)

. replace r_total_2022_trimmed = cond(missing(r_fin_2022_trim), 0, r_fin_2022_trim) + ///
>                               cond(missing(r_bus_2022_trim), 0, r_bus_2022_trim) + ///
>                               cond(missing(r_ira_2022_trim), 0, r_ira_2022_trim) + ///
>                               cond(missing(r_re_2022_trimmed), 0, r_re_2022_trimmed) + ///
>                               cond(missing(r_res_2022_trimmed), 0, r_res_2022_trimmed) ///
>                               if has_any_returns
(4,880 real changes made)

. 
. * Final trimmed total returns: apply additional 5% trimming to the sum of trimmed asset clas
> s returns
. capture drop r_total_2022_final_trim

. gen double r_total_2022_final_trim = .
(14,442 missing values generated)

. 
. * Calculate trimming thresholds for the sum of trimmed returns
. quietly _pctile r_total_2022_trimmed if has_any_returns, p(5 95)

. scalar p5_trimmed = r(r1)

. scalar p95_trimmed = r(r2)

. 
. di as txt "Final trimming thresholds for sum of trimmed returns:"
Final trimming thresholds for sum of trimmed returns:

. di as txt "  5th percentile: " %12.4f p5_trimmed
  5th percentile:      -0.1924

. di as txt "  95th percentile: " %12.4f p95_trimmed
  95th percentile:       0.9459

. 
. * Apply final trimming
. replace r_total_2022_final_trim = r_total_2022_trimmed if has_any_returns & ///
>                                   r_total_2022_trimmed >= p5_trimmed & ///
>                                   r_total_2022_trimmed <= p95_trimmed
(4,392 real changes made)

. 
. quietly count if !missing(r_total_2022_final_trim)

. local n_final_trim = r(N)

. quietly count if has_any_returns

. local n_trimmed_total = r(N)

. di as txt "Final trimmed sample: `n_final_trim' out of `n_trimmed_total' trimmed total retur
> ns (" %4.1f 100*`n_final_trim'/`n_trimmed_total' "%)"
Final trimmed sample: 4392 out of 4880 trimmed total returns (90.0%)

. 
. * ---------------------------------------------------------------------
. * Step 7b: Robustness variants excluding asset classes
. * ---------------------------------------------------------------------
. di as txt "=== Computing robustness variants (exclusions) ==="
=== Computing robustness variants (exclusions) ===

. 
. * Variant A: Exclude residential (use fin + bus + ira + re)
. gen byte has_returns_excl_res = 0

. replace has_returns_excl_res = 1 if !missing(r_fin_2022)
(1,887 real changes made)

. replace has_returns_excl_res = 1 if !missing(r_bus_2022)
(175 real changes made)

. replace has_returns_excl_res = 1 if !missing(r_ira_2022)
(767 real changes made)

. replace has_returns_excl_res = 1 if !missing(r_re_2022)
(169 real changes made)

. 
. capture drop r_total_2022_excl_res

. gen double r_total_2022_excl_res = .
(14,442 missing values generated)

. replace r_total_2022_excl_res = cond(missing(r_fin_2022), 0, r_fin_2022) + ///
>                                 cond(missing(r_bus_2022), 0, r_bus_2022) + ///
>                                 cond(missing(r_ira_2022), 0, r_ira_2022) + ///
>                                 cond(missing(r_re_2022), 0, r_re_2022) ///
>                                 if has_returns_excl_res
(2,998 real changes made)

. 
. capture drop r_total_2022_excl_res_trim

. gen double r_total_2022_excl_res_trim = .
(14,442 missing values generated)

. replace r_total_2022_excl_res_trim = cond(missing(r_fin_2022_trim), 0, r_fin_2022_trim) + //
> /
>                                      cond(missing(r_bus_2022_trim), 0, r_bus_2022_trim) + //
> /
>                                      cond(missing(r_ira_2022_trim), 0, r_ira_2022_trim) + //
> /
>                                      cond(missing(r_re_2022_trimmed), 0, r_re_2022_trimmed) 
> ///
>                                      if has_returns_excl_res
(2,998 real changes made)

. 
. capture drop r_total_2022_excl_res_ftrim

. gen double r_total_2022_excl_res_ftrim = .
(14,442 missing values generated)

. quietly _pctile r_total_2022_excl_res_trim if has_returns_excl_res, p(5 95)

. scalar p5_excl_res = r(r1)

. scalar p95_excl_res = r(r2)

. replace r_total_2022_excl_res_ftrim = r_total_2022_excl_res_trim if has_returns_excl_res & /
> //
>                                       r_total_2022_excl_res_trim >= p5_excl_res & ///
>                                       r_total_2022_excl_res_trim <= p95_excl_res
(2,700 real changes made)

. 
. di as txt "Variant A (exclude residential) sample sizes:"
Variant A (exclude residential) sample sizes:

. quietly count if has_returns_excl_res

. di as txt "  In-sample: " r(N)
  In-sample: 2998

. quietly count if !missing(r_total_2022_excl_res_ftrim)

. di as txt "  Final-trim retained: " r(N)
  Final-trim retained: 2700

. 
. * Variant B: Exclude housing (residential + real estate) (use fin + bus + ira)
. gen byte has_returns_excl_housing = 0

. replace has_returns_excl_housing = 1 if !missing(r_fin_2022)
(1,887 real changes made)

. replace has_returns_excl_housing = 1 if !missing(r_bus_2022)
(175 real changes made)

. replace has_returns_excl_housing = 1 if !missing(r_ira_2022)
(767 real changes made)

. 
. capture drop r_total_2022_excl_housing

. gen double r_total_2022_excl_housing = .
(14,442 missing values generated)

. replace r_total_2022_excl_housing = cond(missing(r_fin_2022), 0, r_fin_2022) + ///
>                                      cond(missing(r_bus_2022), 0, r_bus_2022) + ///
>                                      cond(missing(r_ira_2022), 0, r_ira_2022) ///
>                                      if has_returns_excl_housing
(2,829 real changes made)

. 
. capture drop r_total_2022_excl_housing_trim

. gen double r_total_2022_excl_housing_trim = .
(14,442 missing values generated)

. replace r_total_2022_excl_housing_trim = cond(missing(r_fin_2022_trim), 0, r_fin_2022_trim) 
> + ///
>                                          cond(missing(r_bus_2022_trim), 0, r_bus_2022_trim) 
> + ///
>                                          cond(missing(r_ira_2022_trim), 0, r_ira_2022_trim) 
> ///
>                                          if has_returns_excl_housing
(2,829 real changes made)

. 
. capture drop r_total_2022_excl_housing_ftrim

. gen double r_total_2022_excl_housing_ftrim = .
(14,442 missing values generated)

. quietly _pctile r_total_2022_excl_housing_trim if has_returns_excl_housing, p(5 95)

. scalar p5_excl_housing = r(r1)

. scalar p95_excl_housing = r(r2)

. replace r_total_2022_excl_housing_ftrim = r_total_2022_excl_housing_trim if has_returns_excl
> _housing & ///
>                                           r_total_2022_excl_housing_trim >= p5_excl_housing 
> & ///
>                                           r_total_2022_excl_housing_trim <= p95_excl_housing
(2,547 real changes made)

. 
. di as txt "Variant B (exclude residential + real estate) sample sizes:"
Variant B (exclude residential + real estate) sample sizes:

. quietly count if has_returns_excl_housing

. di as txt "  In-sample: " r(N)
  In-sample: 2829

. quietly count if !missing(r_total_2022_excl_housing_ftrim)

. di as txt "  Final-trim retained: " r(N)
  Final-trim retained: 2547

. 
. * Variant C: Exclude housing + retirement (use fin + bus)
. gen byte has_returns_excl_hsg_ira = 0

. replace has_returns_excl_hsg_ira = 1 if !missing(r_fin_2022)
(1,887 real changes made)

. replace has_returns_excl_hsg_ira = 1 if !missing(r_bus_2022)
(175 real changes made)

. 
. capture drop r_total_2022_excl_hsg_ira

. gen double r_total_2022_excl_hsg_ira = .
(14,442 missing values generated)

. replace r_total_2022_excl_hsg_ira = cond(missing(r_fin_2022), 0, r_fin_2022) + ///
>                                     cond(missing(r_bus_2022), 0, r_bus_2022) ///
>                                     if has_returns_excl_hsg_ira
(2,062 real changes made)

. 
. capture drop r_total_2022_excl_hsg_ira_trim

. gen double r_total_2022_excl_hsg_ira_trim = .
(14,442 missing values generated)

. replace r_total_2022_excl_hsg_ira_trim = cond(missing(r_fin_2022_trim), 0, r_fin_2022_trim) 
> + ///
>                                           cond(missing(r_bus_2022_trim), 0, r_bus_2022_trim)
>  ///
>                                           if has_returns_excl_hsg_ira
(2,062 real changes made)

. 
. capture drop r_total_2022_excl_hsg_ira_ftrim

. gen double r_total_2022_excl_hsg_ira_ftrim = .
(14,442 missing values generated)

. quietly _pctile r_total_2022_excl_hsg_ira_trim if has_returns_excl_hsg_ira, p(5 95)

. scalar p5_excl_hsg_ira = r(r1)

. scalar p95_excl_hsg_ira = r(r2)

. replace r_total_2022_excl_hsg_ira_ftrim = r_total_2022_excl_hsg_ira_trim if has_returns_excl
> _hsg_ira & ///
>                                           r_total_2022_excl_hsg_ira_trim >= p5_excl_hsg_ira 
> & ///
>                                           r_total_2022_excl_hsg_ira_trim <= p95_excl_hsg_ira
(1,856 real changes made)

. 
. di as txt "Variant C (exclude residential + real estate + retirement) sample sizes:"
Variant C (exclude residential + real estate + retirement) sample sizes:

. quietly count if has_returns_excl_hsg_ira

. di as txt "  In-sample: " r(N)
  In-sample: 2062

. quietly count if !missing(r_total_2022_excl_hsg_ira_ftrim)

. di as txt "  Final-trim retained: " r(N)
  Final-trim retained: 1856

. 
. * ---------------------------------------------------------------------
. * Step 8: Summaries and diagnostics
. * ---------------------------------------------------------------------
. di as txt "=== Total returns summaries ==="
=== Total returns summaries ===

. 
. di as txt "Raw total returns (r_total_2022) summary:"
Raw total returns (r_total_2022) summary:

. summarize r_total_2022 if has_any_returns, detail

                        r_total_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -1.293103      -3.911234
 5%          -.5      -3.444444
10%    -.2482389       -3.28849       Obs               4,880
25%            0      -3.071429       Sum of wgt.       4,880

50%     .1642457                      Mean           .4221367
                        Largest       Std. dev.      1.873931
75%     .4671571          26.75
90%     1.034703       27.91363       Variance       3.511617
95%     1.697445             47       Skewness       19.36225
99%     5.944246             74       Kurtosis       606.5168

. tabstat r_total_2022 if has_any_returns, stats(n mean sd p50 min max) format(%12.4f)

    Variable |            N         Mean           SD          p50          Min          Max
-------------+------------------------------------------------------------------------------
r_total_2022 |    4880.0000       0.4221       1.8739       0.1642      -3.9112      74.0000
--------------------------------------------------------------------------------------------

. 
. di as txt "Trimmed total returns (r_total_2022_trimmed) summary:"
Trimmed total returns (r_total_2022_trimmed) summary:

. summarize r_total_2022_trimmed if has_any_returns, detail

                    r_total_2022_trimmed
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.3461063        -.58151
 5%    -.1923643      -.5599893
10%    -.1021428          -.545       Obs               4,880
25%            0      -.5299542       Sum of wgt.       4,880

50%     .1215273                      Mean           .2172361
                        Largest       Std. dev.      .3422771
75%     .3696234       1.696776
90%     .6839557       1.735454       Variance       .1171536
95%     .9458991       1.833333       Skewness       1.350605
99%     1.358366       2.443967       Kurtosis       5.303375

. tabstat r_total_2022_trimmed if has_any_returns, stats(n mean sd p50 min max) format(%12.4f)

    Variable |            N         Mean           SD          p50          Min          Max
-------------+------------------------------------------------------------------------------
r_total_20~d |    4880.0000       0.2172       0.3423       0.1215      -0.5815       2.4440
--------------------------------------------------------------------------------------------

. 
. di as txt "Final trimmed total returns (r_total_2022_final_trim) summary:"
Final trimmed total returns (r_total_2022_final_trim) summary:

. summarize r_total_2022_final_trim, detail

                   r_total_2022_final_trim
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.1724138      -.1921489
 5%    -.1101887      -.1913357
10%    -.0460526      -.1903619       Obs               4,392
25%            0       -.190128       Sum of wgt.       4,392

50%     .1215273                      Mean           .1912729
                        Largest       Std. dev.      .2448968
75%     .3333333       .9433962
90%     .5545455       .9437014       Variance       .0599744
95%     .7026616       .9444444       Skewness       .9567587
99%     .8816955       .9456624       Kurtosis       3.270499

. tabstat r_total_2022_final_trim, stats(n mean sd p50 min max) format(%12.4f)

    Variable |            N         Mean           SD          p50          Min          Max
-------------+------------------------------------------------------------------------------
r_tot~l_trim |    4392.0000       0.1913       0.2449       0.1215      -0.1921       0.9457
--------------------------------------------------------------------------------------------

. 
. di as txt "--- Robustness variant summaries ---"
--- Robustness variant summaries ---

. di as txt "Exclude residential: raw"
Exclude residential: raw

. tabstat r_total_2022_excl_res if has_returns_excl_res, stats(n mean sd p50 min max) format(%
> 12.4f)

    Variable |            N         Mean           SD          p50          Min          Max
-------------+------------------------------------------------------------------------------
r_total_20~s |    2998.0000       0.1059       0.7493       0.0004      -2.8571      15.3416
--------------------------------------------------------------------------------------------

. di as txt "Exclude residential: trimmed"
Exclude residential: trimmed

. tabstat r_total_2022_excl_res_trim if has_returns_excl_res, stats(n mean sd p50 min max) for
> mat(%12.4f)

    Variable |            N         Mean           SD          p50          Min          Max
-------------+------------------------------------------------------------------------------
r_tot~s_trim |    2998.0000       0.0362       0.1815       0.0001      -0.5783       1.6975
--------------------------------------------------------------------------------------------

. di as txt "Exclude residential: final trimmed"
Exclude residential: final trimmed

. summarize r_total_2022_excl_res_ftrim, detail

                 r_total_2022_excl_res_ftrim
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.1987025       -.209112
 5%    -.1477328      -.2088849
10%    -.0970211      -.2080153       Obs               2,700
25%    -.0182026      -.2074689       Sum of wgt.       2,700

50%     .0001258                      Mean           .0235377
                        Largest       Std. dev.       .106932
75%     .0587774       .3725886
90%     .1839008       .3760849       Variance       .0114344
95%     .2452962       .3765462       Skewness       .7879213
99%     .3321879       .3783784       Kurtosis       4.064511

. tabstat r_total_2022_excl_res_ftrim, stats(n mean sd p50 min max) format(%12.4f)

    Variable |            N         Mean           SD          p50          Min          Max
-------------+------------------------------------------------------------------------------
r_to~s_ftrim |    2700.0000       0.0235       0.1069       0.0001      -0.2091       0.3784
--------------------------------------------------------------------------------------------

. 
. di as txt "Exclude res + re: raw"
Exclude res + re: raw

. tabstat r_total_2022_excl_housing if has_returns_excl_housing, stats(n mean sd p50 min max) 
> format(%12.4f)

    Variable |            N         Mean           SD          p50          Min          Max
-------------+------------------------------------------------------------------------------
r_total_20~g |    2829.0000       0.0636       0.5306       0.0001      -2.8571      12.5500
--------------------------------------------------------------------------------------------

. di as txt "Exclude res + re: trimmed"
Exclude res + re: trimmed

. tabstat r_total_2022_excl_housing_trim if has_returns_excl_housing, stats(n mean sd p50 min 
> max) format(%12.4f)

    Variable |            N         Mean           SD          p50          Min          Max
-------------+------------------------------------------------------------------------------
r_tot~g_trim |    2829.0000       0.0209       0.1480       0.0001      -0.4033       1.0520
--------------------------------------------------------------------------------------------

. di as txt "Exclude res + re: final trimmed"
Exclude res + re: final trimmed

. summarize r_total_2022_excl_housing_ftrim, detail

               r_total_2022_excl_housing_ftrim
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.1860465            -.2
 5%    -.1338481            -.2
10%    -.0870922      -.1996758       Obs               2,547
25%      -.01944      -.1988867       Sum of wgt.       2,547

50%     .0000509                      Mean           .0127654
                        Largest       Std. dev.       .088572
75%     .0322847       .2909091
90%     .1457606       .2918418       Variance        .007845
95%     .2016007       .2921728       Skewness        .705358
99%     .2704095       .2935802       Kurtosis       4.244918

. tabstat r_total_2022_excl_housing_ftrim, stats(n mean sd p50 min max) format(%12.4f)

    Variable |            N         Mean           SD          p50          Min          Max
-------------+------------------------------------------------------------------------------
r_to~g_ftrim |    2547.0000       0.0128       0.0886       0.0001      -0.2000       0.2936
--------------------------------------------------------------------------------------------

. 
. di as txt "Exclude res + re + ira: raw"
Exclude res + re + ira: raw

. tabstat r_total_2022_excl_hsg_ira if has_returns_excl_hsg_ira, stats(n mean sd p50 min max) 
> format(%12.4f)

    Variable |            N         Mean           SD          p50          Min          Max
-------------+------------------------------------------------------------------------------
r_total_20~a |    2062.0000       0.0684       0.4796       0.0004      -2.6333      12.5500
--------------------------------------------------------------------------------------------

. di as txt "Exclude res + re + ira: trimmed"
Exclude res + re + ira: trimmed

. tabstat r_total_2022_excl_hsg_ira_trim if has_returns_excl_hsg_ira, stats(n mean sd p50 min 
> max) format(%12.4f)

    Variable |            N         Mean           SD          p50          Min          Max
-------------+------------------------------------------------------------------------------
r_tot~a_trim |    2062.0000       0.0297       0.1140       0.0002      -0.3120       1.0520
--------------------------------------------------------------------------------------------

. di as txt "Exclude res + re + ira: final trimmed"
Exclude res + re + ira: final trimmed

. summarize r_total_2022_excl_hsg_ira_ftrim, detail

               r_total_2022_excl_hsg_ira_ftrim
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.0494946      -.0618433
 5%    -.0200364      -.0593824
10%            0       -.059312       Obs               1,856
25%            0      -.0582072       Sum of wgt.       1,856

50%     .0002105                      Mean             .01614
                        Largest       Std. dev.      .0447318
75%     .0066472       .2060086
90%     .0753296       .2070822       Variance       .0020009
95%     .1287745       .2087683       Skewness       2.445009
99%      .195122       .2089775       Kurtosis       8.932492

. tabstat r_total_2022_excl_hsg_ira_ftrim, stats(n mean sd p50 min max) format(%12.4f)

    Variable |            N         Mean           SD          p50          Min          Max
-------------+------------------------------------------------------------------------------
r_to~a_ftrim |    1856.0000       0.0161       0.0447       0.0002      -0.0618       0.2090
--------------------------------------------------------------------------------------------

. 
. * Check for extreme values
. quietly count if r_total_2022 > 5 & has_any_returns

. di as txt "Raw total returns > 500%: " r(N)
Raw total returns > 500%: 60

. quietly count if r_total_2022 < -1 & has_any_returns

. di as txt "Raw total returns < -100%: " r(N)
Raw total returns < -100%: 71

. 
. quietly count if r_total_2022_trimmed > 5 & has_any_returns

. di as txt "Trimmed total returns > 500%: " r(N)
Trimmed total returns > 500%: 0

. quietly count if r_total_2022_trimmed < -1 & has_any_returns

. di as txt "Trimmed total returns < -100%: " r(N)
Trimmed total returns < -100%: 0

. 
. quietly count if r_total_2022_final_trim > 5

. di as txt "Final trimmed total returns > 500%: " r(N)
Final trimmed total returns > 500%: 10050

. quietly count if r_total_2022_final_trim < -1

. di as txt "Final trimmed total returns < -100%: " r(N)
Final trimmed total returns < -100%: 0

. 
. * (Top 20 returns display removed per request)
. 
. * ---------------------------------------------------------------------
. * Step 10: Save results
. * ---------------------------------------------------------------------
. di as txt "=== Saving results ==="
=== Saving results ===

. 
. save "`master'", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/cleaned/hrs_rand_2020_2022_mast
    > er.dta saved

. di as txt "Saved total return variables to master: `master'"
Saved total return variables to master: /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Cod
> e/Data/HRS_RAND/cleaned/hrs_rand_2020_2022_master.dta

. 
. * Reload the updated master so all variables are in memory for inspection
. use "`master'", clear

. quietly describe

. local k = r(k)

. di as txt "Variables in memory after total returns: `k'"
Variables in memory after total returns: 233

. capture noisily ds
hhid          sq352         flow_~c_2022  ok_res20_p    cg_stk_use~2  re_exposure
rsubhh        sq362         flow_stk_2~2  ok_res20_s    F_stk_2022    re_sample
rh020         sq364         flow_re_2022  res20_patt~n  r_stk_2022    denom_re_2~2
rh032         sr007         ok_buy        cg_bus_2022   r_stk_2022~m  denom_re_a~k
rh162         sr013         ok_sell       bus_cases     has_bnd_both  yc_re_2022
rh171         sr024         ok_impr       re_cases      bnd_exposure  cg_re_2022
rq134         sr030         re_pattern    cg_stk_2022   bnd_sample    F_re_2022
rq148         sr035         flow_ir~2022  stk_cases     A_2020_bnd    r_re_2022
rq166_1       sr045         ok_ira1       cg_ira_2022   F_2022_bnd    r_re_2022_~d
rq166_2       sr050         ok_ira2       ira_cases     denom_bnd_~2  has_res_both
rq166_3       sr055         ok_ira3       cg_bnd_2022   denom_bn~10k  res_exposure
rq317         sr063         ira_pattern   bnd_cases     yc_bnd_2022   res_sample
rq331         sr064         flow_resid~2  cg_res_tot~2  cg_bnd_use~2  A_2020
rq345         sr073         ok_res_buy    res_cases     F_bnd_2022    F_2022
rq357         sh020         ok_res_sell   n_asset~2020  r_bnd_2022    denom_res_~2
rq371         sh025         ok_res_impr   n_liab_2020   r_bnd_2022~m  denom_res_~k
rq381         sh029         res_pattern   assets_~2020  has_busine~h  yc_res_2022
rq478         sh036         flow_to~2022  liab_to~2020  bus_exposure  cg_res_2022
sq134         sh040         sh029_mult    networt~2020  bus_sample    F_res_2022
sq139         sh162         sh040_mult    has_stocks~h  F_bus_2022    r_res_2022
sq141         sh175         sh179_mult    has_bonds_~h  yc_bus_2022   r_res_2022~d
sq148         sh179         mort1_pay_~l  fin_exposure  denom_bus_~2  has_any_re~s
sq153         sq139_mult    mort2_pay_~l  fin_sample    denom_bus_~e  n_asset_re~s
sq155         sq153_mult    secmort_pa~l  F_fin_2022    denom_bu~10k  r_total_2022
sq166_1       sq194_mult    v_ira_2022    yc_fin_2022   r_bus_2022    r_total_20~d
sq166_2       sq322_mult    v_ira_2020    cg_fin_2022   r_bus_2022~m  r_tot~l_trim
sq166_3       sq336_mult    ok_ira22_1    denom_f~2022  has_ira_both  has_return~s
sq171_1       sq350_mult    ok_ira22_2    denom_fin_~e  ira_exposure  r_total_20~s
sq171_2       sq362_mult    ok_ira22_3    denom_fi~10k  ira_sample    r_tot~s_trim
sq171_3       int_re_2022   ira22_patt~n  r_fin_2022    yc_ira_2022   r_to~s_ftrim
sq190         int_bus_2022  ok_ira20_1    r_fin_2022~m  F_ira_2022    has_return~g
sq194         int_ira_2022  ok_ira20_2    has_stk_both  denom_i~2022  r_total_20~g
sq317         int_stk_2022  ok_ira20_3    stk_exposure  denom_ira_~e  r_tot~g_trim
sq322         int_bnd_2022  ira20_patt~n  stk_sample    denom_ir~10k  r_to~g_ftrim
sq324         int_cas~2022  v_res_2022    A_2020_stk    r_ira_2022    has_return~a
sq331         int_cds_2022  v_res_2020    F_2022_stk    r_ira_2022~m  r_total_20~a
sq336         sr063_dir     ok_res22_p    denom_s~2022  ira_withdr~l  r_tot~a_trim
sq338         flow_bu~2022  ok_res22_s    denom_st~10k  ira_no_wit~l  r_to~a_ftrim
sq350         flow~te_2022  res22_patt~n  yc_stk_2022   has_re_both

. 
. * List of variables created
. di as txt "Variables created:"
Variables created:

. di as txt "  has_any_returns: sample indicator (at least 1 asset class return)"
  has_any_returns: sample indicator (at least 1 asset class return)

. di as txt "  n_asset_returns: number of asset classes with returns"
  n_asset_returns: number of asset classes with returns

. di as txt "  r_total_2022: raw total returns (sum of raw asset class returns)"
  r_total_2022: raw total returns (sum of raw asset class returns)

. di as txt "  r_total_2022_trimmed: trimmed total returns (sum of trimmed asset class returns
> )"
  r_total_2022_trimmed: trimmed total returns (sum of trimmed asset class returns)

. di as txt "  r_total_2022_final_trim: final trimmed total returns (additional 5% trimming ap
> plied to sum of trimmed returns)"
  r_total_2022_final_trim: final trimmed total returns (additional 5% trimming applied to sum 
> of trimmed returns)

. di as txt "  r_total_2022_excl_res: raw total returns excluding residential"
  r_total_2022_excl_res: raw total returns excluding residential

. di as txt "  r_total_2022_excl_res_trim: trimmed total returns excluding residential"
  r_total_2022_excl_res_trim: trimmed total returns excluding residential

. di as txt "  r_total_2022_excl_res_ftrim: final trimmed total returns excluding residential"
  r_total_2022_excl_res_ftrim: final trimmed total returns excluding residential

. di as txt "  r_total_2022_excl_housing: raw total returns excluding residential and real est
> ate"
  r_total_2022_excl_housing: raw total returns excluding residential and real estate

. di as txt "  r_total_2022_excl_housing_trim: trimmed total returns excluding residential and
>  real estate"
  r_total_2022_excl_housing_trim: trimmed total returns excluding residential and real estate

. di as txt "  r_total_2022_excl_housing_ftrim: final trimmed total returns excluding resident
> ial and real estate"
  r_total_2022_excl_housing_ftrim: final trimmed total returns excluding residential and real 
> estate

. di as txt "  r_total_2022_excl_hsg_ira: raw total returns excluding residential, real estate
> , and retirement"
  r_total_2022_excl_hsg_ira: raw total returns excluding residential, real estate, and retirem
> ent

. di as txt "  r_total_2022_excl_hsg_ira_trim: trimmed total returns excluding residential, re
> al estate, and retirement"
  r_total_2022_excl_hsg_ira_trim: trimmed total returns excluding residential, real estate, an
> d retirement

. di as txt "  r_total_2022_excl_hsg_ira_ftrim: final trimmed total returns excluding resident
> ial, real estate, and retirement"
  r_total_2022_excl_hsg_ira_ftrim: final trimmed total returns excluding residential, real est
> ate, and retirement

. 
. di as txt ""


. di as txt "Total returns computation completed successfully!"
Total returns computation completed successfully!

. 
. log close
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/cleaned/com
> pute_total_returns_2022.log
  log type:  text
 closed on:  29 Sep 2025, 11:57:43
----------------------------------------------------------------------------------------------
