--------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/cle
> aned/compute_capital_gains_2022_simple_residences.log
  log type:  text
 opened on:  22 Sep 2025, 12:17:52

. 
. set more off

. 
. local master "/Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/
> cleaned/hrs_rand_2020_2022_master.dta"

. capture confirm file "`master'"

. if _rc {
.     di as error "ERROR: master file not found -> `master'"
.     exit 198
. }

. use "`master'", clear

. di as txt "Using master file: `master'"
Using master file: /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RA
> ND/cleaned/hrs_rand_2020_2022_master.dta

. 
. * ---------------------------------------------------------------------
. * Variables expected (RAND lowercase)
. * Business:    sq148 (2022), rq148 (2020), flow: flow_bus_2022
. * Real estate: sq134 (2022), rq134 (2020), flow: flow_re_2022
. * Stocks:      sq317 (2022), rq317 (2020), flow: flow_stk_2022
. * IRA:         sq166_1/2/3 (2022), rq166_1/2/3 (2020), flow: flow_ira_2022
. * Bonds:       sq331 (2022), rq331 (2020), no flows
. * Residences:  sh020 + sh162 (2022), rh020 + rh162 (2020), flow: flow_residences_202
> 2
. * ---------------------------------------------------------------------
. 
. di as txt "Checking presence of the main vars..."
Checking presence of the main vars...

. local checkvars "sq148 rq148 sq134 rq134 sq317 rq317 sq166_1 rq166_1 sq166_2 rq166_2
>  sq166_3 rq166_3 sq331 rq331 sh020 rh020 sh162 rh162 flow_bus_2022 flow_re_2022 flow
> _stk_2022 flow_ira_2022 flow_residences_2022"

. foreach v of local checkvars {
  2.     capture confirm variable `v'
  3.     if _rc di as warn "  MISSING: `v'" 
  4.     else di as txt "  OK: `v'"
  5. }
  OK: sq148
  OK: rq148
  OK: sq134
  OK: rq134
  OK: sq317
  OK: rq317
  OK: sq166_1
  OK: rq166_1
  OK: sq166_2
  OK: rq166_2
  OK: sq166_3
  OK: rq166_3
  OK: sq331
  OK: rq331
  OK: sh020
  OK: rh020
  OK: sh162
  OK: rh162
  OK: flow_bus_2022
  OK: flow_re_2022
  OK: flow_stk_2022
  OK: flow_ira_2022
  OK: flow_residences_2022

. 
. * ---------------------------------------------------------------------
. * Optional: clean sentinel special-missing codes for value vars (adjust if already c
> leaned)
. * ---------------------------------------------------------------------
. local misscodes 9999998 9999999 -8 -9 999999998 999999999

. local valuevars "sq148 rq148 sq134 rq134 sq317 rq317 sq166_1 rq166_1 sq166_2 rq166_2
>  sq166_3 rq166_3 sq331 rq331 sh020 rh020 sh162 rh162"

. di as txt "Recoding common sentinel codes to missing for value vars (if present)..."
Recoding common sentinel codes to missing for value vars (if present)...

. foreach v of local valuevars {
  2.     capture confirm variable `v'
  3.     if _rc continue
  4.     foreach mc of local misscodes {
  5.         quietly replace `v' = . if `v' == `mc'
  6.     }
  7.     di as txt " Summary for `v' (post-recode):"
  8.     summarize `v', detail
  9. }
 Summary for sq148 (post-recode):

               business or farm equity amount
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 587
25%        15000              0       Sum of wgt.         587

50%       150000                      Mean           545994.7
                        Largest       Std. dev.       1398337
75%       500000       1.00e+07
90%      1200000       1.00e+07       Variance       1.96e+12
95%      2000000       1.20e+07       Skewness       7.527613
99%      7000000       2.00e+07       Kurtosis       82.25828
 Summary for rq148 (post-recode):

               business or farm equity amount
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 572
25%        15000              0       Sum of wgt.         572

50%       127500                      Mean           500951.5
                        Largest       Std. dev.       1277093
75%       460000        7000000
90%      1200000        8000000       Variance       1.63e+12
95%      2000000       1.00e+07       Skewness       8.358759
99%      5000000       2.00e+07       Kurtosis       106.7893
 Summary for sq134 (post-recode):

                    real estate asset amt
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%         5000              0
10%        15000              0       Obs                 901
25%        65000              0       Sum of wgt.         901

50%       200000                      Mean           505574.2
                        Largest       Std. dev.       1206028
75%       480000        9000000
90%      1000000       1.00e+07       Variance       1.45e+12
95%      2000000       1.30e+07       Skewness       7.300845
99%      6500000       1.80e+07       Kurtosis       77.36954
 Summary for rq134 (post-recode):

                    real estate asset amt
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%         6000              0
10%        15000              0       Obs                 865
25%        50000              0       Sum of wgt.         865

50%       150000                      Mean           572288.3
                        Largest       Std. dev.       5157707
75%       350000        7000000
90%       900000        8000000       Variance       2.66e+13
95%      1500000       1.00e+07       Skewness       28.18453
99%      5000000       1.50e+08       Kurtosis       816.3991
 Summary for sq317 (post-recode):

                     stocks total value
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%          500              0
10%         2500              0       Obs               1,316
25%        20000              0       Sum of wgt.       1,316

50%       100000                      Mean           431372.1
                        Largest       Std. dev.       1119903
75%       400000        8018000
90%      1000000       1.00e+07       Variance       1.25e+12
95%      2000000       1.86e+07       Skewness       9.364518
99%      5000000       2.00e+07       Kurtosis       135.4693
 Summary for rq317 (post-recode):

                     stocks total value
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0         -20000
 5%         1200              0
10%         3000              0       Obs               1,286
25%        20000              0       Sum of wgt.       1,286

50%       100000                      Mean           382130.5
                        Largest       Std. dev.      904364.3
75%       400000        6300000
90%      1000000        7000000       Variance       8.18e+11
95%      1600000       1.22e+07       Skewness       7.901657
99%      4000000       1.60e+07       Kurtosis        102.758
 Summary for sq166_1 (post-recode):

                  amount in ira account - 1
-------------------------------------------------------------
      Percentiles      Smallest
 1%          752              0
 5%         5000              0
10%        11000              0       Obs               2,481
25%        40000              0       Sum of wgt.       2,481

50%       117000                      Mean           272413.1
                        Largest       Std. dev.      594243.6
75%       300000        5000000
90%       690000       1.00e+07       Variance       3.53e+11
95%       965000       1.02e+07       Skewness       13.06958
99%      2000000       1.63e+07       Kurtosis       281.8683
 Summary for rq166_1 (post-recode):

                  amount in ira account - 1
-------------------------------------------------------------
      Percentiles      Smallest
 1%         1000              0
 5%         4000              0
10%        10000              0       Obs               2,433
25%        33000              0       Sum of wgt.       2,433

50%       100000                      Mean           225127.9
                        Largest       Std. dev.      394835.2
75%       250000        4000000
90%       600000        4200000       Variance       1.56e+11
95%       850000        5500000       Skewness       6.042237
99%      1932945        7000000       Kurtosis        67.6434
 Summary for sq166_2 (post-recode):

                  amount in ira account - 2
-------------------------------------------------------------
      Percentiles      Smallest
 1%          350              0
 5%         4000              0
10%         8000              0       Obs               1,261
25%        25000              0       Sum of wgt.       1,261

50%        75000                      Mean             150722
                        Largest       Std. dev.      244379.2
75%       182000        1900000
90%       350000        2000000       Variance       5.97e+10
95%       550000        2500000       Skewness       4.992485
99%      1225000        3400000       Kurtosis        43.7281
 Summary for rq166_2 (post-recode):

                  amount in ira account - 2
-------------------------------------------------------------
      Percentiles      Smallest
 1%          100              0
 5%         3000              0
10%         6000              0       Obs               1,264
25%        20350              0       Sum of wgt.       1,264

50%        60000                      Mean           119514.5
                        Largest       Std. dev.      186303.8
75%       145500        1400000
90%       291000        1755000       Variance       3.47e+10
95%       440000        2000000       Skewness       4.535554
99%       900000        2200000       Kurtosis        34.7467
 Summary for sq166_3 (post-recode):

                  amount in ira account - 3
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%         3000              0
10%         6064              0       Obs                 523
25%        25000              0       Sum of wgt.         523

50%        68000                      Mean           175351.9
                        Largest       Std. dev.      299222.7
75%       200000        1948534
90%       412000        2000000       Variance       8.95e+10
95%       630000        2200000       Skewness       3.922881
99%      1700000        2500000       Kurtosis       22.61314
 Summary for rq166_3 (post-recode):

                  amount in ira account - 3
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%         1800              0
10%         5000              0       Obs                 516
25%        20000              0       Sum of wgt.         516

50%        50000                      Mean           131487.9
                        Largest       Std. dev.      213233.5
75%       150000        1390000
90%       365000        1406986       Variance       4.55e+10
95%       550000        1500000       Skewness        3.77734
99%      1000000        2000000       Kurtosis        23.4069
 Summary for sq331 (post-recode):

                   bond assets total value
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%          100              0
10%          700              0       Obs                 210
25%        10000              0       Sum of wgt.         210

50%        71000                      Mean           222551.4
                        Largest       Std. dev.      475363.8
75%       250000        2000000
90%       520500        2000000       Variance       2.26e+11
95%      1000000        3000000       Skewness       5.301784
99%      2000000        4500000       Kurtosis       39.94891
 Summary for rq331 (post-recode):

                   bond assets total value
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%         1000              0
10%         4000              0       Obs                 208
25%        22500              0       Sum of wgt.         208

50%        76500                      Mean           203434.5
                        Largest       Std. dev.      352682.7
75%       210000        1300000
90%       500000        1400000       Variance       1.24e+11
95%       800000        2200000       Skewness       4.113335
99%      1400000        3000000       Kurtosis       26.51187
 Summary for sh020 (post-recode):

                     home present value
-------------------------------------------------------------
      Percentiles      Smallest
 1%        20000              0
 5%        60000              0
10%        90000              0       Obs               6,154
25%       175000              0       Sum of wgt.       6,154

50%       300000                      Mean           408425.8
                        Largest       Std. dev.        437600
75%       500000        5500000
90%       800000        6000000       Variance       1.91e+11
95%      1000000        9000000       Skewness       6.168932
99%      2000000       1.00e+07       Kurtosis       86.37908
 Summary for rh020 (post-recode):

                     home present value
-------------------------------------------------------------
      Percentiles      Smallest
 1%        20000              0
 5%        50000              0
10%        80000              0       Obs               6,015
25%       140000              0       Sum of wgt.       6,015

50%       239000                      Mean           987662.9
                        Largest       Std. dev.      4.08e+07
75%       400000        8500000
90%       650000       1.00e+07       Variance       1.66e+15
95%       850000       1.00e+09       Skewness       68.64432
99%      1600000       3.00e+09       Kurtosis       4930.013
 Summary for sh162 (post-recode):

                 purchase price second home
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%         5000              0       Obs                 938
25%        15000              0       Sum of wgt.         938

50%        54000                      Mean           133688.4
                        Largest       Std. dev.      286554.8
75%       160000        1300000
90%       334000        1500000       Variance       8.21e+10
95%       495000        1900000       Skewness         12.785
99%      1000000        6500000       Kurtosis       264.4955
 Summary for rh162 (post-recode):

                 purchase price second home
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%         2000              0
10%         6000              0       Obs                 977
25%        13500              0       Sum of wgt.         977

50%        50000                      Mean           120430.4
                        Largest       Std. dev.      193620.9
75%       150000        1600000
90%       310000        1800000       Variance       3.75e+10
95%       465000        1800000       Skewness       4.187411
99%       975000        2000000       Kurtosis       29.70291

. 
. * Totals for IRA and residences
. capture drop v_ira_2022 v_ira_2020 v_res_2022 v_res_2020

. egen double v_ira_2022 = rowtotal(sq166_1 sq166_2 sq166_3)

. egen double v_ira_2020 = rowtotal(rq166_1 rq166_2 rq166_3)

. di as txt "IRA totals (2022 and 2020):"
IRA totals (2022 and 2020):

. summarize v_ira_2022 v_ira_2020, detail

                         v_ira_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              14,442
25%            0              0       Sum of wgt.      14,442

50%            0                      Mean           66308.44
                        Largest       Std. dev.      342621.5
75%            0        6900000
90%       102000       1.02e+07       Variance       1.17e+11
95%       355597       1.07e+07       Skewness        17.0141
99%      1300000       1.65e+07       Kurtosis       545.9677

                         v_ira_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              14,442
25%            0              0       Sum of wgt.      14,442

50%            0                      Mean           53084.77
                        Largest       Std. dev.      246836.4
75%            0        4700000
90%        90000        5600000       Variance       6.09e+10
95%       292000        5940000       Skewness       10.65588
99%      1083000        8250000       Kurtosis       192.7707

. quietly count if !missing(v_ira_2022) & !missing(v_ira_2020)

. di as txt "Observations with BOTH IRA V_2022 & V_2020 present = " r(N)
Observations with BOTH IRA V_2022 & V_2020 present = 14442

. 
. egen double v_res_2022 = rowtotal(sh020 sh162)

. egen double v_res_2020 = rowtotal(rh020 rh162)

. di as txt "Residence totals (combined primary + secondary):"
Residence totals (combined primary + secondary):

. summarize v_res_2022 v_res_2020, detail

                         v_res_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              14,442
25%            0              0       Sum of wgt.      14,442

50%            0                      Mean           182720.7
                        Largest       Std. dev.      378323.1
75%       250000        6000000
90%       525000        9000000       Variance       1.43e+11
95%       800000       1.00e+07       Skewness       7.607184
99%      1600000       1.20e+07       Kurtosis        144.452

                         v_res_2020
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              14,442
25%            0              0       Sum of wgt.      14,442

50%            0                      Mean           419502.3
                        Largest       Std. dev.      2.63e+07
75%       200000        8600000
90%       400000       1.00e+07       Variance       6.92e+14
95%       616000       1.00e+09       Skewness       106.3737
99%      1228000       3.00e+09       Kurtosis       11837.76

. quietly count if !missing(v_res_2022) & !missing(v_res_2020)

. di as txt "Observations with BOTH V_res_2022 & V_res_2020 present = " r(N)
Observations with BOTH V_res_2022 & V_res_2020 present = 14442

. 
. * Capital gains per class
. capture drop cg_bus_2022 cg_re_2022 cg_stk_2022 cg_ira_2022 cg_bnd_2022 cg_res_total
> _2022

. 
. gen double cg_bus_2022 = .
(14,442 missing values generated)

. replace cg_bus_2022 = (sq148 - rq148) - cond(missing(flow_bus_2022),0,flow_bus_2022)
>  if !missing(sq148) & !missing(rq148)
(249 real changes made)

. di as txt "Business cg (cg_bus_2022) summary:"
Business cg (cg_bus_2022) summary:

. summarize cg_bus_2022, detail

                         cg_bus_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -1000000       -1500000
 5%      -400000       -1000000
10%      -200000       -1000000       Obs                 249
25%            0       -1000000       Sum of wgt.         249

50%        10000                      Mean           223986.8
                        Largest       Std. dev.      974972.7
75%       199000        3000000
90%       800000        5000000       Variance       9.51e+11
95%      1300000        7000000       Skewness       6.493169
99%      5000000       1.03e+07       Kurtosis        57.9512

. quietly count if !missing(cg_bus_2022)

. di as txt "Records with cg_bus_2022 computed = " r(N)
Records with cg_bus_2022 computed = 249

. 
. gen double cg_re_2022 = .
(14,442 missing values generated)

. replace cg_re_2022 = (sq134 - rq134) - cond(missing(flow_re_2022),0,flow_re_2022) if
>  !missing(sq134) & !missing(rq134)
(400 real changes made)

. di as txt "Real estate cg (cg_re_2022) summary:"
Real estate cg (cg_re_2022) summary:

. summarize cg_re_2022, detail

                         cg_re_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -2350000      -1.47e+08
 5%      -513500       -3400000
10%      -215000       -2600000       Obs                 400
25%       -10000       -2500000       Sum of wgt.         400

50%        37500                      Mean          -182054.5
                        Largest       Std. dev.       7442634
75%       165000        3310000
90%       674996        5300000       Variance       5.54e+13
95%      1144000        9300000       Skewness      -19.38229
99%      3135000       1.23e+07       Kurtosis        384.142

. quietly count if !missing(cg_re_2022)

. di as txt "Records with cg_re_2022 computed = " r(N)
Records with cg_re_2022 computed = 400

. 
. gen double cg_stk_2022 = .
(14,442 missing values generated)

. replace cg_stk_2022 = (sq317 - rq317) - cond(missing(flow_stk_2022),0,flow_stk_2022)
>  if !missing(sq317) & !missing(rq317)
(679 real changes made)

. di as txt "Stocks cg (cg_stk_2022) summary:"
Stocks cg (cg_stk_2022) summary:

. summarize cg_stk_2022, detail

                         cg_stk_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -1500000       -4100000
 5%      -358000       -2600000
10%      -169000       -2300000       Obs                 679
25%       -15000       -2300000       Sum of wgt.         679

50%         9000                      Mean           116533.9
                        Largest       Std. dev.      689664.2
75%       100000        4600000
90%       420000        5000000       Variance       4.76e+11
95%       900000        6424489       Skewness        4.29513
99%      2980000        7553000       Kurtosis       43.95301

. quietly count if !missing(cg_stk_2022)

. di as txt "Records with cg_stk_2022 computed = " r(N)
Records with cg_stk_2022 computed = 679

. 
. gen double cg_ira_2022 = .
(14,442 missing values generated)

. replace cg_ira_2022 = (v_ira_2022 - v_ira_2020) - cond(missing(flow_ira_2022),0,flow
> _ira_2022) if !missing(v_ira_2022) & !missing(v_ira_2020)
(14,442 real changes made)

. di as txt "IRA cg (cg_ira_2022) summary:"
IRA cg (cg_ira_2022) summary:

. summarize cg_ira_2022, detail

                         cg_ira_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%      -472000       -4070000
 5%       -70000       -3450000
10%        -7000       -3000000       Obs              14,442
25%            0       -3000000       Sum of wgt.      14,442

50%            0                      Mean           10203.22
                        Largest       Std. dev.      253875.6
75%            0        4000000
90%        14000        4965000       Variance       6.45e+10
95%       121000       1.01e+07       Skewness       22.06555
99%       700000       1.56e+07       Kurtosis       1201.119

. quietly count if !missing(cg_ira_2022)

. di as txt "Records with cg_ira_2022 computed = " r(N)
Records with cg_ira_2022 computed = 14442

. 
. gen double cg_bnd_2022 = .
(14,442 missing values generated)

. replace cg_bnd_2022 = (sq331 - rq331) if !missing(sq331) & !missing(rq331)
(65 real changes made)

. di as txt "Bonds cg (cg_bnd_2022) summary:"
Bonds cg (cg_bnd_2022) summary:

. summarize cg_bnd_2022, detail

                         cg_bnd_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%      -700000        -700000
 5%      -255000        -500000
10%      -200000        -305000       Obs                  65
25%       -50000        -255000       Sum of wgt.          65

50%            0                      Mean            -1741.4
                        Largest       Std. dev.      181766.7
75%        50000         283000
90%       205000         321000       Variance       3.30e+10
95%       283000         400000       Skewness       -.604528
99%       500000         500000       Kurtosis       6.476906

. quietly count if !missing(cg_bnd_2022)

. di as txt "Records with cg_bnd_2022 computed = " r(N)
Records with cg_bnd_2022 computed = 65

. 
. gen double cg_res_total_2022 = .
(14,442 missing values generated)

. replace cg_res_total_2022 = (v_res_2022 - v_res_2020) - cond(missing(flow_residences
> _2022),0,flow_residences_2022) if !missing(v_res_2022) & !missing(v_res_2020)
(14,442 real changes made)

. di as txt "Combined residences cg (cg_res_total_2022) summary:"
Combined residences cg (cg_res_total_2022) summary:

. summarize cg_res_total_2022, detail

                      cg_res_total_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%      -800000      -3.00e+09
 5%      -300000      -1.00e+09
10%      -140000      -1.00e+07       Obs              14,442
25%            0       -5600000       Sum of wgt.      14,442

50%            0                      Mean          -236086.1
                        Largest       Std. dev.      2.63e+07
75%        70000        6000000
90%       265000        9000000       Variance       6.91e+14
95%       450000        9090000       Skewness      -106.3454
99%      1000000       1.00e+07       Kurtosis       11832.31

. quietly count if !missing(cg_res_total_2022)

. di as txt "Records with cg_res_total_2022 computed = " r(N)
Records with cg_res_total_2022 computed = 14442

. 
. capture drop cg_total_2022

. egen double cg_total_2022 = rowtotal(cg_bus_2022 cg_re_2022 cg_stk_2022 cg_ira_2022 
> cg_bnd_2022 cg_res_total_2022)

. di as txt "TOTAL capital gains (cg_total_2022) summary (sum across classes):"
TOTAL capital gains (cg_total_2022) summary (sum across classes):

. summarize cg_total_2022, detail

                        cg_total_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -1015000      -3.14e+09
 5%      -360000      -1.00e+09
10%      -180000      -1.00e+07       Obs              14,442
25%            0       -4200000       Sum of wgt.      14,442

50%            0                      Mean          -221592.4
                        Largest       Std. dev.      2.75e+07
75%        85000       1.15e+07
90%       350000       1.26e+07       Variance       7.54e+14
95%       642000       1.46e+07       Skewness      -107.2662
99%      1685000       1.71e+07       Kurtosis       12020.09

. tabstat cg_total_2022, stats(n mean sd p50 min max) format(%12.2f)

    Variable |            N         Mean           SD          p50          Min
-------------+-----------------------------------------------------------------
cg_tota~2022 |     14442.00   -221592.36  27456216.40         0.00    -3.14e+09
-------------------------------------------------------------------------------

    Variable |          Max
-------------+-------------
cg_tota~2022 |  17114116.00
---------------------------

. 
. * ---------------------------------------------------------------------
. * Diagnostics: inspect top/bottom observations and counts per class
. * ---------------------------------------------------------------------
. di as txt "Top 30 largest positive cg_total_2022 (inspect components):"
Top 30 largest positive cg_total_2022 (inspect components):

. gsort -cg_total_2022

. list hhid rsubhh cg_total_2022 cg_bus_2022 cg_re_2022 cg_stk_2022 cg_ira_2022 cg_bnd
> _2022 cg_res_total_2022 in 1/30

     +------------------------------------------------------------------------+
  1. |   hhid | rsubhh | cg_tot~2 | cg_bus~2 | cg_re_~2 | cg_stk~2 | cg_ira~2 |
     | 524071 |      0 | 17114116 |        0 |        . |   115000 | 15553116 |
     |------------------------------------------------------------------------|
     |             cg_bnd~2              |              cg_res~2              |
     |                    .              |               1446000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
  2. |   hhid | rsubhh | cg_tot~2 | cg_bus~2 | cg_re_~2 | cg_stk~2 | cg_ira~2 |
     | 147589 |      0 | 14639800 |   200000 | 12265000 |  2150000 |  -230200 |
     |------------------------------------------------------------------------|
     |             cg_bnd~2              |              cg_res~2              |
     |                    .              |                255000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
  3. |   hhid | rsubhh | cg_tot~2 | cg_bus~2 | cg_re_~2 | cg_stk~2 | cg_ira~2 |
     | 034763 |      2 | 12600000 |  2500000 |  9300000 |        . |        0 |
     |------------------------------------------------------------------------|
     |             cg_bnd~2              |              cg_res~2              |
     |                    .              |                800000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
  4. |   hhid | rsubhh | cg_tot~2 | cg_bus~2 | cg_re_~2 | cg_stk~2 | cg_ira~2 |
     | 500044 |      0 | 11492000 |        . |  2400000 |        . |     2000 |
     |------------------------------------------------------------------------|
     |             cg_bnd~2              |              cg_res~2              |
     |                    .              |               9090000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
  5. |   hhid | rsubhh | cg_tot~2 | cg_bus~2 | cg_re_~2 | cg_stk~2 | cg_ira~2 |
     | 541556 |      0 | 10642000 | 10250000 |        0 |    50000 |    -3000 |
     |------------------------------------------------------------------------|
     |             cg_bnd~2              |              cg_res~2              |
     |                    .              |                345000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
  6. |   hhid | rsubhh | cg_tot~2 | cg_bus~2 | cg_re_~2 | cg_stk~2 | cg_ira~2 |
     | 558128 |      0 | 10060001 |        . |        . |        . |    60000 |
     |------------------------------------------------------------------------|
     |             cg_bnd~2              |              cg_res~2              |
     |                    .              |              10000001              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
  7. |   hhid | rsubhh | cg_tot~2 | cg_bus~2 | cg_re_~2 | cg_stk~2 | cg_ira~2 |
     | 552818 |      0 |  9750000 |        . |        . |        . |   750000 |
     |------------------------------------------------------------------------|
     |             cg_bnd~2              |              cg_res~2              |
     |                    .              |               9000000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
  8. |   hhid | rsubhh | cg_tot~2 | cg_bus~2 | cg_re_~2 | cg_stk~2 | cg_ira~2 |
     | 076617 |      0 |  9437451 |        . |        . |   -30000 | 10117451 |
     |------------------------------------------------------------------------|
     |             cg_bnd~2              |              cg_res~2              |
     |                    .              |               -650000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
  9. |   hhid | rsubhh | cg_tot~2 | cg_bus~2 | cg_re_~2 | cg_stk~2 | cg_ira~2 |
     | 118279 |      0 |  8940000 |        . |        . |        . |  3940000 |
     |------------------------------------------------------------------------|
     |             cg_bnd~2              |              cg_res~2              |
     |                    .              |               5000000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 10. |   hhid | rsubhh | cg_tot~2 | cg_bus~2 | cg_re_~2 | cg_stk~2 | cg_ira~2 |
     | 122692 |      0 |  8165000 |        . |        . |  3000000 |  4965000 |
     |------------------------------------------------------------------------|
     |             cg_bnd~2              |              cg_res~2              |
     |                    .              |                200000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 11. |   hhid | rsubhh | cg_tot~2 | cg_bus~2 | cg_re_~2 | cg_stk~2 | cg_ira~2 |
     | 500113 |      0 |  8049000 |        . |  5300000 |        . |  1080000 |
     |------------------------------------------------------------------------|
     |             cg_bnd~2              |              cg_res~2              |
     |                    .              |               1669000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 12. |   hhid | rsubhh | cg_tot~2 | cg_bus~2 | cg_re_~2 | cg_stk~2 | cg_ira~2 |
     | 502452 |      0 |  7806400 |        . |        . |  7553000 |   269400 |
     |------------------------------------------------------------------------|
     |             cg_bnd~2              |              cg_res~2              |
     |                    .              |                -16000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 13. |   hhid | rsubhh | cg_tot~2 | cg_bus~2 | cg_re_~2 | cg_stk~2 | cg_ira~2 |
     | 147421 |      0 |  7070000 |  7000000 |        . |        . |        0 |
     |------------------------------------------------------------------------|
     |             cg_bnd~2              |              cg_res~2              |
     |                    .              |                 70000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 14. |   hhid | rsubhh | cg_tot~2 | cg_bus~2 | cg_re_~2 | cg_stk~2 | cg_ira~2 |
     | 528714 |      0 |  6625000 |        . |  1000000 |  5000000 |   125000 |
     |------------------------------------------------------------------------|
     |             cg_bnd~2              |              cg_res~2              |
     |                    .              |                500000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 15. |   hhid | rsubhh | cg_tot~2 | cg_bus~2 | cg_re_~2 | cg_stk~2 | cg_ira~2 |
     | 137440 |      0 |  6574879 |        . |        . |  6424489 |   151454 |
     |------------------------------------------------------------------------|
     |             cg_bnd~2              |              cg_res~2              |
     |                -1064              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 16. |   hhid | rsubhh | cg_tot~2 | cg_bus~2 | cg_re_~2 | cg_stk~2 | cg_ira~2 |
     | 178976 |      1 |  6000000 |        . |        . |        . |        0 |
     |------------------------------------------------------------------------|
     |             cg_bnd~2              |              cg_res~2              |
     |                    .              |               6000000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 17. |   hhid | rsubhh | cg_tot~2 | cg_bus~2 | cg_re_~2 | cg_stk~2 | cg_ira~2 |
     | 541495 |      0 |  5584000 |  5000000 |        . |        . |    20000 |
     |------------------------------------------------------------------------|
     |             cg_bnd~2              |              cg_res~2              |
     |                    .              |                564000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 18. |   hhid | rsubhh | cg_tot~2 | cg_bus~2 | cg_re_~2 | cg_stk~2 | cg_ira~2 |
     | 030423 |      0 |  5120000 |  3000000 |  2000000 |    70000 |        0 |
     |------------------------------------------------------------------------|
     |             cg_bnd~2              |              cg_res~2              |
     |                    .              |                 50000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 19. |   hhid | rsubhh | cg_tot~2 | cg_bus~2 | cg_re_~2 | cg_stk~2 | cg_ira~2 |
     | 552965 |      0 |  5025000 |        . |        . |        . |  3725000 |
     |------------------------------------------------------------------------|
     |             cg_bnd~2              |              cg_res~2              |
     |                    .              |               1300000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 20. |   hhid | rsubhh | cg_tot~2 | cg_bus~2 | cg_re_~2 | cg_stk~2 | cg_ira~2 |
     | 502413 |      0 |  4650000 |        . |        . |        . |  3280000 |
     |------------------------------------------------------------------------|
     |             cg_bnd~2              |              cg_res~2              |
     |                    .              |               1370000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 21. |   hhid | rsubhh | cg_tot~2 | cg_bus~2 | cg_re_~2 | cg_stk~2 | cg_ira~2 |
     | 534586 |      0 |  4600000 |        . |        . |        . |  4000000 |
     |------------------------------------------------------------------------|
     |             cg_bnd~2              |              cg_res~2              |
     |                    .              |                600000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 22. |   hhid | rsubhh | cg_tot~2 | cg_bus~2 | cg_re_~2 | cg_stk~2 | cg_ira~2 |
     | 545994 |      0 |  4600000 |        . |        . |        . |  4000000 |
     |------------------------------------------------------------------------|
     |             cg_bnd~2              |              cg_res~2              |
     |                    .              |                600000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 23. |   hhid | rsubhh | cg_tot~2 | cg_bus~2 | cg_re_~2 | cg_stk~2 | cg_ira~2 |
     | 532216 |      0 |  4452000 |  1400000 |        . |  2700000 |    -3000 |
     |------------------------------------------------------------------------|
     |             cg_bnd~2              |              cg_res~2              |
     |               -45000              |                400000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 24. |   hhid | rsubhh | cg_tot~2 | cg_bus~2 | cg_re_~2 | cg_stk~2 | cg_ira~2 |
     | 212649 |      0 |  4141000 |        . |        . |  4600000 |  -459000 |
     |------------------------------------------------------------------------|
     |             cg_bnd~2              |              cg_res~2              |
     |                    .              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 25. |   hhid | rsubhh | cg_tot~2 | cg_bus~2 | cg_re_~2 | cg_stk~2 | cg_ira~2 |
     | 540399 |      0 |  4000000 |  1500000 |  2450000 |        . |        0 |
     |------------------------------------------------------------------------|
     |             cg_bnd~2              |              cg_res~2              |
     |                    .              |                 50000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 26. |   hhid | rsubhh | cg_tot~2 | cg_bus~2 | cg_re_~2 | cg_stk~2 | cg_ira~2 |
     | 552223 |      0 |  3980000 |        . |        . |        . |   580000 |
     |------------------------------------------------------------------------|
     |             cg_bnd~2              |              cg_res~2              |
     |                    .              |               3400000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 27. |   hhid | rsubhh | cg_tot~2 | cg_bus~2 | cg_re_~2 | cg_stk~2 | cg_ira~2 |
     | 559300 |      0 |  3950000 |        . |        . |        . |  3300000 |
     |------------------------------------------------------------------------|
     |             cg_bnd~2              |              cg_res~2              |
     |                    .              |                650000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 28. |   hhid | rsubhh | cg_tot~2 | cg_bus~2 | cg_re_~2 | cg_stk~2 | cg_ira~2 |
     | 527180 |      0 |  3776893 |        . |        . |        . |  2746893 |
     |------------------------------------------------------------------------|
     |             cg_bnd~2              |              cg_res~2              |
     |                    .              |               1030000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 29. |   hhid | rsubhh | cg_tot~2 | cg_bus~2 | cg_re_~2 | cg_stk~2 | cg_ira~2 |
     | 501517 |      1 |  3663000 |    25000 |        . |        . |   335000 |
     |------------------------------------------------------------------------|
     |             cg_bnd~2              |              cg_res~2              |
     |                    .              |               3303000              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 30. |   hhid | rsubhh | cg_tot~2 | cg_bus~2 | cg_re_~2 | cg_stk~2 | cg_ira~2 |
     | 558160 |      0 |  3641000 |        . |        . |        . |    41000 |
     |------------------------------------------------------------------------|
     |             cg_bnd~2              |              cg_res~2              |
     |                    .              |               3600000              |
     +------------------------------------------------------------------------+

. 
. di as txt "Top 30 largest negative cg_total_2022 (inspect components):"
Top 30 largest negative cg_total_2022 (inspect components):

. gsort cg_total_2022

. list hhid rsubhh cg_total_2022 cg_bus_2022 cg_re_2022 cg_stk_2022 cg_ira_2022 cg_bnd
> _2022 cg_res_total_2022 in 1/30

     +----------------------------------------------------------------------------+
  1. |   hhid | rsubhh | cg_to~2022 | cg_bus~2 | cg_re_2022 | cg_stk~2 | cg_ira~2 |
     | 912430 |      0 | -3.144e+09 |        . | -1.474e+08 |        . |   700000 |
     |----------------------------------------------------------------------------|
     |              cg_bnd~2              |              cg_res_t~2               |
     |                     .              |              -2.997e+09               |
     +----------------------------------------------------------------------------+

     +----------------------------------------------------------------------------+
  2. |   hhid | rsubhh | cg_to~2022 | cg_bus~2 | cg_re_2022 | cg_stk~2 | cg_ira~2 |
     | 909496 |      0 | -1.000e+09 |        . |          . |        . |  -100000 |
     |----------------------------------------------------------------------------|
     |              cg_bnd~2              |              cg_res_t~2               |
     |                     .              |              -1.000e+09               |
     +----------------------------------------------------------------------------+

     +----------------------------------------------------------------------------+
  3. |   hhid | rsubhh | cg_to~2022 | cg_bus~2 | cg_re_2022 | cg_stk~2 | cg_ira~2 |
     | 540637 |      0 |  -10000000 |        . |          . |        . |        0 |
     |----------------------------------------------------------------------------|
     |              cg_bnd~2              |              cg_res_t~2               |
     |                     .              |               -10000000               |
     +----------------------------------------------------------------------------+

     +----------------------------------------------------------------------------+
  4. |   hhid | rsubhh | cg_to~2022 | cg_bus~2 | cg_re_2022 | cg_stk~2 | cg_ira~2 |
     | 501770 |      1 |   -4200000 |        . |          . |        . | -3000000 |
     |----------------------------------------------------------------------------|
     |              cg_bnd~2              |              cg_res_t~2               |
     |                     .              |                -1200000               |
     +----------------------------------------------------------------------------+

     +----------------------------------------------------------------------------+
  5. |   hhid | rsubhh | cg_to~2022 | cg_bus~2 | cg_re_2022 | cg_stk~2 | cg_ira~2 |
     | 112575 |      0 |   -3823000 |        . |    1200000 |   300000 |   277000 |
     |----------------------------------------------------------------------------|
     |              cg_bnd~2              |              cg_res_t~2               |
     |                     .              |                -5600000               |
     +----------------------------------------------------------------------------+

     +----------------------------------------------------------------------------+
  6. |   hhid | rsubhh | cg_to~2022 | cg_bus~2 | cg_re_2022 | cg_stk~2 | cg_ira~2 |
     | 015893 |      0 |   -3750000 |        . |          . |        . | -3450000 |
     |----------------------------------------------------------------------------|
     |              cg_bnd~2              |              cg_res_t~2               |
     |                     .              |                 -300000               |
     +----------------------------------------------------------------------------+

     +----------------------------------------------------------------------------+
  7. |   hhid | rsubhh | cg_to~2022 | cg_bus~2 | cg_re_2022 | cg_stk~2 | cg_ira~2 |
     | 525815 |      0 |   -3525000 |        . |          . |        . | -2000000 |
     |----------------------------------------------------------------------------|
     |              cg_bnd~2              |              cg_res_t~2               |
     |                     .              |                -1525000               |
     +----------------------------------------------------------------------------+

     +----------------------------------------------------------------------------+
  8. |   hhid | rsubhh | cg_to~2022 | cg_bus~2 | cg_re_2022 | cg_stk~2 | cg_ira~2 |
     | 526133 |      0 |   -3460000 |        . |          . |        . |  -220000 |
     |----------------------------------------------------------------------------|
     |              cg_bnd~2              |              cg_res_t~2               |
     |                     .              |                -3240000               |
     +----------------------------------------------------------------------------+

     +----------------------------------------------------------------------------+
  9. |   hhid | rsubhh | cg_to~2022 | cg_bus~2 | cg_re_2022 | cg_stk~2 | cg_ira~2 |
     | 076856 |      0 |   -3425000 |        . |          . |        . |        0 |
     |----------------------------------------------------------------------------|
     |              cg_bnd~2              |              cg_res_t~2               |
     |                     .              |                -3425000               |
     +----------------------------------------------------------------------------+

     +----------------------------------------------------------------------------+
 10. |   hhid | rsubhh | cg_to~2022 | cg_bus~2 | cg_re_2022 | cg_stk~2 | cg_ira~2 |
     | 210974 |      0 |   -3410000 |        . |          . | -1500000 |        0 |
     |----------------------------------------------------------------------------|
     |              cg_bnd~2              |              cg_res_t~2               |
     |                     .              |                -1910000               |
     +----------------------------------------------------------------------------+

     +----------------------------------------------------------------------------+
 11. |   hhid | rsubhh | cg_to~2022 | cg_bus~2 | cg_re_2022 | cg_stk~2 | cg_ira~2 |
     | 523113 |      0 |   -3405000 |        . |          . |        . |  -800000 |
     |----------------------------------------------------------------------------|
     |              cg_bnd~2              |              cg_res_t~2               |
     |                     .              |                -2605000               |
     +----------------------------------------------------------------------------+

     +----------------------------------------------------------------------------+
 12. |   hhid | rsubhh | cg_to~2022 | cg_bus~2 | cg_re_2022 | cg_stk~2 | cg_ira~2 |
     | 075352 |      0 |   -3400000 |        . |          . |        . |        0 |
     |----------------------------------------------------------------------------|
     |              cg_bnd~2              |              cg_res_t~2               |
     |                     .              |                -3400000               |
     +----------------------------------------------------------------------------+

     +----------------------------------------------------------------------------+
 13. |   hhid | rsubhh | cg_to~2022 | cg_bus~2 | cg_re_2022 | cg_stk~2 | cg_ira~2 |
     | 137183 |      0 |   -3155000 |        . |          . |        . | -2760000 |
     |----------------------------------------------------------------------------|
     |              cg_bnd~2              |              cg_res_t~2               |
     |                     .              |                 -395000               |
     +----------------------------------------------------------------------------+

     +----------------------------------------------------------------------------+
 14. |   hhid | rsubhh | cg_to~2022 | cg_bus~2 | cg_re_2022 | cg_stk~2 | cg_ira~2 |
     | 535945 |      0 |   -3090000 |        . |          . |        . | -1200000 |
     |----------------------------------------------------------------------------|
     |              cg_bnd~2              |              cg_res_t~2               |
     |                     .              |                -1890000               |
     +----------------------------------------------------------------------------+

     +----------------------------------------------------------------------------+
 15. |   hhid | rsubhh | cg_to~2022 | cg_bus~2 | cg_re_2022 | cg_stk~2 | cg_ira~2 |
     | 523913 |      0 |   -3090000 |        0 |   -3400000 |        . |    70000 |
     |----------------------------------------------------------------------------|
     |              cg_bnd~2              |              cg_res_t~2               |
     |                     .              |                  240000               |
     +----------------------------------------------------------------------------+

     +----------------------------------------------------------------------------+
 16. |   hhid | rsubhh | cg_to~2022 | cg_bus~2 | cg_re_2022 | cg_stk~2 | cg_ira~2 |
     | 544811 |      0 |   -3030000 |        . |          . |        . | -1030000 |
     |----------------------------------------------------------------------------|
     |              cg_bnd~2              |              cg_res_t~2               |
     |                     .              |                -2000000               |
     +----------------------------------------------------------------------------+

     +----------------------------------------------------------------------------+
 17. |   hhid | rsubhh | cg_to~2022 | cg_bus~2 | cg_re_2022 | cg_stk~2 | cg_ira~2 |
     | 055720 |      0 |   -3020000 |        . |          . |        . |  -810000 |
     |----------------------------------------------------------------------------|
     |              cg_bnd~2              |              cg_res_t~2               |
     |                     .              |                -2210000               |
     +----------------------------------------------------------------------------+

     +----------------------------------------------------------------------------+
 18. |   hhid | rsubhh | cg_to~2022 | cg_bus~2 | cg_re_2022 | cg_stk~2 | cg_ira~2 |
     | 010929 |      0 |   -3000000 |        . |          . |        . |        0 |
     |----------------------------------------------------------------------------|
     |              cg_bnd~2              |              cg_res_t~2               |
     |                     .              |                -3000000               |
     +----------------------------------------------------------------------------+

     +----------------------------------------------------------------------------+
 19. |   hhid | rsubhh | cg_to~2022 | cg_bus~2 | cg_re_2022 | cg_stk~2 | cg_ira~2 |
     | 542739 |      0 |   -3000000 |        . |          . |        . |        0 |
     |----------------------------------------------------------------------------|
     |              cg_bnd~2              |              cg_res_t~2               |
     |                     .              |                -3000000               |
     +----------------------------------------------------------------------------+

     +----------------------------------------------------------------------------+
 20. |   hhid | rsubhh | cg_to~2022 | cg_bus~2 | cg_re_2022 | cg_stk~2 | cg_ira~2 |
     | 083181 |      0 |   -3000000 |        . |          . |        . |        0 |
     |----------------------------------------------------------------------------|
     |              cg_bnd~2              |              cg_res_t~2               |
     |                     .              |                -3000000               |
     +----------------------------------------------------------------------------+

     +----------------------------------------------------------------------------+
 21. |   hhid | rsubhh | cg_to~2022 | cg_bus~2 | cg_re_2022 | cg_stk~2 | cg_ira~2 |
     | 211577 |      0 |   -2975000 |        . |          . |        . | -3000000 |
     |----------------------------------------------------------------------------|
     |              cg_bnd~2              |              cg_res_t~2               |
     |                     .              |                   25000               |
     +----------------------------------------------------------------------------+

     +----------------------------------------------------------------------------+
 22. |   hhid | rsubhh | cg_to~2022 | cg_bus~2 | cg_re_2022 | cg_stk~2 | cg_ira~2 |
     | 501053 |      0 |   -2838982 |        . |          . | -4100000 |   951018 |
     |----------------------------------------------------------------------------|
     |              cg_bnd~2              |              cg_res_t~2               |
     |                     .              |                  310000               |
     +----------------------------------------------------------------------------+

     +----------------------------------------------------------------------------+
 23. |   hhid | rsubhh | cg_to~2022 | cg_bus~2 | cg_re_2022 | cg_stk~2 | cg_ira~2 |
     | 073406 |      0 |   -2823000 |        . |          . |        . | -2473000 |
     |----------------------------------------------------------------------------|
     |              cg_bnd~2              |              cg_res_t~2               |
     |                     .              |                 -350000               |
     +----------------------------------------------------------------------------+

     +----------------------------------------------------------------------------+
 24. |   hhid | rsubhh | cg_to~2022 | cg_bus~2 | cg_re_2022 | cg_stk~2 | cg_ira~2 |
     | 031208 |      0 |   -2800000 |        . |          . |        . |        0 |
     |----------------------------------------------------------------------------|
     |              cg_bnd~2              |              cg_res_t~2               |
     |                     .              |                -2800000               |
     +----------------------------------------------------------------------------+

     +----------------------------------------------------------------------------+
 25. |   hhid | rsubhh | cg_to~2022 | cg_bus~2 | cg_re_2022 | cg_stk~2 | cg_ira~2 |
     | 914149 |      0 |   -2799500 |  -800000 |   -2200000 |      500 |        0 |
     |----------------------------------------------------------------------------|
     |              cg_bnd~2              |              cg_res_t~2               |
     |                     .              |                  200000               |
     +----------------------------------------------------------------------------+

     +----------------------------------------------------------------------------+
 26. |   hhid | rsubhh | cg_to~2022 | cg_bus~2 | cg_re_2022 | cg_stk~2 | cg_ira~2 |
     | 544248 |      0 |   -2750000 |        . |          . |        . | -1950000 |
     |----------------------------------------------------------------------------|
     |              cg_bnd~2              |              cg_res_t~2               |
     |                     .              |                 -800000               |
     +----------------------------------------------------------------------------+

     +----------------------------------------------------------------------------+
 27. |   hhid | rsubhh | cg_to~2022 | cg_bus~2 | cg_re_2022 | cg_stk~2 | cg_ira~2 |
     | 034126 |      0 |   -2500000 |        . |          . |        . |        0 |
     |----------------------------------------------------------------------------|
     |              cg_bnd~2              |              cg_res_t~2               |
     |                     .              |                -2500000               |
     +----------------------------------------------------------------------------+

     +----------------------------------------------------------------------------+
 28. |   hhid | rsubhh | cg_to~2022 | cg_bus~2 | cg_re_2022 | cg_stk~2 | cg_ira~2 |
     | 501584 |      0 |   -2500000 |        . |          . |        . |        0 |
     |----------------------------------------------------------------------------|
     |              cg_bnd~2              |              cg_res_t~2               |
     |                     .              |                -2500000               |
     +----------------------------------------------------------------------------+

     +----------------------------------------------------------------------------+
 29. |   hhid | rsubhh | cg_to~2022 | cg_bus~2 | cg_re_2022 | cg_stk~2 | cg_ira~2 |
     | 502225 |      1 |   -2500000 |        . |          . |        . |        0 |
     |----------------------------------------------------------------------------|
     |              cg_bnd~2              |              cg_res_t~2               |
     |                     .              |                -2500000               |
     +----------------------------------------------------------------------------+

     +----------------------------------------------------------------------------+
 30. |   hhid | rsubhh | cg_to~2022 | cg_bus~2 | cg_re_2022 | cg_stk~2 | cg_ira~2 |
     | 529474 |      0 |   -2479000 |        . |   -2600000 |        . |  -139000 |
     |----------------------------------------------------------------------------|
     |              cg_bnd~2              |              cg_res_t~2               |
     |                     .              |                  260000               |
     +----------------------------------------------------------------------------+

. 
. foreach v in cg_bus_2022 cg_re_2022 cg_stk_2022 cg_ira_2022 cg_bnd_2022 cg_res_total
> _2022 {
  2.     quietly count if !missing(`v')
  3.     di as txt "`v' computed for " r(N) " obs"
  4. }
cg_bus_2022 computed for 249 obs
cg_re_2022 computed for 400 obs
cg_stk_2022 computed for 679 obs
cg_ira_2022 computed for 14442 obs
cg_bnd_2022 computed for 65 obs
cg_res_total_2022 computed for 14442 obs

. 
. save "`master'", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/cleaned/hrs_rand_2020_2
    > 022_master.dta saved

. di as txt "Saved capital gains vars back to master: `master'"
Saved capital gains vars back to master: /Volumes/SSD PRO/Github-forks/Chp2-Beliefsand
> Trust/Code/Data/HRS_RAND/cleaned/hrs_rand_2020_2022_master.dta

. 
. log close
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/cle
> aned/compute_capital_gains_2022_simple_residences.log
  log type:  text
 closed on:  22 Sep 2025, 12:17:52
--------------------------------------------------------------------------------------
