--------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/cle
> aned/compute_interest_dividends_2022.log
  log type:  text
 opened on:  22 Sep 2025, 12:15:46

. 
. set more off

. 
. local master "/Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/
> cleaned/hrs_rand_2020_2022_master.dta"

. capture confirm file "`master'"

. if _rc {
.     di as error "ERROR: master file not found -> `master'"
.     exit 198
. }

. 
. use "`master'", clear

. di as txt "Using master file: `master'"
Using master file: /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RA
> ND/cleaned/hrs_rand_2020_2022_master.dta

. 
. * ---------------------------------------------------------------------
. * 2022 (RAND lowercase) freq/amount pairs
. * ---------------------------------------------------------------------
. local f2022_re   sq139

. local a2022_re   sq141

. local f2022_bus  sq153

. local a2022_bus  sq155

. local f2022_ira  sq194

. local a2022_ira  sq190

. local f2022_stk  sq322

. local a2022_stk  sq324

. local f2022_bnd  sq336

. local a2022_bnd  sq338

. local f2022_cash sq350

. local a2022_cash sq352

. local f2022_cds  sq362

. local a2022_cds  sq364

. 
. * ---------------------------------------------------------------------
. * Recode frequency codes 7,8,9 -> missing ONLY for the frequency variables
. * ---------------------------------------------------------------------
. local freqvars "`f2022_re' `f2022_bus' `f2022_ira' `f2022_stk' `f2022_bnd' `f2022_ca
> sh' `f2022_cds'"

. di as txt "Recoding frequency codes 7/8/9 -> missing for 2022 frequency variables (o
> nly)."
Recoding frequency codes 7/8/9 -> missing for 2022 frequency variables (only).

. foreach v of local freqvars {
  2.     capture confirm variable `v'
  3.     if _rc {
  4.         di as txt "  Variable `v' not found in dataset -- skipping"
  5.     }
  6.     else {
  7.         capture confirm numeric variable `v'
  8.         if _rc {
  9.             di as txt "  Variable `v' is not numeric -- skipping recode (check ty
> pe)."
 10.         }
 11.         else {
 12.             quietly count if inlist(`v',7,8,9)
 13.             di as txt "  `v' records with codes 7/8/9 before recode = " r(N)
 14.             quietly replace `v' = . if inlist(`v',7,8,9)
 15.             quietly count if inlist(`v',7,8,9)
 16.             di as txt "  `v' records with codes 7/8/9 after recode  = " r(N)
 17.         }
 18.     }
 19. }
  sq139 records with codes 7/8/9 before recode = 16
  sq139 records with codes 7/8/9 after recode  = 0
  sq153 records with codes 7/8/9 before recode = 89
  sq153 records with codes 7/8/9 after recode  = 0
  sq194 records with codes 7/8/9 before recode = 3
  sq194 records with codes 7/8/9 after recode  = 0
  sq322 records with codes 7/8/9 before recode = 222
  sq322 records with codes 7/8/9 after recode  = 0
  sq336 records with codes 7/8/9 before recode = 45
  sq336 records with codes 7/8/9 after recode  = 0
  sq350 records with codes 7/8/9 before recode = 327
  sq350 records with codes 7/8/9 after recode  = 0
  sq362 records with codes 7/8/9 before recode = 116
  sq362 records with codes 7/8/9 after recode  = 0

. 
. * ---------------------------------------------------------------------
. * map_freq_to_mult: maps numeric frequency codes -> annual multipliers
. * with optional decode of value labels (for logging symmetry)
. * ---------------------------------------------------------------------
. capture program drop map_freq_to_mult

. program define map_freq_to_mult, rclass
  1.     syntax varname
  2.     local fq = "`varlist'"
  3. 
.     capture drop `fq'_lbl
  4.     capture drop `fq'_mult
  5. 
.     local labname : value label `fq'
  6.     if "`labname'" != "" {
  7.         decode `fq', gen(`fq'_lbl)
  8.     }
  9. 
.     gen double `fq'_mult = .
 10.     quietly replace `fq'_mult = 52 if `fq' == 1
 11.     quietly replace `fq'_mult = 24 if `fq' == 2
 12.     quietly replace `fq'_mult = 12 if `fq' == 3
 13.     quietly replace `fq'_mult = 4  if `fq' == 4
 14.     quietly replace `fq'_mult = 2  if `fq' == 5
 15.     quietly replace `fq'_mult = 1  if `fq' == 6
 16. 
.     di as txt "Mapping numeric codes to multipliers for `fq' completed."
 17.     capture confirm variable `fq'_lbl
 18.     if _rc == 0 {
 19.         di as txt "Showing unique value-label text for `fq' (if present):"
 20.         tab `fq'_lbl, nolabel
 21.     }
 22.     else {
 23.         di as txt "No value label attached to `fq' (or decode missing). Showing r
> aw numeric codes:"
 24.         tab `fq', missing
 25.     }
 26.     quietly count if !missing(`fq'_mult)
 27.     di as txt "`fq'_mult nonmissing observations = " r(N)
 28. end

. 
. * ---------------------------
. * Apply mapping to all 2022 frequency variables
. * ---------------------------
. di as txt "=== Mapping 2022 frequency variables ==="
=== Mapping 2022 frequency variables ===

. map_freq_to_mult `f2022_re'
(14,442 missing values generated)
Mapping numeric codes to multipliers for sq139 completed.
No value label attached to sq139 (or decode missing). Showing raw numeric codes:

     rental |
     income |
receive how |
      often |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          5        0.03        0.03
          3 |        519        3.59        3.63
          4 |         10        0.07        3.70
          5 |          6        0.04        3.74
          6 |         36        0.25        3.99
          . |     13,866       96.01      100.00
------------+-----------------------------------
      Total |     14,442      100.00
sq139_mult nonmissing observations = 576

. map_freq_to_mult `f2022_bus'
(14,442 missing values generated)
Mapping numeric codes to multipliers for sq153 completed.
No value label attached to sq153 (or decode missing). Showing raw numeric codes:

business or |
   farm inc |
receive how |
      often |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         43        0.30        0.30
          2 |         19        0.13        0.43
          3 |        132        0.91        1.34
          4 |         22        0.15        1.50
          5 |         32        0.22        1.72
          6 |        126        0.87        2.59
          . |     14,068       97.41      100.00
------------+-----------------------------------
      Total |     14,442      100.00
sq153_mult nonmissing observations = 374

. map_freq_to_mult `f2022_ira'
(14,442 missing values generated)
Mapping numeric codes to multipliers for sq194 completed.
No value label attached to sq194 (or decode missing). Showing raw numeric codes:

   inc from |
  other ira |
 amount pre |
  tax - per |      Freq.     Percent        Cum.
------------+-----------------------------------
          3 |         10        0.07        0.07
          6 |          5        0.03        0.10
          . |     14,427       99.90      100.00
------------+-----------------------------------
      Total |     14,442      100.00
sq194_mult nonmissing observations = 15

. map_freq_to_mult `f2022_stk'
(14,442 missing values generated)
Mapping numeric codes to multipliers for sq322 completed.
No value label attached to sq322 (or decode missing). Showing raw numeric codes:

      stock |
 income how |
      often |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        333        2.31        2.31
          3 |        154        1.07        3.37
          4 |        522        3.61        6.99
          5 |         21        0.15        7.13
          6 |        114        0.79        7.92
          . |     13,298       92.08      100.00
------------+-----------------------------------
      Total |     14,442      100.00
sq322_mult nonmissing observations = 1144

. map_freq_to_mult `f2022_bnd'
(14,442 missing values generated)
Mapping numeric codes to multipliers for sq336 completed.
No value label attached to sq336 (or decode missing). Showing raw numeric codes:

bond income |
  how often |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         61        0.42        0.42
          3 |         45        0.31        0.73
          4 |         35        0.24        0.98
          5 |         21        0.15        1.12
          6 |         32        0.22        1.34
          . |     14,248       98.66      100.00
------------+-----------------------------------
      Total |     14,442      100.00
sq336_mult nonmissing observations = 194

. map_freq_to_mult `f2022_cash'
(14,442 missing values generated)
Mapping numeric codes to multipliers for sq350 completed.
No value label attached to sq350 (or decode missing). Showing raw numeric codes:

   checking |
 income how |
      often |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        264        1.83        1.83
          3 |      1,992       13.79       15.62
          4 |        631        4.37       19.99
          5 |         36        0.25       20.24
          6 |        350        2.42       22.66
          . |     11,169       77.34      100.00
------------+-----------------------------------
      Total |     14,442      100.00
sq350_mult nonmissing observations = 3273

. map_freq_to_mult `f2022_cds'
(14,442 missing values generated)
Mapping numeric codes to multipliers for sq362 completed.
No value label attached to sq362 (or decode missing). Showing raw numeric codes:

 cds income |
  how often |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        121        0.84        0.84
          3 |        128        0.89        1.72
          4 |         96        0.66        2.39
          5 |         33        0.23        2.62
          6 |        137        0.95        3.57
          . |     13,927       96.43      100.00
------------+-----------------------------------
      Total |     14,442      100.00
sq362_mult nonmissing observations = 515

. 
. * ---------------------------------------------------------------------
. * Compute per-asset interest for 2022 when both amount & multiplier exist
. * ---------------------------------------------------------------------
. cap drop int_re_2022 int_bus_2022 int_ira_2022 int_stk_2022 int_bnd_2022 int_cash_20
> 22 int_cds_2022

. 
. gen double int_re_2022 = .
(14,442 missing values generated)

. replace int_re_2022 = `a2022_re' * `f2022_re'_mult if !missing(`a2022_re') & !missin
> g(`f2022_re'_mult)
(492 real changes made)

. di as txt "Real estate (2022) summary:"
Real estate (2022) summary:

. summarize int_re_2022, detail

                         int_re_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%         3600              0
10%         6000              0       Obs                 492
25%        10110              0       Sum of wgt.         492

50%        18660                      Mean           40018.46
                        Largest       Std. dev.      74396.15
75%        36000         372000
90%        84000         504000       Variance       5.53e+09
95%       168000         600000       Skewness       6.316775
99%       360000         960000       Kurtosis       61.16649

. 
. gen double int_bus_2022 = .
(14,442 missing values generated)

. replace int_bus_2022 = `a2022_bus' * `f2022_bus'_mult if !missing(`a2022_bus') & !mi
> ssing(`f2022_bus'_mult)
(212 real changes made)

. di as txt "Private business (2022) summary:"
Private business (2022) summary:

. summarize int_bus_2022, detail

                        int_bus_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%          300              0
10%         2040              0       Obs                 212
25%        15000              0       Sum of wgt.         212

50%        36000                      Mean           81189.09
                        Largest       Std. dev.      134748.3
75%        78000         540000
90%       192000         600000       Variance       1.82e+10
95%       348000         936000       Skewness       3.747136
99%       600000         960000       Kurtosis       20.29091

. 
. gen double int_ira_2022 = .
(14,442 missing values generated)

. replace int_ira_2022 = `a2022_ira' * `f2022_ira'_mult if !missing(`a2022_ira') & !mi
> ssing(`f2022_ira'_mult)
(15 real changes made)

. di as txt "IRA (2022) summary:"
IRA (2022) summary:

. summarize int_ira_2022, detail

                        int_ira_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%          840            840
 5%          840           2100
10%         2100           5256       Obs                  15
25%         6900           6900       Sum of wgt.          15

50%         8400                      Mean            24362.8
                        Largest       Std. dev.      47836.11
75%        18000          18000
90%        48500          26246       Variance       2.29e+09
95%       192000          48500       Skewness       3.150377
99%       192000         192000       Kurtosis       11.56414

. 
. gen double int_stk_2022 = .
(14,442 missing values generated)

. replace int_stk_2022 = `a2022_stk' * `f2022_stk'_mult if !missing(`a2022_stk') & !mi
> ssing(`f2022_stk'_mult)
(454 real changes made)

. di as txt "Stocks (2022) summary:"
Stocks (2022) summary:

. summarize int_stk_2022, detail

                        int_stk_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            4              0       Obs                 454
25%          120              0       Sum of wgt.         454

50%         1062                      Mean           15479.59
                        Largest       Std. dev.      74325.05
75%         8000         480000
90%        24000         520000       Variance       5.52e+09
95%        49800         596000       Skewness       11.40207
99%       240000        1200000       Kurtosis       159.4542

. 
. gen double int_bnd_2022 = .
(14,442 missing values generated)

. replace int_bnd_2022 = `a2022_bnd' * `f2022_bnd'_mult if !missing(`a2022_bnd') & !mi
> ssing(`f2022_bnd'_mult)
(58 real changes made)

. di as txt "Bonds (2022) summary:"
Bonds (2022) summary:

. summarize int_bnd_2022, detail

                        int_bnd_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                  58
25%          300              0       Sum of wgt.          58

50%         3920                      Mean           24864.28
                        Largest       Std. dev.      83534.46
75%        12000          80000
90%        40000         120000       Variance       6.98e+09
95%       120000         204000       Skewness       5.968566
99%       600000         600000       Kurtosis       40.52969

. 
. gen double int_cash_2022 = .
(14,442 missing values generated)

. replace int_cash_2022 = `a2022_cash' * `f2022_cash'_mult if !missing(`a2022_cash') &
>  !missing(`f2022_cash'_mult)
(1,834 real changes made)

. di as txt "Checking/savings (2022) summary:"
Checking/savings (2022) summary:

. summarize int_cash_2022, detail

                        int_cash_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,834
25%           12              0       Sum of wgt.       1,834

50%           40                      Mean           1755.626
                        Largest       Std. dev.      23182.18
75%          240         144000
90%         1080         240000       Variance       5.37e+08
95%         3200         600000       Skewness       26.38945
99%        21600         720000       Kurtosis        752.097

. 
. gen double int_cds_2022 = .
(14,442 missing values generated)

. replace int_cds_2022 = `a2022_cds' * `f2022_cds'_mult if !missing(`a2022_cds') & !mi
> ssing(`f2022_cds'_mult)
(153 real changes made)

. di as txt "CDS/t-bills (2022) summary:"
CDS/t-bills (2022) summary:

. summarize int_cds_2022, detail

                        int_cds_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 153
25%           10              0       Sum of wgt.         153

50%          240                      Mean           2402.784
                        Largest       Std. dev.      7957.554
75%         1200          32000
90%         3600          36000       Variance       6.33e+07
95%        12000          40000       Skewness       6.071186
99%        40000          72000       Kurtosis       45.67572

. 
. capture drop int_total_2022

. egen double int_total_2022 = rowtotal(int_re_2022 int_bus_2022 int_ira_2022 int_stk_
> 2022 int_bnd_2022 int_cash_2022 int_cds_2022)

. di as txt "TOTAL interest/dividends 2022 summary (sum across asset classes):"
TOTAL interest/dividends 2022 summary (sum across asset classes):

. summarize int_total_2022, detail

                       int_total_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              14,442
25%            0              0       Sum of wgt.      14,442

50%            0                      Mean           3415.311
                        Largest       Std. dev.      33551.91
75%            0         960000
90%          120         960000       Variance       1.13e+09
95%         7200        1026000       Skewness       24.87994
99%        72012        1800012       Kurtosis       895.0876

. tabstat int_total_2022, stats(n mean sd p50 min max) format(%12.2f)

    Variable |            N         Mean           SD          p50          Min
-------------+-----------------------------------------------------------------
int_tot~2022 |     14442.00      3415.31     33551.91         0.00         0.00
-------------------------------------------------------------------------------

    Variable |          Max
-------------+-------------
int_tot~2022 |   1800012.00
---------------------------

. 
. * ---------------------------------------------------------------------
. * Diagnostics: amount present but multiplier missing (2022)
. * ---------------------------------------------------------------------
. di as txt "=== Diagnostics: amount present but freq multiplier missing (2022) ==="
=== Diagnostics: amount present but freq multiplier missing (2022) ===

. foreach pair in ///
>     "`f2022_re' `a2022_re' int_re_2022" ///
>     "`f2022_bus' `a2022_bus' int_bus_2022" ///
>     "`f2022_ira' `a2022_ira' int_ira_2022" ///
>     "`f2022_stk' `a2022_stk' int_stk_2022" ///
>     "`f2022_bnd' `a2022_bnd' int_bnd_2022" ///
>     "`f2022_cash' `a2022_cash' int_cash_2022" ///
>     "`f2022_cds' `a2022_cds' int_cds_2022" {
  2.     local fq : word 1 of `pair'
  3.     local amt : word 2 of `pair'
  4.     local intv : word 3 of `pair'
  5.     di as txt "---- `intv' (amount var `amt' ; freq var `fq')"
  6.     quietly tab `fq', missing
  7.     quietly count if !missing(`amt') & missing(`fq'_mult)
  8.     di as txt "Records with amount but missing multiplier = " r(N)
  9.     quietly list hhid rsubhh `fq' `amt' in 1/10 if !missing(`amt') & missing(`fq'
> _mult)
 10. }
---- int_re_2022 (amount var sq141 ; freq var sq139)
Records with amount but missing multiplier = 0
---- int_bus_2022 (amount var sq155 ; freq var sq153)
Records with amount but missing multiplier = 0
---- int_ira_2022 (amount var sq190 ; freq var sq194)
Records with amount but missing multiplier = 51
---- int_stk_2022 (amount var sq324 ; freq var sq322)
Records with amount but missing multiplier = 0
---- int_bnd_2022 (amount var sq338 ; freq var sq336)
Records with amount but missing multiplier = 0
---- int_cash_2022 (amount var sq352 ; freq var sq350)
Records with amount but missing multiplier = 0
---- int_cds_2022 (amount var sq364 ; freq var sq362)
Records with amount but missing multiplier = 0

. 
. * ---------------------------------------------------------------------
. * Save dataset with new computed variables BACK TO MASTER (overwrite)
. * ---------------------------------------------------------------------
. save "`master'", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/cleaned/hrs_rand_2020_2
    > 022_master.dta saved

. di as txt "Saved 2022 interest/dividend vars back to master: `master'"
Saved 2022 interest/dividend vars back to master: /Volumes/SSD PRO/Github-forks/Chp2-B
> eliefsandTrust/Code/Data/HRS_RAND/cleaned/hrs_rand_2020_2022_master.dta

. 
. log close
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/cle
> aned/compute_interest_dividends_2022.log
  log type:  text
 closed on:  22 Sep 2025, 12:15:47
--------------------------------------------------------------------------------------
