----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/cleaned/com
> pute_total_returns_2022.log
  log type:  text
 opened on:  24 Sep 2025, 19:40:04

. 
. di as txt "=== COMPUTING TOTAL RETURNS TO NET WORTH ==="
=== COMPUTING TOTAL RETURNS TO NET WORTH ===

. di as txt "All prerequisite scripts have been run successfully"
All prerequisite scripts have been run successfully

. di as txt ""


. 
. * ---------------------------------------------------------------------
. * Step 3: Load the master dataset with all computed variables
. * ---------------------------------------------------------------------
. di as txt "=== Loading master dataset ==="
=== Loading master dataset ===

. 
. local master "/Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/cleaned/
> hrs_rand_2020_2022_master.dta"

. capture confirm file "`master'"

. if _rc {
.     di as error "ERROR: master file not found -> `master'"
.     exit 198
. }

. 
. use "`master'", clear

. di as txt "Using master file: `master'"
Using master file: /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/clean
> ed/hrs_rand_2020_2022_master.dta

. 
. * ---------------------------------------------------------------------
. * Step 4: Check for required variables
. * ---------------------------------------------------------------------
. di as txt "=== Checking for required asset class return variables ==="
=== Checking for required asset class return variables ===

. 
. local missing_vars ""

. capture confirm variable r_fin_2022

. if _rc local missing_vars "`missing_vars' r_fin_2022"

. capture confirm variable r_bus_2022

. if _rc local missing_vars "`missing_vars' r_bus_2022"

. capture confirm variable r_ira_2022

. if _rc local missing_vars "`missing_vars' r_ira_2022"

. capture confirm variable r_re_2022

. if _rc local missing_vars "`missing_vars' r_re_2022"

. capture confirm variable r_res_2022

. if _rc local missing_vars "`missing_vars' r_res_2022"

. 
. if "`missing_vars'" != "" {
.     di as error "ERROR: Missing required variables:`missing_vars'"
.     di as error "Prerequisite scripts may have failed."
.     exit 198
. }

. 
. di as txt "All required asset class return variables found!"
All required asset class return variables found!

. 
. * ---------------------------------------------------------------------
. * Step 5: List available return variables
. * ---------------------------------------------------------------------
. di as txt "=== Available asset class return variables ==="
=== Available asset class return variables ===

. di as txt "  r_fin_2022: Financial asset returns"
  r_fin_2022: Financial asset returns

. di as txt "  r_bus_2022: Business asset returns"
  r_bus_2022: Business asset returns

. di as txt "  r_ira_2022: Retirement asset returns"
  r_ira_2022: Retirement asset returns

. di as txt "  r_re_2022: Real estate returns"
  r_re_2022: Real estate returns

. di as txt "  r_res_2022: Residential housing returns"
  r_res_2022: Residential housing returns

. 
. * ---------------------------------------------------------------------
. * Step 6: Define sample for total returns computation
. * ---------------------------------------------------------------------
. di as txt "=== Defining sample for total returns computation ==="
=== Defining sample for total returns computation ===

. 
. * Sample: households with non-missing returns for at least 1 of the 5 asset classes
. gen byte has_any_returns = 0

. replace has_any_returns = 1 if !missing(r_fin_2022)
(1,887 real changes made)

. replace has_any_returns = 1 if !missing(r_bus_2022)
(175 real changes made)

. replace has_any_returns = 1 if !missing(r_ira_2022)
(767 real changes made)

. replace has_any_returns = 1 if !missing(r_re_2022)
(169 real changes made)

. replace has_any_returns = 1 if !missing(r_res_2022)
(1,882 real changes made)

. 
. quietly count if has_any_returns == 1

. local n_sample = r(N)

. quietly count

. local n_total = r(N)

. di as txt "Households with at least one asset class return: `n_sample' out of `n_total' (" %
> 4.1f 100*`n_sample'/`n_total' "%)"
Households with at least one asset class return: 4880 out of 14442 (33.8%)

. 
. * Breakdown by number of asset classes with returns
. egen byte n_asset_returns = rownonmiss(r_fin_2022 r_bus_2022 r_ira_2022 r_re_2022 r_res_2022
> )

. tab n_asset_returns if has_any_returns, missing

n_asset_ret |
       urns |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,168       44.43       44.43
          2 |      1,464       30.00       74.43
          3 |        986       20.20       94.63
          4 |        228        4.67       99.30
          5 |         34        0.70      100.00
------------+-----------------------------------
      Total |      4,880      100.00

. 
. * ---------------------------------------------------------------------
. * Detailed overlap analysis
. * ---------------------------------------------------------------------
. di as txt "=== Detailed overlap analysis ==="
=== Detailed overlap analysis ===

. 
. * Count non-missing returns for each asset class
. quietly count if !missing(r_fin_2022)

. local n_fin = r(N)

. quietly count if !missing(r_bus_2022)

. local n_bus = r(N)

. quietly count if !missing(r_ira_2022)

. local n_ira = r(N)

. quietly count if !missing(r_re_2022)

. local n_re = r(N)

. quietly count if !missing(r_res_2022)

. local n_res = r(N)

. 
. di as txt "Individual asset class return counts:"
Individual asset class return counts:

. di as txt "  Financial returns (r_fin_2022): `n_fin'"
  Financial returns (r_fin_2022): 1887

. di as txt "  Business returns (r_bus_2022): `n_bus'"
  Business returns (r_bus_2022): 341

. di as txt "  Retirement returns (r_ira_2022): `n_ira'"
  Retirement returns (r_ira_2022): 1869

. di as txt "  Real estate returns (r_re_2022): `n_re'"
  Real estate returns (r_re_2022): 591

. di as txt "  Residential returns (r_res_2022): `n_res'"
  Residential returns (r_res_2022): 4448

. 
. 
. * ---------------------------------------------------------------------
. * Step 7: Compute total returns (raw and trimmed)
. * ---------------------------------------------------------------------
. di as txt "=== Computing total returns ==="
=== Computing total returns ===

. 
. * Raw total returns: sum across all asset classes, treat missing as 0 within sample
. capture drop r_total_2022

. gen double r_total_2022 = .
(14,442 missing values generated)

. replace r_total_2022 = cond(missing(r_fin_2022), 0, r_fin_2022) + ///
>                       cond(missing(r_bus_2022), 0, r_bus_2022) + ///
>                       cond(missing(r_ira_2022), 0, r_ira_2022) + ///
>                       cond(missing(r_re_2022), 0, r_re_2022) + ///
>                       cond(missing(r_res_2022), 0, r_res_2022) ///
>                       if has_any_returns
(4,880 real changes made)

. 
. * Trimmed total returns: sum across trimmed asset class returns
. capture drop r_total_2022_trimmed

. gen double r_total_2022_trimmed = .
(14,442 missing values generated)

. replace r_total_2022_trimmed = cond(missing(r_fin_2022_trim), 0, r_fin_2022_trim) + ///
>                               cond(missing(r_bus_2022_trim), 0, r_bus_2022_trim) + ///
>                               cond(missing(r_ira_2022_trim), 0, r_ira_2022_trim) + ///
>                               cond(missing(r_re_2022_trimmed), 0, r_re_2022_trimmed) + ///
>                               cond(missing(r_res_2022_trimmed), 0, r_res_2022_trimmed) ///
>                               if has_any_returns
(4,880 real changes made)

. 
. * Final trimmed total returns: apply additional 5% trimming to the sum of trimmed asset clas
> s returns
. capture drop r_total_2022_final_trim

. gen double r_total_2022_final_trim = .
(14,442 missing values generated)

. 
. * Calculate trimming thresholds for the sum of trimmed returns
. quietly _pctile r_total_2022_trimmed if has_any_returns, p(5 95)

. scalar p5_trimmed = r(r1)

. scalar p95_trimmed = r(r2)

. 
. di as txt "Final trimming thresholds for sum of trimmed returns:"
Final trimming thresholds for sum of trimmed returns:

. di as txt "  5th percentile: " %12.4f p5_trimmed
  5th percentile:      -0.1924

. di as txt "  95th percentile: " %12.4f p95_trimmed
  95th percentile:       0.9459

. 
. * Apply final trimming
. replace r_total_2022_final_trim = r_total_2022_trimmed if has_any_returns & ///
>                                   r_total_2022_trimmed >= p5_trimmed & ///
>                                   r_total_2022_trimmed <= p95_trimmed
(4,392 real changes made)

. 
. quietly count if !missing(r_total_2022_final_trim)

. local n_final_trim = r(N)

. quietly count if has_any_returns

. local n_trimmed_total = r(N)

. di as txt "Final trimmed sample: `n_final_trim' out of `n_trimmed_total' trimmed total retur
> ns (" %4.1f 100*`n_final_trim'/`n_trimmed_total' "%)"
Final trimmed sample: 4392 out of 4880 trimmed total returns (90.0%)

. 
. * ---------------------------------------------------------------------
. * Step 8: Summaries and diagnostics
. * ---------------------------------------------------------------------
. di as txt "=== Total returns summaries ==="
=== Total returns summaries ===

. 
. di as txt "Raw total returns (r_total_2022) summary:"
Raw total returns (r_total_2022) summary:

. summarize r_total_2022 if has_any_returns, detail

                        r_total_2022
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -1.293103      -3.911234
 5%          -.5      -3.444444
10%    -.2482389       -3.28849       Obs               4,880
25%            0      -3.071429       Sum of wgt.       4,880

50%     .1642457                      Mean           .4221367
                        Largest       Std. dev.      1.873931
75%     .4671571          26.75
90%     1.034703       27.91363       Variance       3.511617
95%     1.697445             47       Skewness       19.36225
99%     5.944246             74       Kurtosis       606.5168

. tabstat r_total_2022 if has_any_returns, stats(n mean sd p50 min max) format(%12.4f)

    Variable |            N         Mean           SD          p50          Min          Max
-------------+------------------------------------------------------------------------------
r_total_2022 |    4880.0000       0.4221       1.8739       0.1642      -3.9112      74.0000
--------------------------------------------------------------------------------------------

. 
. di as txt "Trimmed total returns (r_total_2022_trimmed) summary:"
Trimmed total returns (r_total_2022_trimmed) summary:

. summarize r_total_2022_trimmed if has_any_returns, detail

                    r_total_2022_trimmed
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.3461063        -.58151
 5%    -.1923643      -.5599893
10%    -.1021428          -.545       Obs               4,880
25%            0      -.5299542       Sum of wgt.       4,880

50%     .1215273                      Mean           .2172361
                        Largest       Std. dev.      .3422771
75%     .3696234       1.696776
90%     .6839557       1.735454       Variance       .1171536
95%     .9458991       1.833333       Skewness       1.350605
99%     1.358366       2.443967       Kurtosis       5.303375

. tabstat r_total_2022_trimmed if has_any_returns, stats(n mean sd p50 min max) format(%12.4f)

    Variable |            N         Mean           SD          p50          Min          Max
-------------+------------------------------------------------------------------------------
r_total_20~d |    4880.0000       0.2172       0.3423       0.1215      -0.5815       2.4440
--------------------------------------------------------------------------------------------

. 
. di as txt "Final trimmed total returns (r_total_2022_final_trim) summary:"
Final trimmed total returns (r_total_2022_final_trim) summary:

. summarize r_total_2022_final_trim, detail

                   r_total_2022_final_trim
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.1724138      -.1921489
 5%    -.1101887      -.1913357
10%    -.0460526      -.1903619       Obs               4,392
25%            0       -.190128       Sum of wgt.       4,392

50%     .1215273                      Mean           .1912729
                        Largest       Std. dev.      .2448968
75%     .3333333       .9433962
90%     .5545455       .9437014       Variance       .0599744
95%     .7026616       .9444444       Skewness       .9567587
99%     .8816955       .9456624       Kurtosis       3.270499

. tabstat r_total_2022_final_trim, stats(n mean sd p50 min max) format(%12.4f)

    Variable |            N         Mean           SD          p50          Min          Max
-------------+------------------------------------------------------------------------------
r_total_20~m |    4392.0000       0.1913       0.2449       0.1215      -0.1921       0.9457
--------------------------------------------------------------------------------------------

. 
. * Check for extreme values
. quietly count if r_total_2022 > 5 & has_any_returns

. di as txt "Raw total returns > 500%: " r(N)
Raw total returns > 500%: 60

. quietly count if r_total_2022 < -1 & has_any_returns

. di as txt "Raw total returns < -100%: " r(N)
Raw total returns < -100%: 71

. 
. quietly count if r_total_2022_trimmed > 5 & has_any_returns

. di as txt "Trimmed total returns > 500%: " r(N)
Trimmed total returns > 500%: 0

. quietly count if r_total_2022_trimmed < -1 & has_any_returns

. di as txt "Trimmed total returns < -100%: " r(N)
Trimmed total returns < -100%: 0

. 
. quietly count if r_total_2022_final_trim > 5

. di as txt "Final trimmed total returns > 500%: " r(N)
Final trimmed total returns > 500%: 10050

. quietly count if r_total_2022_final_trim < -1

. di as txt "Final trimmed total returns < -100%: " r(N)
Final trimmed total returns < -100%: 0

. 
. * ---------------------------------------------------------------------
. * Step 9: Top 20 returns display
. * ---------------------------------------------------------------------
. di as txt "=== Top 20 total returns ==="
=== Top 20 total returns ===

. 
. di as txt "Top 20 positive raw total returns:"
Top 20 positive raw total returns:

. gsort -r_total_2022

. list hhid rsubhh r_total_2022 r_fin_2022 r_bus_2022 r_ira_2022 r_re_2022 r_res_2022 in 1/20 
> if has_any_returns

     +------------------------------------------------------------------------------+
  1. |   hhid | rsubhh | r_to~2022 | r_fi~2022 | r_bu~2022 | r_ira_2022 | r_re_2022 |
     | 173152 |      0 |        74 |         . |         . |          . |         . |
     |------------------------------------------------------------------------------|
     |                                  r_res_2~2                                   |
     |                                         74                                   |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
  2. |   hhid | rsubhh | r_to~2022 | r_fi~2022 | r_bu~2022 | r_ira_2022 | r_re_2022 |
     | 056038 |      1 |        47 |         . |         . |          . |         . |
     |------------------------------------------------------------------------------|
     |                                  r_res_2~2                                   |
     |                                         47                                   |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
  3. |   hhid | rsubhh | r_to~2022 | r_fi~2022 | r_bu~2022 | r_ira_2022 | r_re_2022 |
     | 544898 |      0 | 27.913625 |         . |     12.55 |          . |        .3 |
     |------------------------------------------------------------------------------|
     |                                  r_res_2~2                                   |
     |                                  15.063625                                   |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
  4. |   hhid | rsubhh | r_to~2022 | r_fi~2022 | r_bu~2022 | r_ira_2022 | r_re_2022 |
     | 543275 |      0 |     26.75 |         . |         . |          . |         . |
     |------------------------------------------------------------------------------|
     |                                  r_res_2~2                                   |
     |                                      26.75                                   |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
  5. |   hhid | rsubhh | r_to~2022 | r_fi~2022 | r_bu~2022 | r_ira_2022 | r_re_2022 |
     | 532858 |      0 |      26.5 |         . |         . |          . |         . |
     |------------------------------------------------------------------------------|
     |                                  r_res_2~2                                   |
     |                                       26.5                                   |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
  6. |   hhid | rsubhh | r_to~2022 | r_fi~2022 | r_bu~2022 | r_ira_2022 | r_re_2022 |
     | 523097 |      2 |     23.75 |         . |         . |          . |    10.125 |
     |------------------------------------------------------------------------------|
     |                                  r_res_2~2                                   |
     |                                     13.625                                   |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
  7. |   hhid | rsubhh | r_to~2022 | r_fi~2022 | r_bu~2022 | r_ira_2022 | r_re_2022 |
     | 527580 |      0 | 19.067406 |         . |         . |          . |         . |
     |------------------------------------------------------------------------------|
     |                                  r_res_2~2                                   |
     |                                  19.067406                                   |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
  8. |   hhid | rsubhh | r_to~2022 | r_fi~2022 | r_bu~2022 | r_ira_2022 | r_re_2022 |
     | 537251 |      0 | 16.080192 |   .000192 |         . |          . |         . |
     |------------------------------------------------------------------------------|
     |                                  r_res_2~2                                   |
     |                                      16.08                                   |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
  9. |   hhid | rsubhh | r_to~2022 | r_fi~2022 | r_bu~2022 | r_ira_2022 | r_re_2022 |
     | 501255 |      0 | 15.421053 |         0 | .52631579 |          . |         . |
     |------------------------------------------------------------------------------|
     |                                  r_res_2~2                                   |
     |                                  14.894737                                   |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
 10. |   hhid | rsubhh | r_to~2022 | r_fi~2022 | r_bu~2022 | r_ira_2022 | r_re_2022 |
     | 542265 |      0 | 15.341593 |         . |         . |          . | 15.341593 |
     |------------------------------------------------------------------------------|
     |                                  r_res_2~2                                   |
     |                                          .                                   |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
 11. |   hhid | rsubhh | r_to~2022 | r_fi~2022 | r_bu~2022 | r_ira_2022 | r_re_2022 |
     | 918669 |      0 | 15.300142 |         . |         . |          . |         . |
     |------------------------------------------------------------------------------|
     |                                  r_res_2~2                                   |
     |                                  15.300142                                   |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
 12. |   hhid | rsubhh | r_to~2022 | r_fi~2022 | r_bu~2022 | r_ira_2022 | r_re_2022 |
     | 044977 |      2 | 14.818182 |         . |         . |          . |         . |
     |------------------------------------------------------------------------------|
     |                                  r_res_2~2                                   |
     |                                  14.818182                                   |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
 13. |   hhid | rsubhh | r_to~2022 | r_fi~2022 | r_bu~2022 | r_ira_2022 | r_re_2022 |
     | 500570 |      0 | 13.939394 |         . |         . | -2.7272727 |         . |
     |------------------------------------------------------------------------------|
     |                                  r_res_2~2                                   |
     |                                  16.666667                                   |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
 14. |   hhid | rsubhh | r_to~2022 | r_fi~2022 | r_bu~2022 | r_ira_2022 | r_re_2022 |
     | 546280 |      0 |   13.5278 | 2.3492561 |         . | -.00078309 |  10.47455 |
     |------------------------------------------------------------------------------|
     |                                  r_res_2~2                                   |
     |                                  .70477682                                   |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
 15. |   hhid | rsubhh | r_to~2022 | r_fi~2022 | r_bu~2022 | r_ira_2022 | r_re_2022 |
     | 543034 |      1 | 12.782609 |         . |         . |          . |         . |
     |------------------------------------------------------------------------------|
     |                                  r_res_2~2                                   |
     |                                  12.782609                                   |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
 16. |   hhid | rsubhh | r_to~2022 | r_fi~2022 | r_bu~2022 | r_ira_2022 | r_re_2022 |
     | 904135 |      0 |        12 |         . |         . |          . |         . |
     |------------------------------------------------------------------------------|
     |                                  r_res_2~2                                   |
     |                                         12                                   |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
 17. |   hhid | rsubhh | r_to~2022 | r_fi~2022 | r_bu~2022 | r_ira_2022 | r_re_2022 |
     | 123704 |      0 | 11.944961 | .00697674 |         . |          . |         . |
     |------------------------------------------------------------------------------|
     |                                  r_res_2~2                                   |
     |                                  11.937984                                   |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
 18. |   hhid | rsubhh | r_to~2022 | r_fi~2022 | r_bu~2022 | r_ira_2022 | r_re_2022 |
     | 528362 |      0 | 10.712074 |         . |         . |          . |         . |
     |------------------------------------------------------------------------------|
     |                                  r_res_2~2                                   |
     |                                  10.712074                                   |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
 19. |   hhid | rsubhh | r_to~2022 | r_fi~2022 | r_bu~2022 | r_ira_2022 | r_re_2022 |
     | 545114 |      0 | 10.693381 |         . |         . |          . |         . |
     |------------------------------------------------------------------------------|
     |                                  r_res_2~2                                   |
     |                                  10.693381                                   |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
 20. |   hhid | rsubhh | r_to~2022 | r_fi~2022 | r_bu~2022 | r_ira_2022 | r_re_2022 |
     | 541987 |      0 | 10.611465 |         . |         . |          . | 10.611465 |
     |------------------------------------------------------------------------------|
     |                                  r_res_2~2                                   |
     |                                          .                                   |
     +------------------------------------------------------------------------------+

. 
. di as txt "Top 20 negative raw total returns:"
Top 20 negative raw total returns:

. gsort r_total_2022

. list hhid rsubhh r_total_2022 r_fin_2022 r_bus_2022 r_ira_2022 r_re_2022 r_res_2022 in 1/20 
> if has_any_returns

     +---------------------------------------------------------------------------------+
  1. |   hhid | rsubhh | r_tot~2022 | r_fin_2022 | r_bu~2022 | r_ira_2022 |  r_re_2022 |
     | 501284 |      0 | -3.9112344 |          0 |         . | -1.9694868 |          . |
     |---------------------------------------------------------------------------------|
     |                                   r_res_2022                                    |
     |                                   -1.9417476                                    |
     +---------------------------------------------------------------------------------+

     +---------------------------------------------------------------------------------+
  2. |   hhid | rsubhh | r_tot~2022 | r_fin_2022 | r_bu~2022 | r_ira_2022 |  r_re_2022 |
     | 187575 |      1 | -3.4444444 |          . |         . |  .16666667 |          . |
     |---------------------------------------------------------------------------------|
     |                                   r_res_2022                                    |
     |                                   -3.6111111                                    |
     +---------------------------------------------------------------------------------+

     +---------------------------------------------------------------------------------+
  3. |   hhid | rsubhh | r_tot~2022 | r_fin_2022 | r_bu~2022 | r_ira_2022 |  r_re_2022 |
     | 544707 |      0 | -3.2884903 |          . |         . |          . |          . |
     |---------------------------------------------------------------------------------|
     |                                   r_res_2022                                    |
     |                                   -3.2884903                                    |
     +---------------------------------------------------------------------------------+

     +---------------------------------------------------------------------------------+
  4. |   hhid | rsubhh | r_tot~2022 | r_fin_2022 | r_bu~2022 | r_ira_2022 |  r_re_2022 |
     | 073108 |      0 | -3.0714286 |          . |         . |          . |          . |
     |---------------------------------------------------------------------------------|
     |                                   r_res_2022                                    |
     |                                   -3.0714286                                    |
     +---------------------------------------------------------------------------------+

     +---------------------------------------------------------------------------------+
  5. |   hhid | rsubhh | r_tot~2022 | r_fin_2022 | r_bu~2022 | r_ira_2022 |  r_re_2022 |
     | 545965 |      0 | -2.8571429 |          . |         . | -2.8571429 |          . |
     |---------------------------------------------------------------------------------|
     |                                   r_res_2022                                    |
     |                                            .                                    |
     +---------------------------------------------------------------------------------+

     +---------------------------------------------------------------------------------+
  6. |   hhid | rsubhh | r_tot~2022 | r_fin_2022 | r_bu~2022 | r_ira_2022 |  r_re_2022 |
     | 546470 |      0 | -2.6333333 | -2.6333333 |         . |          . |          . |
     |---------------------------------------------------------------------------------|
     |                                   r_res_2022                                    |
     |                                            .                                    |
     +---------------------------------------------------------------------------------+

     +---------------------------------------------------------------------------------+
  7. |   hhid | rsubhh | r_tot~2022 | r_fin_2022 | r_bu~2022 | r_ira_2022 |  r_re_2022 |
     | 501328 |      0 | -2.5248539 |  .03521972 | .15368606 | -.00824462 |          . |
     |---------------------------------------------------------------------------------|
     |                                   r_res_2022                                    |
     |                                   -2.7055151                                    |
     +---------------------------------------------------------------------------------+

     +---------------------------------------------------------------------------------+
  8. |   hhid | rsubhh | r_tot~2022 | r_fin_2022 | r_bu~2022 | r_ira_2022 |  r_re_2022 |
     | 906307 |      7 | -2.4289406 |          . |         . |          . |          . |
     |---------------------------------------------------------------------------------|
     |                                   r_res_2022                                    |
     |                                   -2.4289406                                    |
     +---------------------------------------------------------------------------------+

     +---------------------------------------------------------------------------------+
  9. |   hhid | rsubhh | r_tot~2022 | r_fin_2022 | r_bu~2022 | r_ira_2022 |  r_re_2022 |
     | 543224 |      0 | -2.3501022 |  .00163599 |         . |          . |          . |
     |---------------------------------------------------------------------------------|
     |                                   r_res_2022                                    |
     |                                   -2.3517382                                    |
     +---------------------------------------------------------------------------------+

     +---------------------------------------------------------------------------------+
 10. |   hhid | rsubhh | r_tot~2022 | r_fin_2022 | r_bu~2022 | r_ira_2022 |  r_re_2022 |
     | 186563 |      0 | -2.1712062 |          . |         . |          . |          . |
     |---------------------------------------------------------------------------------|
     |                                   r_res_2022                                    |
     |                                   -2.1712062                                    |
     +---------------------------------------------------------------------------------+

     +---------------------------------------------------------------------------------+
 11. |   hhid | rsubhh | r_tot~2022 | r_fin_2022 | r_bu~2022 | r_ira_2022 |  r_re_2022 |
     | 502751 |      0 | -2.1026226 |          . |         . |          . |          . |
     |---------------------------------------------------------------------------------|
     |                                   r_res_2022                                    |
     |                                   -2.1026226                                    |
     +---------------------------------------------------------------------------------+

     +---------------------------------------------------------------------------------+
 12. |   hhid | rsubhh | r_tot~2022 | r_fin_2022 | r_bu~2022 | r_ira_2022 |  r_re_2022 |
     | 500277 |      2 | -2.0916335 |          . |         . |          . |          . |
     |---------------------------------------------------------------------------------|
     |                                   r_res_2022                                    |
     |                                   -2.0916335                                    |
     +---------------------------------------------------------------------------------+

     +---------------------------------------------------------------------------------+
 13. |   hhid | rsubhh | r_tot~2022 | r_fin_2022 | r_bu~2022 | r_ira_2022 |  r_re_2022 |
     | 916112 |      0 | -1.9545804 |          . |         . |          . |          . |
     |---------------------------------------------------------------------------------|
     |                                   r_res_2022                                    |
     |                                   -1.9545804                                    |
     +---------------------------------------------------------------------------------+

     +---------------------------------------------------------------------------------+
 14. |   hhid | rsubhh | r_tot~2022 | r_fin_2022 | r_bu~2022 | r_ira_2022 |  r_re_2022 |
     | 525290 |      0 | -1.9259259 |          . |         . |          . |          . |
     |---------------------------------------------------------------------------------|
     |                                   r_res_2022                                    |
     |                                   -1.9259259                                    |
     +---------------------------------------------------------------------------------+

     +---------------------------------------------------------------------------------+
 15. |   hhid | rsubhh | r_tot~2022 | r_fin_2022 | r_bu~2022 | r_ira_2022 |  r_re_2022 |
     | 502750 |      2 | -1.8778281 |          . |         . |          . |          . |
     |---------------------------------------------------------------------------------|
     |                                   r_res_2022                                    |
     |                                   -1.8778281                                    |
     +---------------------------------------------------------------------------------+

     +---------------------------------------------------------------------------------+
 16. |   hhid | rsubhh | r_tot~2022 | r_fin_2022 | r_bu~2022 | r_ira_2022 |  r_re_2022 |
     | 501733 |      0 | -1.8726592 |          . |         . |          . |          . |
     |---------------------------------------------------------------------------------|
     |                                   r_res_2022                                    |
     |                                   -1.8726592                                    |
     +---------------------------------------------------------------------------------+

     +---------------------------------------------------------------------------------+
 17. |   hhid | rsubhh | r_tot~2022 | r_fin_2022 | r_bu~2022 | r_ira_2022 |  r_re_2022 |
     | 078478 |      0 | -1.8373984 |          . | .19512195 |          . | -2.0325203 |
     |---------------------------------------------------------------------------------|
     |                                   r_res_2022                                    |
     |                                            .                                    |
     +---------------------------------------------------------------------------------+

     +---------------------------------------------------------------------------------+
 18. |   hhid | rsubhh | r_tot~2022 | r_fin_2022 | r_bu~2022 | r_ira_2022 |  r_re_2022 |
     | 527592 |      0 | -1.8080645 |          . | .08709677 |          . |          . |
     |---------------------------------------------------------------------------------|
     |                                   r_res_2022                                    |
     |                                   -1.8951613                                    |
     +---------------------------------------------------------------------------------+

     +---------------------------------------------------------------------------------+
 19. |   hhid | rsubhh | r_tot~2022 | r_fin_2022 | r_bu~2022 | r_ira_2022 |  r_re_2022 |
     | 537521 |      1 |      -1.75 |          . | .01829268 |          . |          . |
     |---------------------------------------------------------------------------------|
     |                                   r_res_2022                                    |
     |                                   -1.7682927                                    |
     +---------------------------------------------------------------------------------+

     +---------------------------------------------------------------------------------+
 20. |   hhid | rsubhh | r_tot~2022 | r_fin_2022 | r_bu~2022 | r_ira_2022 |  r_re_2022 |
     | 502196 |      0 | -1.7407485 |  .00251836 |         . | -.01678909 |          . |
     |---------------------------------------------------------------------------------|
     |                                   r_res_2022                                    |
     |                                   -1.7264778                                    |
     +---------------------------------------------------------------------------------+

. 
. di as txt "Top 20 positive trimmed total returns:"
Top 20 positive trimmed total returns:

. gsort -r_total_2022_trimmed

. list hhid rsubhh r_total_2022_trimmed r_fin_2022_trim r_bus_2022_trim r_ira_2022_trim r_re_2
> 022_trimmed r_res_2022_trimmed in 1/20 if has_any_returns

     +------------------------------------------------------------------------------+
  1. |   hhid | rsubhh | r_total~d | r_fin_2~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 500369 |      0 |  2.443967 | .00009906 | 1.0023585 | -.16863208 | .86367925 |
     |------------------------------------------------------------------------------|
     |                                  r_res_20~d                                  |
     |                                   .74646226                                  |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
  2. |   hhid | rsubhh | r_total~d | r_fin_2~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 500097 |      0 | 1.8333333 |         . |         . |          . | .44444444 |
     |------------------------------------------------------------------------------|
     |                                  r_res_20~d                                  |
     |                                   1.3888889                                  |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
  3. |   hhid | rsubhh | r_total~d | r_fin_2~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 542636 |      0 | 1.7354537 | .00299345 |         . |          . | .43217961 |
     |------------------------------------------------------------------------------|
     |                                  r_res_20~d                                  |
     |                                   1.3002806                                  |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
  4. |   hhid | rsubhh | r_total~d | r_fin_2~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 542204 |      0 | 1.6967762 | .00006363 | .79533404 |          . |         . |
     |------------------------------------------------------------------------------|
     |                                  r_res_20~d                                  |
     |                                   .90137858                                  |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
  5. |   hhid | rsubhh | r_total~d | r_fin_2~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 531215 |      0 | 1.6435792 | .22463497 |         . |  .02321228 |         . |
     |------------------------------------------------------------------------------|
     |                                  r_res_20~d                                  |
     |                                   1.3957319                                  |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
  6. |   hhid | rsubhh | r_total~d | r_fin_2~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 541727 |      0 | 1.6307692 |         0 |         . |  .13333333 |         . |
     |------------------------------------------------------------------------------|
     |                                  r_res_20~d                                  |
     |                                   1.4974359                                  |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
  7. |   hhid | rsubhh | r_total~d | r_fin_2~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 184271 |      0 |  1.576324 |         . |         . |  .17445483 |         . |
     |------------------------------------------------------------------------------|
     |                                  r_res_20~d                                  |
     |                                   1.4018692                                  |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
  8. |   hhid | rsubhh | r_total~d | r_fin_2~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 520365 |      0 | 1.5265674 | .00023247 |         . |   .0733745 | .09081003 |
     |------------------------------------------------------------------------------|
     |                                  r_res_20~d                                  |
     |                                   1.3621504                                  |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
  9. |   hhid | rsubhh | r_total~d | r_fin_2~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 500631 |      0 | 1.5017333 | .00173333 |         . |          . |         . |
     |------------------------------------------------------------------------------|
     |                                  r_res_20~d                                  |
     |                                         1.5                                  |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
 10. |   hhid | rsubhh | r_total~d | r_fin_2~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 543659 |      0 |       1.5 |         . |         . |          . |         . |
     |------------------------------------------------------------------------------|
     |                                  r_res_20~d                                  |
     |                                         1.5                                  |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
 11. |   hhid | rsubhh | r_total~d | r_fin_2~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 018075 |      0 |       1.5 |         . |         . |          . |         . |
     |------------------------------------------------------------------------------|
     |                                  r_res_20~d                                  |
     |                                         1.5                                  |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
 12. |   hhid | rsubhh | r_total~d | r_fin_2~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 523827 |      0 | 1.4999769 |         . |         . |          . | .38460947 |
     |------------------------------------------------------------------------------|
     |                                  r_res_20~d                                  |
     |                                   1.1153675                                  |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
 13. |   hhid | rsubhh | r_total~d | r_fin_2~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 543621 |      0 | 1.4942529 |         . |         . |          . |         . |
     |------------------------------------------------------------------------------|
     |                                  r_res_20~d                                  |
     |                                   1.4942529                                  |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
 14. |   hhid | rsubhh | r_total~d | r_fin_2~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 914267 |      0 | 1.4935065 |         . |         . |          . |         . |
     |------------------------------------------------------------------------------|
     |                                  r_res_20~d                                  |
     |                                   1.4935065                                  |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
 15. |   hhid | rsubhh | r_total~d | r_fin_2~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 501243 |      0 | 1.4925373 |         . |         . |          . |         . |
     |------------------------------------------------------------------------------|
     |                                  r_res_20~d                                  |
     |                                   1.4925373                                  |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
 16. |   hhid | rsubhh | r_total~d | r_fin_2~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 053102 |      0 | 1.4923547 |         . | 1.0519878 |          . | .48114169 |
     |------------------------------------------------------------------------------|
     |                                  r_res_20~d                                  |
     |                                  -.04077472                                  |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
 17. |   hhid | rsubhh | r_total~d | r_fin_2~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 500371 |      1 |    1.4878 |     .0003 |         . |       .175 |         . |
     |------------------------------------------------------------------------------|
     |                                  r_res_20~d                                  |
     |                                      1.3125                                  |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
 18. |   hhid | rsubhh | r_total~d | r_fin_2~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 021583 |      0 | 1.4843305 |         . |         . |          . |         . |
     |------------------------------------------------------------------------------|
     |                                  r_res_20~d                                  |
     |                                   1.4843305                                  |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
 19. |   hhid | rsubhh | r_total~d | r_fin_2~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 546314 |      1 | 1.4831461 |         . |         . |          . |         . |
     |------------------------------------------------------------------------------|
     |                                  r_res_20~d                                  |
     |                                   1.4831461                                  |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
 20. |   hhid | rsubhh | r_total~d | r_fin_2~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 501077 |      0 | 1.4807502 |         . |         . |          . |         . |
     |------------------------------------------------------------------------------|
     |                                  r_res_20~d                                  |
     |                                   1.4807502                                  |
     +------------------------------------------------------------------------------+

. 
. di as txt "Top 20 positive final trimmed total returns:"
Top 20 positive final trimmed total returns:

. gsort -r_total_2022_final_trim

. list hhid rsubhh r_total_2022_final_trim r_fin_2022_trim r_bus_2022_trim r_ira_2022_trim r_r
> e_2022_trimmed r_res_2022_trimmed in 1/20 if !missing(r_total_2022_final_trim)

     +-------------------------------------------------------------------------------+
  1. |   hhid | rsubhh | r_total~m | r_fin_20~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 501494 |      0 | .94566243 |  .00010889 |         . |  .04537205 |         . |
     |-------------------------------------------------------------------------------|
     |                                   r_res_2~d                                   |
     |                                   .90018149                                   |
     +-------------------------------------------------------------------------------+

     +-------------------------------------------------------------------------------+
  2. |   hhid | rsubhh | r_total~m | r_fin_20~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 178865 |      0 | .94444444 |          . |         . |          . | .94444444 |
     |-------------------------------------------------------------------------------|
     |                                   r_res_2~d                                   |
     |                                           0                                   |
     +-------------------------------------------------------------------------------+

     +-------------------------------------------------------------------------------+
  3. |   hhid | rsubhh | r_total~m | r_fin_20~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 527705 |      0 |  .9437014 | -.01244168 | .02612753 | -.05132193 | .52255054 |
     |-------------------------------------------------------------------------------|
     |                                   r_res_2~d                                   |
     |                                   .45878694                                   |
     +-------------------------------------------------------------------------------+

     +-------------------------------------------------------------------------------+
  4. |   hhid | rsubhh | r_total~m | r_fin_20~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 021015 |      0 | .94339623 |          . |         . |          . |         . |
     |-------------------------------------------------------------------------------|
     |                                   r_res_2~d                                   |
     |                                   .94339623                                   |
     +-------------------------------------------------------------------------------+

     +-------------------------------------------------------------------------------+
  5. |   hhid | rsubhh | r_total~m | r_fin_20~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 522080 |      0 | .93830508 |          . |         . |  .09830508 | .67728814 |
     |-------------------------------------------------------------------------------|
     |                                   r_res_2~d                                   |
     |                                   .16271186                                   |
     +-------------------------------------------------------------------------------+

     +-------------------------------------------------------------------------------+
  6. |   hhid | rsubhh | r_total~m | r_fin_20~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 500681 |      0 | .93676563 |          . |         . | -.01399229 |         . |
     |-------------------------------------------------------------------------------|
     |                                   r_res_2~d                                   |
     |                                   .95075792                                   |
     +-------------------------------------------------------------------------------+

     +-------------------------------------------------------------------------------+
  7. |   hhid | rsubhh | r_total~m | r_fin_20~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 523173 |      0 | .93617021 |          . |         . |          . |         . |
     |-------------------------------------------------------------------------------|
     |                                   r_res_2~d                                   |
     |                                   .93617021                                   |
     +-------------------------------------------------------------------------------+

     +-------------------------------------------------------------------------------+
  8. |   hhid | rsubhh | r_total~m | r_fin_20~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 904733 |      0 | .93512727 |  .00006234 |         . |          . |         . |
     |-------------------------------------------------------------------------------|
     |                                   r_res_2~d                                   |
     |                                   .93506494                                   |
     +-------------------------------------------------------------------------------+

     +-------------------------------------------------------------------------------+
  9. |   hhid | rsubhh | r_total~m | r_fin_20~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 542008 |      0 | .93232054 |  .02803963 |         . |  -.0747565 |         . |
     |-------------------------------------------------------------------------------|
     |                                   r_res_2~d                                   |
     |                                   .97903741                                   |
     +-------------------------------------------------------------------------------+

     +-------------------------------------------------------------------------------+
 10. |   hhid | rsubhh | r_total~m | r_fin_20~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 542504 |      0 | .93023256 |          0 |         . |          . |         . |
     |-------------------------------------------------------------------------------|
     |                                   r_res_2~d                                   |
     |                                   .93023256                                   |
     +-------------------------------------------------------------------------------+

     +-------------------------------------------------------------------------------+
 11. |   hhid | rsubhh | r_total~m | r_fin_20~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 013816 |      0 | .92879257 | -.00412797 |         . |  .00412797 |         . |
     |-------------------------------------------------------------------------------|
     |                                   r_res_2~d                                   |
     |                                   .92879257                                   |
     +-------------------------------------------------------------------------------+

     +-------------------------------------------------------------------------------+
 12. |   hhid | rsubhh | r_total~m | r_fin_20~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 908282 |      0 | .92307692 |          . |         . |          . |         . |
     |-------------------------------------------------------------------------------|
     |                                   r_res_2~d                                   |
     |                                   .92307692                                   |
     +-------------------------------------------------------------------------------+

     +-------------------------------------------------------------------------------+
 13. |   hhid | rsubhh | r_total~m | r_fin_20~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 545277 |      0 | .92307692 |          . |         . |          . |         . |
     |-------------------------------------------------------------------------------|
     |                                   r_res_2~d                                   |
     |                                   .92307692                                   |
     +-------------------------------------------------------------------------------+

     +-------------------------------------------------------------------------------+
 14. |   hhid | rsubhh | r_total~m | r_fin_20~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 533317 |      0 | .92307692 |          . | .46153846 |          . |         . |
     |-------------------------------------------------------------------------------|
     |                                   r_res_2~d                                   |
     |                                   .46153846                                   |
     +-------------------------------------------------------------------------------+

     +-------------------------------------------------------------------------------+
 15. |   hhid | rsubhh | r_total~m | r_fin_20~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 502698 |      0 |  .9212963 |          . |         . |  .08796296 |         . |
     |-------------------------------------------------------------------------------|
     |                                   r_res_2~d                                   |
     |                                   .83333333                                   |
     +-------------------------------------------------------------------------------+

     +-------------------------------------------------------------------------------+
 16. |   hhid | rsubhh | r_total~m | r_fin_20~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 544997 |      0 | .91743119 |          . |         . |          . |         . |
     |-------------------------------------------------------------------------------|
     |                                   r_res_2~d                                   |
     |                                   .91743119                                   |
     +-------------------------------------------------------------------------------+

     +-------------------------------------------------------------------------------+
 17. |   hhid | rsubhh | r_total~m | r_fin_20~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 546030 |      0 | .91742257 |  .08742566 | .63488692 |  .03523392 |         . |
     |-------------------------------------------------------------------------------|
     |                                   r_res_2~d                                   |
     |                                   .15987607                                   |
     +-------------------------------------------------------------------------------+

     +-------------------------------------------------------------------------------+
 18. |   hhid | rsubhh | r_total~m | r_fin_20~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 917770 |      0 | .91340451 |  .05931198 |         . |          . |         . |
     |-------------------------------------------------------------------------------|
     |                                   r_res_2~d                                   |
     |                                   .85409253                                   |
     +-------------------------------------------------------------------------------+

     +-------------------------------------------------------------------------------+
 19. |   hhid | rsubhh | r_total~m | r_fin_20~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 177473 |      0 | .91019905 |  .00008863 |         . | -.12390118 |         . |
     |-------------------------------------------------------------------------------|
     |                                   r_res_2~d                                   |
     |                                   1.0340116                                   |
     +-------------------------------------------------------------------------------+

     +-------------------------------------------------------------------------------+
 20. |   hhid | rsubhh | r_total~m | r_fin_20~m | r_bus_2~m | r_ira_20~m | r_re_20~d |
     | 186895 |      0 | .90909091 |          . |         . |          . |         . |
     |-------------------------------------------------------------------------------|
     |                                   r_res_2~d                                   |
     |                                   .90909091                                   |
     +-------------------------------------------------------------------------------+

. 
. * ---------------------------------------------------------------------
. * Step 10: Save results
. * ---------------------------------------------------------------------
. di as txt "=== Saving results ==="
=== Saving results ===

. 
. save "`master'", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/cleaned/hrs_rand_2020_2022_mast
    > er.dta saved

. di as txt "Saved total return variables to master: `master'"
Saved total return variables to master: /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Cod
> e/Data/HRS_RAND/cleaned/hrs_rand_2020_2022_master.dta

. 
. * List of variables created
. di as txt "Variables created:"
Variables created:

. di as txt "  has_any_returns: sample indicator (at least 1 asset class return)"
  has_any_returns: sample indicator (at least 1 asset class return)

. di as txt "  n_asset_returns: number of asset classes with returns"
  n_asset_returns: number of asset classes with returns

. di as txt "  r_total_2022: raw total returns (sum of raw asset class returns)"
  r_total_2022: raw total returns (sum of raw asset class returns)

. di as txt "  r_total_2022_trimmed: trimmed total returns (sum of trimmed asset class returns
> )"
  r_total_2022_trimmed: trimmed total returns (sum of trimmed asset class returns)

. di as txt "  r_total_2022_final_trim: final trimmed total returns (additional 5% trimming ap
> plied to sum of trimmed returns)"
  r_total_2022_final_trim: final trimmed total returns (additional 5% trimming applied to sum 
> of trimmed returns)

. 
. di as txt ""


. di as txt "Total returns computation completed successfully!"
Total returns computation completed successfully!

. 
. log close
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/cleaned/com
> pute_total_returns_2022.log
  log type:  text
 closed on:  24 Sep 2025, 19:40:04
----------------------------------------------------------------------------------------------
