--------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/randhrs19
> 92_2022v1_STATA/prep_controls_income_2020.log
  log type:  text
 opened on:   7 Oct 2025, 13:55:32

. 
. set more off

. 
. * ---------------------------------------------------------------------
. * File paths
. * ---------------------------------------------------------------------
. local inout "/Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/randhrs
> 1992_2022v1_STATA/_randhrs1992_2022v1_analysis.dta"

. local fallback "/Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/rand
> hrs1992_2022v1_STATA/_randhrs1992_2022v1_with_flows.dta"

. 
. * ---------------------------------------------------------------------
. * Load unified dataset (fallback to flows file if needed)
. * ---------------------------------------------------------------------
. capture confirm file "`inout'"

. if _rc {
.     di as txt "Analysis dataset not found; falling back to flows dataset and will write un
> ified file."
.     capture confirm file "`fallback'"
.     if _rc {
.         di as error "ERROR: Neither analysis nor flows dataset found. Run long_merge_in.do
>  first."
.         exit 198
.     }
.     use "`fallback'", clear
. }

. else {
.     use "`inout'", clear
. }

. 
. quietly describe

. di as txt "Observations: " %9.0f r(N)
Observations:     15856

. di as txt "Variables:    " %9.0f r(k)
Variables:        19943

. 
. * ---------------------------------------------------------------------
. * Marital status: married vs not married
. * ---------------------------------------------------------------------
. di as txt "=== Constructing marital status dummy from r15mstat ==="
=== Constructing marital status dummy from r15mstat ===

. capture confirm variable r15mstat

. if _rc {
.     di as error "ERROR: r15mstat not found"
.     exit 198
. }

. 
. capture drop married_2022

. gen byte married_2022 = .
(15,856 missing values generated)

. replace married_2022 = 1 if inlist(r15mstat, 1, 2)
(6,768 real changes made)

. replace married_2022 = 0 if inlist(r15mstat, 3, 4, 5, 6, 7, 8)
(5,374 real changes made)

. label define yesno 0 "not married" 1 "married", replace

. label values married_2022 yesno

. label var married_2022 "Married (r15mstat: 1 or 2) vs not married (3-8)"

. 
. di as txt "Marital status (r15mstat) distribution:"
Marital status (r15mstat) distribution:

. tab r15mstat, missing

   r15mstat:w15 r marital |
                   status |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
                1.married |      6,671       42.07       42.07
  2.married,spouse absent |         97        0.61       42.68
              3.partnered |        754        4.76       47.44
              4.separated |        263        1.66       49.10
               5.divorced |      1,648       10.39       59.49
                7.widowed |      1,908       12.03       71.52
          8.never married |        801        5.05       76.58
                        . |      3,688       23.26       99.84
.j=web interview, missing |          8        0.05       99.89
               .m=missing |         18        0.11      100.00
--------------------------+-----------------------------------
                    Total |     15,856      100.00

. 
. di as txt "Married_2022 dummy summary:"
Married_2022 dummy summary:

. tab married_2022, missing

    Married |
 (r15mstat: |
 1 or 2) vs |
not married |
      (3-8) |      Freq.     Percent        Cum.
------------+-----------------------------------
not married |      5,374       33.89       33.89
    married |      6,768       42.68       76.58
          . |      3,714       23.42      100.00
------------+-----------------------------------
      Total |     15,856      100.00

. 
. * ---------------------------------------------------------------------
. * Immigration status: born in US dummy from rabplace only
. * ---------------------------------------------------------------------
. di as txt "=== Constructing born-in-US dummy from rabplace ==="
=== Constructing born-in-US dummy from rabplace ===

. capture confirm variable rabplace

. if _rc {
.     di as error "ERROR: rabplace not found"
.     exit 198
. }

. 
. * Ensure we have a numeric version to compare against codes 1..13
. capture drop rabplace_num

. capture confirm numeric variable rabplace

. if _rc {
.     quietly destring rabplace, generate(rabplace_num) force
. } 

. else {
.     generate double rabplace_num = rabplace
(481 missing values generated)
. }

. 
. capture drop born_us_2022

. gen byte born_us_2022 = .
(15,856 missing values generated)

. * 1-10 are US Census divisions; 12=US territory => treat as US-born
. replace born_us_2022 = 1 if inrange(rabplace_num,1,10) | rabplace_num == 12
(12,453 real changes made)

. * 11=Not US or US territory; 13=Not US => not US-born
. replace born_us_2022 = 0 if inlist(rabplace_num,11,13)
(2,922 real changes made)

. label values born_us_2022 yesno

. label var born_us_2022 "Born in US (1) vs not US (0)"

. 
. di as txt "Immigration raw distribution (rabplace or numeric copy):"
Immigration raw distribution (rabplace or numeric copy):

. tab rabplace_num, missing

rabplace_nu |
          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        519        3.27        3.27
          2 |      1,782       11.24       14.51
          3 |      2,325       14.66       29.18
          4 |      1,009        6.36       35.54
          5 |      2,054       12.95       48.49
          6 |      1,108        6.99       55.48
          7 |      1,309        8.26       63.74
          8 |        530        3.34       67.08
          9 |      1,194        7.53       74.61
         10 |        581        3.66       78.27
         11 |        675        4.26       82.53
         12 |         42        0.26       82.80
         13 |      2,247       14.17       96.97
         .m |        481        3.03      100.00
------------+-----------------------------------
      Total |     15,856      100.00

. quietly count if !missing(born_us_2022)

. di as txt "Non-missing born_us_2022 count: " r(N)
Non-missing born_us_2022 count: 15375

. di as txt "Born-in-US dummy summary:"
Born-in-US dummy summary:

. tab born_us_2022, missing

 Born in US |
 (1) vs not |
     US (0) |      Freq.     Percent        Cum.
------------+-----------------------------------
not married |      2,922       18.43       18.43
    married |     12,453       78.54       96.97
          . |        481        3.03      100.00
------------+-----------------------------------
      Total |     15,856      100.00

. 
. * ---------------------------------------------------------------------
. * Respondent income aggregates (2020)
. * ---------------------------------------------------------------------
. di as txt "=== Constructing respondent income aggregates for 2020 ==="
=== Constructing respondent income aggregates for 2020 ===

. 
. * Labor income components
. local lab_vars "r15iearn r15ipena r15issdi r15isret r15iunwc r15igxfr"

. 
. * Check presence
. foreach v of local lab_vars {
  2.     capture confirm variable `v'
  3.     if _rc {
  4.         di as txt "  WARNING: `v' not found"
  5.     }
  6. }

. 
. * Sum with rule: missing only if all components missing
. capture drop resp_lab_inc_2022

. egen double resp_lab_inc_2022 = rowtotal(`lab_vars')

. replace resp_lab_inc_2022 = . if missing(r15iearn) & missing(r15ipena) & missing(r15issdi)
>  & missing(r15isret) & missing(r15iunwc) & missing(r15igxfr)
(3,688 real changes made, 3,688 to missing)

. label var resp_lab_inc_2022 "Respondent labor income (sum of 6 components; missing if all 
> missing)"

. 
. di as txt "resp_lab_inc_2022 summary:"
resp_lab_inc_2022 summary:

. summarize resp_lab_inc_2022, detail

        Respondent labor income (sum of 6 components;
                   missing if all missing)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%         1752              0       Obs              12,168
25%        11148              0       Sum of wgt.      12,168

50%        22000                      Mean           36374.04
                        Largest       Std. dev.      55980.01
75%        45190         905880
90%        80580         925000       Variance       3.13e+09
95%       112000        1010000       Skewness       18.02706
99%       211000        3150400       Kurtosis       829.0084

. 
. * Total income = labor income + household capital income + other household income
. local tot_add "h15icap h15iothr"

. foreach v of local tot_add {
  2.     capture confirm variable `v'
  3.     if _rc {
  4.         di as txt "  WARNING: `v' not found"
  5.     }
  6. }

. 
. capture drop resp_tot_inc_2022

. gen double resp_tot_inc_2022 = resp_lab_inc_2022 ///
>     + cond(missing(h15icap), 0, h15icap) ///
>     + cond(missing(h15iothr), 0, h15iothr)
(3,688 missing values generated)

. * If labor income is missing AND both additions are missing, set total to missing as well
. replace resp_tot_inc_2022 = . if missing(resp_lab_inc_2022) & missing(h15icap) & missing(h
> 15iothr)
(0 real changes made)

. label var resp_tot_inc_2022 "Respondent total income (labor + hwicap + hwiother; missing i
> f all missing)"

. 
. di as txt "resp_tot_inc_2022 summary:"
resp_tot_inc_2022 summary:

. summarize resp_tot_inc_2022, detail

          Respondent total income (labor + hwicap +
              hwiother; missing if all missing)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%          960              0
10%         6312              0       Obs              12,168
25%        13968              0       Sum of wgt.      12,168

50%        28870                      Mean           54161.62
                        Largest       Std. dev.      107148.6
75%        60634        2445000
90%       116600        2581200       Variance       1.15e+10
95%     174889.2        3271600       Skewness       19.58575
99%     405646.2        5731600       Kurtosis       789.5889

. 
. * ---------------------------------------------------------------------
. * Wealth percentile (0-100) and wealth deciles (1-10) using 2020 net worth (h15atotb)
. * ---------------------------------------------------------------------
. di as txt "=== Constructing wealth percentile and deciles from h15atotb (A_2020) ==="
=== Constructing wealth percentile and deciles from h15atotb (A_2020) ===

. capture confirm variable h15atotb

. if _rc {
.     di as error "ERROR: h15atotb (A_2020) not found"
.     exit 198
. }

. 
. * Wealth percentile (continuous 0-100 across non-missing)
. capture drop wealth_rank_2020 wealth_pct_2020

. quietly count if !missing(h15atotb)

. local N_wealth = r(N)

. egen double wealth_rank_2020 = rank(h15atotb) if !missing(h15atotb)
(3,688 missing values generated)

. gen double wealth_pct_2020 = .
(15,856 missing values generated)

. replace wealth_pct_2020 = 100 * (wealth_rank_2020 - 1) / (`N_wealth' - 1) if `N_wealth' > 
> 1 & !missing(wealth_rank_2020)
(12,168 real changes made)

. replace wealth_pct_2020 = 50 if `N_wealth' == 1 & !missing(wealth_rank_2020)
(0 real changes made)

. label variable wealth_pct_2020 "Wealth percentile (based on h15atotb)"

. 
. di as txt "Wealth percentile diagnostics:"
Wealth percentile diagnostics:

. quietly count if !missing(wealth_pct_2020)

. di as txt "  Non-missing wealth_pct_2020: " r(N)
  Non-missing wealth_pct_2020: 12168

. tabstat wealth_pct_2020, stats(n mean sd p50 min max) format(%12.4f)

    Variable |            N         Mean           SD          p50          Min          Max
-------------+------------------------------------------------------------------------------
wealth_pct~0 |   12168.0000      50.0000      28.8670      49.9918       0.0000      99.9959
--------------------------------------------------------------------------------------------

. di as txt "[summarize] wealth_pct_2020"
[summarize] wealth_pct_2020

. capture noisily summarize wealth_pct_2020, detail

            Wealth percentile (based on h15atotb)
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .9903838              0
 5%     4.993014        .008219
10%     8.987425       .0164379       Obs              12,168
25%     24.99795       .0246569       Sum of wgt.      12,168

50%     49.99178                      Mean                 50
                        Largest       Std. dev.      28.86701
75%     75.00205       99.97945
90%     90.00575       99.97945       Variance        833.304
95%     95.00699       99.99589       Skewness       .0011976
99%     99.00551       99.99589       Kurtosis       1.797611

. 
. * Wealth deciles (1-10) across non-missing h15atotb
. capture drop wealth_decile_2020

. xtile wealth_decile_2020 = h15atotb if !missing(h15atotb), n(10)

. label var wealth_decile_2020 "Wealth decile (1=lowest,10=highest)"

. di as txt "Wealth decile distribution:"
Wealth decile distribution:

. tab wealth_decile_2020, missing

     Wealth |
     decile |
(1=lowest,1 |
 0=highest) |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,492        9.41        9.41
          2 |        943        5.95       15.36
          3 |      1,246        7.86       23.22
          4 |      1,192        7.52       30.73
          5 |      1,215        7.66       38.40
          6 |      1,214        7.66       46.05
          7 |      1,221        7.70       53.75
          8 |      1,213        7.65       61.40
          9 |      1,216        7.67       69.07
         10 |      1,216        7.67       76.74
          . |      3,688       23.26      100.00
------------+-----------------------------------
      Total |     15,856      100.00

. 
. * Create decile dummies wealth_d1-wealth_d10
. forvalues d = 1/10 {
  2.     capture drop wealth_d`d'_2020
  3.     gen byte wealth_d`d'_2020 = wealth_decile_2020 == `d' if !missing(wealth_decile_202
> 0)
  4.     label values wealth_d`d'_2020 yesno
  5.     label var wealth_d`d'_2020 "Wealth decile `d'"
  6. }
(3,688 missing values generated)
(3,688 missing values generated)
(3,688 missing values generated)
(3,688 missing values generated)
(3,688 missing values generated)
(3,688 missing values generated)
(3,688 missing values generated)
(3,688 missing values generated)
(3,688 missing values generated)
(3,688 missing values generated)

. 
. * ---------------------------------------------------------------------
. * Save back to unified analysis dataset
. * ---------------------------------------------------------------------
. di as txt "=== Saving unified analysis dataset (includes flows, trust, controls, income) =
> =="
=== Saving unified analysis dataset (includes flows, trust, controls, income) ===

. save "`inout'", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/randhrs1992_2022v1_STATA/_ran
    > dhrs1992_2022v1_analysis.dta saved

. di as txt "Saved unified dataset: `inout'"
Saved unified dataset: /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long
> /randhrs1992_2022v1_STATA/_randhrs1992_2022v1_analysis.dta

. 
. log close
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/randhrs19
> 92_2022v1_STATA/prep_controls_income_2020.log
  log type:  text
 closed on:   7 Oct 2025, 13:55:33
--------------------------------------------------------------------------------------------
