--------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/randhrs19
> 92_2022v1_STATA/RAND_2014_merge_and_returns.log
  log type:  text
 opened on:   8 Oct 2025, 10:37:27

. 
. set more off

. 
. * ---------------------------------------------------------------------
. * File paths
. * ---------------------------------------------------------------------
. local long_file "/Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/ran
> dhrs1992_2022v1_STATA/_randhrs1992_2022v1_analysis.dta"

. local raw_2014  "/Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/_ra
> w/2014/h14f2b_STATA/h14f2b.dta"

. local out_ana   "/Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/ran
> dhrs1992_2022v1_STATA/_randhrs1992_2022v1_analysis.dta"

. 
. * ---------------------------------------------------------------------
. * Load unified dataset and check key
. * ---------------------------------------------------------------------
. di as txt "=== Loading unified analysis dataset ==="
=== Loading unified analysis dataset ===

. capture confirm file "`long_file'"

. if _rc {
.     di as error "ERROR: unified analysis dataset not found -> `long_file'"
.     exit 198
. }

. use "`long_file'", clear

. capture confirm variable hhidpn

. if _rc {
.     di as error "ERROR: hhidpn not found in unified dataset"
.     exit 198
. }

. 
. * ---------------------------------------------------------------------
. * Load 2014 RAND fat file and extract flows
. * ---------------------------------------------------------------------
. di as txt "=== Loading 2014 RAND fat file ==="
=== Loading 2014 RAND fat file ===

. preserve

. capture confirm file "`raw_2014'"

. if _rc {
.     di as error "ERROR: RAW 2014 file not found -> `raw_2014'"
.     exit 198
. }

. use "`raw_2014'", clear

. capture confirm variable hhidpn

. if _rc {
.     di as error "ERROR: hhidpn not found in RAW 2014"
.     exit 198
. }

. 
. * 2014 flow variables per notes
. local flow14 "or050 or055 or063 or064 or072 or030 or035 or045 oq171_1 oq171_2 oq171_3 or00
> 7 or013 or024"

. 
. di as txt "Checking presence of 2014 flow variables..."
Checking presence of 2014 flow variables...

. foreach v of local flow14 {
  2.     capture confirm variable `v'
  3.     if _rc di as warn "  MISSING in 2014 RAW: `v'"
  4.     else  di as txt  "  OK in 2014 RAW: `v'"
  5. }
  OK in 2014 RAW: or050
  OK in 2014 RAW: or055
  OK in 2014 RAW: or063
  OK in 2014 RAW: or064
  OK in 2014 RAW: or072
  OK in 2014 RAW: or030
  OK in 2014 RAW: or035
  OK in 2014 RAW: or045
  OK in 2014 RAW: oq171_1
  OK in 2014 RAW: oq171_2
  OK in 2014 RAW: oq171_3
  OK in 2014 RAW: or007
  OK in 2014 RAW: or013
  OK in 2014 RAW: or024

. 
. keep hhidpn `flow14'

. tempfile raw14_flows

. save "`raw14_flows'", replace
(file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_97518.000003 not found)
file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_97518.000003 saved as .dta format

. restore

. 
. * ---------------------------------------------------------------------
. * Merge flows into unified dataset
. * ---------------------------------------------------------------------
. di as txt "=== Merging 2014 flows into unified dataset ==="
=== Merging 2014 flows into unified dataset ===

. merge 1:1 hhidpn using "`raw14_flows'", keep(master match)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         6,018
        from master                     6,018  (_merge==1)
        from using                          0  (_merge==2)

    Matched                             9,838  (_merge==3)
    -----------------------------------------

. tab _merge

   Matching result from |
                  merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
        Master only (1) |      6,018       37.95       37.95
            Matched (3) |      9,838       62.05      100.00
------------------------+-----------------------------------
                  Total |     15,856      100.00

. drop _merge

. 
. * ---------------------------------------------------------------------
. * Clean special/miscodes for flow inputs (mirror prior rules)
. * ---------------------------------------------------------------------
. local misscodes 999998 999999 9999999 9999998 99999998 99999999 999999999 999999998 999999
> 9999 9999999998 -8 -9

. foreach v of local flow14 {
  2.     capture confirm numeric variable `v'
  3.     if !_rc {
  4.         foreach mc of local misscodes {
  5.             quietly replace `v' = . if `v' == `mc'
  6.         }
  7.     }
  8. }

. 
. * ---------------------------------------------------------------------
. * Compute 2014 flow aggregates (suffix _2014)
. * ---------------------------------------------------------------------
. * or063 direction and magnitude
. capture drop or063_dir14

. gen byte or063_dir14 = .
(15,856 missing values generated)

. replace or063_dir14 = -1 if or063 == 1
(123 real changes made)

. replace or063_dir14 =  1 if or063 == 2
(104 real changes made)

. replace or063_dir14 =  0 if or063 == 3
(179 real changes made)

. 
. capture drop flow_bus_2014

. gen double flow_bus_2014 = .
(15,856 missing values generated)

. replace flow_bus_2014 = or055 - or050 if !missing(or055) & !missing(or050)
(5 real changes made)

. replace flow_bus_2014 = or055 if  missing(or050) & !missing(or055)
(24 real changes made)

. replace flow_bus_2014 = -or050 if !missing(or050) &  missing(or055)
(167 real changes made)

. 
. capture drop flow_stk_private_2014

. gen double flow_stk_private_2014 = or063_dir14 * or064 if !missing(or063_dir14) & !missing
> (or064)
(15,681 missing values generated)

. 
. capture drop flow_stk_public_2014

. gen double flow_stk_public_2014 = or072 if !missing(or072)
(14,112 missing values generated)

. 
. capture drop flow_stk_2014

. gen double flow_stk_2014 = cond(!missing(flow_stk_private_2014), flow_stk_private_2014, 0)
>  + ///
>                            cond(!missing(flow_stk_public_2014),  flow_stk_public_2014,  0)

. replace flow_stk_2014 = . if missing(flow_stk_private_2014) & missing(flow_stk_public_2014
> )
(13,937 real changes made, 13,937 to missing)

. 
. capture drop flow_re_2014

. gen double flow_re_2014 = .
(15,856 missing values generated)

. replace flow_re_2014 = cond(missing(or035),0,or035) - ( cond(missing(or030),0,or030) + con
> d(missing(or045),0,or045) ) if !missing(or035) | !missing(or030) | !missing(or045)
(346 real changes made)

. 
. capture drop flow_ira_2014

. egen double flow_ira_2014 = rowtotal(oq171_1 oq171_2 oq171_3)

. replace flow_ira_2014 = . if missing(oq171_1) & missing(oq171_2) & missing(oq171_3)
(14,333 real changes made, 14,333 to missing)

. 
. capture drop flow_residences_2014

. gen double flow_residences_2014 = .
(15,856 missing values generated)

. replace flow_residences_2014 = cond(missing(or013),0,or013) - ( cond(missing(or007),0,or00
> 7) + cond(missing(or024),0,or024) ) if !missing(or013) | !missing(or007) | !missing(or024)
(1,817 real changes made)

. replace flow_residences_2014 = . if missing(or013) & missing(or007) & missing(or024)
(0 real changes made)

. 
. capture drop flow_total_2014

. gen double flow_total_2014 = .
(15,856 missing values generated)

. egen byte any_flow_present14 = rownonmiss(flow_bus_2014 flow_re_2014 flow_stk_2014 flow_ir
> a_2014 flow_residences_2014)

. replace flow_total_2014 = cond(missing(flow_bus_2014),0,flow_bus_2014) + ///
>                           cond(missing(flow_re_2014),0,flow_re_2014) + ///
>                           cond(missing(flow_stk_2014),0,flow_stk_2014) + ///
>                           cond(missing(flow_ira_2014),0,flow_ira_2014) + ///
>                           cond(missing(flow_residences_2014),0,flow_residences_2014) ///
>                           if any_flow_present14 > 0
(4,125 real changes made)

. drop any_flow_present14

. 
. di as txt "Flows 2014 summaries:"
Flows 2014 summaries:

. summarize flow_bus_2014 flow_re_2014 flow_stk_2014 flow_ira_2014 flow_residences_2014 flow
> _total_2014

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
flow_bu~2014 |        196   -3093.179    415026.4   -1500000    5000000
flow_re_2014 |        346   -7238.786    472154.1   -1280000    8000000
flow_stk_2~4 |      1,919   -1554.462    49769.24   -1000000     800000
flow_ir~2014 |      1,523    19825.64    28589.35          0     222000
flow_resid~4 |      1,817   -12382.51      144946   -1475000    1340000
-------------+---------------------------------------------------------
flow_to~2014 |      4,125    388.2482    194918.2   -1438000    8000005

. 
. * ---------------------------------------------------------------------
. * Compute TOTAL RETURNS for 2014 (period 2012-2014)
. * ---------------------------------------------------------------------
. di as txt "=== Computing 2014 returns (2012-2014) ==="
=== Computing 2014 returns (2012-2014) ===

. 
. * Denominator base: A_{2012}
. capture drop a_2012

. gen double a_2012 = h11atotb
(6,083 missing values generated)

. label var a_2012 "Total net assets (A_2012 = h11atotb)"

. 
. * Capital income y^c_2014
. capture drop y_c_2014

. gen double y_c_2014 = h12icap
(6,018 missing values generated)

. label var y_c_2014 "Capital income 2014 (h12icap)"

. 
. * Capital gains per class: cg_class = V_2014 - V_2012
. capture drop cg_pri_res_2014 cg_sec_res_2014 cg_re_2014 cg_bus_2014 cg_ira_2014 cg_stk_201
> 4 cg_bond_2014 cg_chck_2014 cg_cd_2014 cg_veh_2014 cg_oth_2014

. gen double cg_pri_res_2014 = h12atoth - h11atoth
(6,269 missing values generated)

. 
. gen double cg_sec_res_2014 = h12anethb - h11anethb
(6,269 missing values generated)

. 
. gen double cg_re_2014      = h12arles - h11arles
(6,269 missing values generated)

. 
. gen double cg_bus_2014     = h12absns - h11absns
(6,269 missing values generated)

. 
. gen double cg_ira_2014     = h12aira  - h11aira
(6,269 missing values generated)

. 
. gen double cg_stk_2014     = h12astck - h11astck
(6,269 missing values generated)

. 
. gen double cg_bond_2014    = h12abond - h11abond
(6,269 missing values generated)

. 
. gen double cg_chck_2014    = h12achck - h11achck
(6,269 missing values generated)

. 
. gen double cg_cd_2014      = h12acd   - h11acd
(6,269 missing values generated)

. 
. gen double cg_veh_2014     = h12atran - h11atran
(6,269 missing values generated)

. 
. gen double cg_oth_2014     = h12aothr - h11aothr
(6,269 missing values generated)

. 
. * Summaries of each capital gains component
. di as txt "Capital gains components (2012->2014) summaries:"
Capital gains components (2012->2014) summaries:

. summarize cg_pri_res_2014 cg_sec_res_2014 cg_re_2014 cg_bus_2014 cg_ira_2014 cg_stk_2014 c
> g_bond_2014 cg_chck_2014 cg_cd_2014 cg_veh_2014 cg_oth_2014

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
cg_pri_~2014 |      9,587    13585.74    105800.7   -2005000    1595000
cg_sec_~2014 |      9,587    2751.778    120860.1   -1853908    6530000
  cg_re_2014 |      9,587    4946.289    203675.1   -7000000    7500000
 cg_bus_2014 |      9,587     2838.54    224319.7  -1.00e+07    5000000
 cg_ira_2014 |      9,587    13516.63    144249.4   -1980000    2555729
-------------+---------------------------------------------------------
 cg_stk_2014 |      9,587    10884.19    254699.6  -1.00e+07    3000000
cg_bond_2014 |      9,587   -939.6229    77621.73   -2000000    2500000
cg_chck_2014 |      9,587    3017.453    146267.2   -7476000    4950000
  cg_cd_2014 |      9,587   -7.602461    41564.35   -1000000    1000000
 cg_veh_2014 |      9,587    212.2406    21365.36    -750000     302000
-------------+---------------------------------------------------------
 cg_oth_2014 |      9,587    1539.065    90520.85   -3529113    1975000

. 
. * Total capital gains with missing logic
. capture drop cg_total_2014

. egen byte any_cg_2014 = rownonmiss(cg_pri_res_2014 cg_sec_res_2014 cg_re_2014 cg_bus_2014 
> cg_ira_2014 cg_stk_2014 cg_bond_2014 cg_chck_2014 cg_cd_2014 cg_veh_2014 cg_oth_2014)

. 
. 
. gen double cg_total_2014 = .
(15,856 missing values generated)

. replace cg_total_2014 = cond(missing(cg_pri_res_2014),0,cg_pri_res_2014) + ///
>                         cond(missing(cg_sec_res_2014),0,cg_sec_res_2014) + ///
>                         cond(missing(cg_re_2014),0,cg_re_2014) + ///
>                         cond(missing(cg_bus_2014),0,cg_bus_2014) + ///
>                         cond(missing(cg_ira_2014),0,cg_ira_2014) + ///
>                         cond(missing(cg_stk_2014),0,cg_stk_2014) + ///
>                         cond(missing(cg_bond_2014),0,cg_bond_2014) + ///
>                         cond(missing(cg_chck_2014),0,cg_chck_2014) + ///
>                         cond(missing(cg_cd_2014),0,cg_cd_2014) + ///
>                         cond(missing(cg_veh_2014),0,cg_veh_2014) + ///
>                         cond(missing(cg_oth_2014),0,cg_oth_2014) if any_cg_2014>0
(9,587 real changes made)

. 
. drop any_cg_2014

. 
. * Diagnostics
. di as txt "[summarize] y_c_2014, cg_total_2014, flow_total_2014"
[summarize] y_c_2014, cg_total_2014, flow_total_2014

. summarize y_c_2014 cg_total_2014 flow_total_2014

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    y_c_2014 |      9,838    15376.85    89921.62          0    4052000
cg_tota~2014 |      9,587     52344.7    477933.8  -1.93e+07   1.11e+07
flow_to~2014 |      4,125    388.2482    194918.2   -1438000    8000005

. 
. * Base: A_2012 + 0.5 * F_2014 (treat flows as 0 only when A_2012 is non-missing)
. capture drop base_2014

. gen double base_2014 = .
(15,856 missing values generated)

. replace base_2014 = a_2012 + 0.5 * cond(missing(flow_total_2014),0,flow_total_2014) if !mi
> ssing(a_2012)
(9,773 real changes made)

. label var base_2014 "Base for 2014 returns (A_2012 + 0.5*F_2014)"

. 
. di as txt "[summarize] base_2014"
[summarize] base_2014

. summarize base_2014, detail

         Base for 2014 returns (A_2012 + 0.5*F_2014)
-------------------------------------------------------------
      Percentiles      Smallest
 1%       -99490        -500000
 5%       -14000        -443700
10%            0        -400000       Obs               9,773
25%        17000        -396800       Sum of wgt.       9,773

50%       139000                      Mean           418802.1
                        Largest       Std. dev.      987531.5
75%     450752.5       2.03e+07
90%      1053627       2.20e+07       Variance       9.75e+11
95%      1675588       2.20e+07       Skewness       9.298985
99%      3997799       2.28e+07       Kurtosis       144.4712

. 
. * Period return and annualization (2-year)
. capture drop num_period_2014 r_period_2014 r_annual_2014 r_annual_2014_trim

. gen double num_period_2014 = cond(missing(y_c_2014),0,y_c_2014) + ///
>                              cond(missing(cg_total_2014),0,cg_total_2014) - ///
>                              cond(missing(flow_total_2014),0,flow_total_2014)

. 
. egen byte __num14_has = rownonmiss(y_c_2014 cg_total_2014 flow_total_2014)

. replace num_period_2014 = . if __num14_has == 0
(6,018 real changes made, 6,018 to missing)

. 
. drop __num14_has

. 
. gen double r_period_2014 = num_period_2014 / base_2014
(6,715 missing values generated)

. replace r_period_2014 = . if base_2014 < 10000
(1,650 real changes made, 1,650 to missing)

. 
. gen double r_annual_2014 = (1 + r_period_2014)^(1/2) - 1
(8,501 missing values generated)

. replace r_annual_2014 = . if missing(r_period_2014)
(0 real changes made)

. 
. * Trim 5% tails
. capture drop r_annual_2014_trim

. xtile __p_2014 = r_annual_2014 if !missing(r_annual_2014), n(100)

. 
. gen double r_annual_2014_trim = r_annual_2014
(8,501 missing values generated)

. replace r_annual_2014_trim = . if __p_2014 <= 5 | __p_2014 > 95
(734 real changes made, 734 to missing)

. 
. drop __p_2014

. 
. di as txt "[summarize] r_period_2014, r_annual_2014, r_annual_2014_trim"
[summarize] r_period_2014, r_annual_2014, r_annual_2014_trim

. summarize r_period_2014 r_annual_2014 r_annual_2014_trim

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
r_perio~2014 |      7,491    .4197694    2.689426     -5.074   168.0692
r_annua~2014 |      7,355    .1092985    .4751528         -1   12.00266
r_ann~4_trim |      6,621    .0763884    .2394762  -.4549279   .8168611

. 
. * Excluding residential housing
. capture drop cg_total_2014_excl_res flow_total_2014_excl_res

. 
. gen double flow_total_2014_excl_res = .
(15,856 missing values generated)

. egen byte any_flow14_excl = rownonmiss(flow_bus_2014 flow_re_2014 flow_stk_2014 flow_ira_2
> 014)

. replace flow_total_2014_excl_res = cond(missing(flow_bus_2014),0,flow_bus_2014) + ///
>                                    cond(missing(flow_re_2014),0,flow_re_2014) + ///
>                                    cond(missing(flow_stk_2014),0,flow_stk_2014) + ///
>                                    cond(missing(flow_ira_2014),0,flow_ira_2014) if any_flo
> w14_excl>0
(3,210 real changes made)

. 
. drop any_flow14_excl

. 
. gen double cg_total_2014_excl_res = .
(15,856 missing values generated)

. egen byte any_cg14_excl = rownonmiss(cg_re_2014 cg_bus_2014 cg_ira_2014 cg_stk_2014 cg_bon
> d_2014 cg_chck_2014 cg_cd_2014 cg_veh_2014 cg_oth_2014)

. replace cg_total_2014_excl_res = cond(missing(cg_re_2014),0,cg_re_2014) + ///
>                                  cond(missing(cg_bus_2014),0,cg_bus_2014) + ///
>                                  cond(missing(cg_ira_2014),0,cg_ira_2014) + ///
>                                  cond(missing(cg_stk_2014),0,cg_stk_2014) + ///
>                                  cond(missing(cg_bond_2014),0,cg_bond_2014) + ///
>                                  cond(missing(cg_chck_2014),0,cg_chck_2014) + ///
>                                  cond(missing(cg_cd_2014),0,cg_cd_2014) + ///
>                                  cond(missing(cg_veh_2014),0,cg_veh_2014) + ///
>                                  cond(missing(cg_oth_2014),0,cg_oth_2014) if any_cg14_excl
> >0
(9,587 real changes made)

. 
. drop any_cg14_excl

. 
. 
. di as txt "EXCL-RES: cg_total_2014_excl_res and flow_total_2014_excl_res summaries:"
EXCL-RES: cg_total_2014_excl_res and flow_total_2014_excl_res summaries:

. summarize cg_total_2014_excl_res flow_total_2014_excl_res

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
c~4_excl_res |      9,587    36007.18    466563.1  -1.96e+07   1.09e+07
f~4_excl_res |      3,210     7507.96    190931.6   -1280000    8000005

. 
. * Use SAME base_2014
. capture drop num_period_2014_excl_res r_period_2014_excl_res r_annual_2014_excl_res r_annu
> al_2014_excl_res_trim

. 
. gen double num_period_2014_excl_res = cond(missing(y_c_2014),0,y_c_2014) + ///
>                                       cond(missing(cg_total_2014_excl_res),0,cg_total_2014
> _excl_res) - ///
>                                       cond(missing(flow_total_2014_excl_res),0,flow_total_
> 2014_excl_res)

. 
. egen byte __num14ex_has = rownonmiss(y_c_2014 cg_total_2014_excl_res flow_total_2014_excl_
> res)

. replace num_period_2014_excl_res = . if __num14ex_has == 0
(6,018 real changes made, 6,018 to missing)

. 
. drop __num14ex_has

. 
. gen double r_period_2014_excl_res = num_period_2014_excl_res / base_2014
(6,715 missing values generated)

. replace r_period_2014_excl_res = . if base_2014 < 10000
(1,650 real changes made, 1,650 to missing)

. 
. gen double r_annual_2014_excl_res = (1 + r_period_2014_excl_res)^(1/2) - 1
(8,409 missing values generated)

. replace r_annual_2014_excl_res = . if missing(r_period_2014_excl_res)
(0 real changes made)

. 
. * Trim 5% for excl-res
. xtile __p_ex14 = r_annual_2014_excl_res if !missing(r_annual_2014_excl_res), n(100)

. 
. gen double r_annual_2014_excl_res_trim = r_annual_2014_excl_res
(8,409 missing values generated)

. replace r_annual_2014_excl_res_trim = . if __p_ex14 <= 5 | __p_ex14 > 95
(745 real changes made, 745 to missing)

. 
. drop __p_ex14

. 
. di as txt "[summarize] r_period_2014_excl_res, r_annual_2014_excl_res, r_annual_2014_excl_
> res_trim"
[summarize] r_period_2014_excl_res, r_annual_2014_excl_res, r_annual_2014_excl_res_trim

. summarize r_period_2014_excl_res r_annual_2014_excl_res r_annual_2014_excl_res_trim

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
r_period_2.. |      7,491    .2247686    1.122078  -3.977099   22.40741
r_annual_2.. |      7,447    .0599064    .3322866         -1    3.83812
r_annual_2.. |      6,702    .0382021    .1614678  -.3317241   .5611499

. 
. * ---------------------------------------------------------------------
. * Prepare 2012 controls inline (married_2012, wealth_*_2012, age_2012, inlbrf_2012)
. * ---------------------------------------------------------------------
. di as txt "=== Preparing 2012 controls (inline) ==="
=== Preparing 2012 controls (inline) ===

. 
. * Marital status (2012): r11mstat -> married_2012
. capture confirm variable r11mstat

. if _rc {
.     di as error "ERROR: r11mstat not found"
.     exit 198
. }

. 
. capture drop married_2012

. gen byte married_2012 = .
(15,856 missing values generated)

. replace married_2012 = 1 if inlist(r11mstat, 1, 2)
(6,237 real changes made)

. replace married_2012 = 0 if inlist(r11mstat, 3, 4, 5, 6, 7, 8)
(3,530 real changes made)

. label define yesno 0 "no" 1 "yes", replace

. label values married_2012 yesno

. label var married_2012 "Married (r11mstat: 1 or 2) vs not married (3-8)"

. 
. di as txt "Marital status (2012) summary:"
Marital status (2012) summary:

. tab married_2012, missing

    Married |
 (r11mstat: |
 1 or 2) vs |
not married |
      (3-8) |      Freq.     Percent        Cum.
------------+-----------------------------------
         no |      3,530       22.26       22.26
        yes |      6,237       39.34       61.60
          . |      6,089       38.40      100.00
------------+-----------------------------------
      Total |     15,856      100.00

. 
. * Wealth percentile/deciles for 2012 using h11atotb
. capture confirm variable h11atotb

. if _rc {
.     di as error "ERROR: h11atotb not found"
.     exit 198
. }

. 
. capture drop wealth_rank_2012 wealth_pct_2012

. quietly count if !missing(h11atotb)

. local N_wealth12 = r(N)

. 
. 
. egen double wealth_rank_2012 = rank(h11atotb) if !missing(h11atotb)
(6,083 missing values generated)

. 
. gen double wealth_pct_2012 = .
(15,856 missing values generated)

. replace wealth_pct_2012 = 100 * (wealth_rank_2012 - 1) / (`N_wealth12' - 1) if `N_wealth12
> ' > 1 & !missing(wealth_rank_2012)
(9,773 real changes made)

. replace wealth_pct_2012 = 50 if `N_wealth12' == 1 & !missing(wealth_rank_2012)
(0 real changes made)

. 
. label variable wealth_pct_2012 "Wealth percentile (based on h11atotb)"

. 
. di as txt "Wealth percentile (2012) summary:"
Wealth percentile (2012) summary:

. summarize wealth_pct_2012

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
wealth_pct~2 |      9,773          50    28.87031          0   99.99488

. 
. capture drop wealth_decile_2012

. xtile wealth_decile_2012 = h11atotb if !missing(h11atotb), n(10)

. label var wealth_decile_2012 "Wealth decile (1=lowest,10=highest)"

. 
. di as txt "Wealth decile distribution (2012):"
Wealth decile distribution (2012):

. tab wealth_decile_2012, missing

     Wealth |
     decile |
(1=lowest,1 |
 0=highest) |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,373        8.66        8.66
          2 |        600        3.78       12.44
          3 |        961        6.06       18.50
          4 |        979        6.17       24.68
          5 |        978        6.17       30.85
          6 |        977        6.16       37.01
          7 |        975        6.15       43.16
          8 |        976        6.16       49.31
          9 |        977        6.16       55.47
         10 |        977        6.16       61.64
          . |      6,083       38.36      100.00
------------+-----------------------------------
      Total |     15,856      100.00

. 
. forvalues d = 1/10 {
  2.     capture drop wealth_d`d'_2012
  3.     gen byte wealth_d`d'_2012 = wealth_decile_2012 == `d' if !missing(wealth_decile_201
> 2)
  4.     label values wealth_d`d'_2012 yesno
  5.     label var wealth_d`d'_2012 "Wealth decile `d' (2012)"
  6. }
(6,083 missing values generated)
(6,083 missing values generated)
(6,083 missing values generated)
(6,083 missing values generated)
(6,083 missing values generated)
(6,083 missing values generated)
(6,083 missing values generated)
(6,083 missing values generated)
(6,083 missing values generated)
(6,083 missing values generated)

. 
. * Age (2012): carry r11agey_b to age_2012
. capture confirm variable r11agey_b

. if _rc {
.     di as error "ERROR: r11agey_b not found"
.     exit 198
. }

. 
. capture drop age_2012

. gen double age_2012 = r11agey_b
(6,083 missing values generated)

. label var age_2012 "Respondent age in 2012 (r11agey_b)"

. 
. di as txt "Age (2012) summary:"
Age (2012) summary:

. summarize age_2012

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    age_2012 |      9,773    62.73324    9.249894         24         95

. 
. * Employment (2012): carry r11inlbrf to inlbrf_2012
. capture confirm variable r11inlbrf

. if _rc {
.     di as error "ERROR: r11inlbrf not found"
.     exit 198
. }

. 
. capture drop inlbrf_2012

. clonevar inlbrf_2012 = r11inlbrf
(6,108 missing values generated)

. label var inlbrf_2012 "Labor force status in 2012 (r11inlbrf)"

. 
. di as txt "Employment (2012) distribution:"
Employment (2012) distribution:

. tab inlbrf_2012, missing

          Labor force status in 2012 |
                         (r11inlbrf) |      Freq.     Percent        Cum.
-------------------------------------+-----------------------------------
                                0.no |      4,412       27.83       27.83
                               1.yes |      5,336       33.65       61.48
                                   . |      6,083       38.36       99.84
                               .d=dk |          3        0.02       99.86
                .i=institutionalized |         10        0.06       99.92
                      .m=oth missing |          7        0.04       99.97
                               .r=rf |          5        0.03      100.00
-------------------------------------+-----------------------------------
                               Total |     15,856      100.00

. 
. * Save back to unified analysis dataset
. 
. di as txt "=== Saving updated analysis dataset (with 2014 flows and returns) ==="
=== Saving updated analysis dataset (with 2014 flows and returns) ===

. 
. * Overlap only: All 5-year overlap (included/excl-res and trimmed)
. quietly count if !missing(r_annual_2022) & !missing(r_annual_2020) & !missing(r_annual_201
> 8) & !missing(r_annual_2016) & !missing(r_annual_2014)

. 
. di as txt "  All 5 years (included): " %9.0f r(N)
  All 5 years (included):      5722

. 
. quietly count if !missing(r_annual_2022_excl_res) & !missing(r_annual_2020_excl_res) & !mi
> ssing(r_annual_2018_excl_res) & !missing(r_annual_2016_excl_res) & !missing(r_annual_2014_
> excl_res)

. 
. di as txt "  All 5 years (excl-res): " %9.0f r(N)
  All 5 years (excl-res):      5760

. 
. quietly count if !missing(r_annual_2022_trim) & !missing(r_annual_2020_trim) & !missing(r_
> annual_2018_trim) & !missing(r_annual_2016_trim) & !missing(r_annual_2014_trim)

. 
. di as txt "  All 5 years (included, trimmed): " %9.0f r(N)
  All 5 years (included, trimmed):      4440

. 
. quietly count if !missing(r_annual_2022_excl_res_trim) & !missing(r_annual_2020_excl_res_t
> rim) & !missing(r_annual_2018_excl_res_trim) & !missing(r_annual_2016_excl_res_trim) & !mi
> ssing(r_annual_2014_excl_res_trim)

. 
. di as txt "  All 5 years (excl-res, trimmed): " %9.0f r(N)
  All 5 years (excl-res, trimmed):      4228

. 
. save "`out_ana'", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/randhrs1992_2022v1_STATA/_ran
    > dhrs1992_2022v1_analysis.dta saved

. 
. di as txt "Saved: `out_ana'"
Saved: /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/randhrs1992_202
> 2v1_STATA/_randhrs1992_2022v1_analysis.dta

. 
. log close
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/randhrs19
> 92_2022v1_STATA/RAND_2014_merge_and_returns.log
  log type:  text
 closed on:   8 Oct 2025, 10:37:33
--------------------------------------------------------------------------------------------
