---------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/rand
> hrs1992_2022v1_STATA/RAND_2004_merge_and_returns.log
  log type:  text
 opened on:  20 Oct 2025, 09:55:26

. 
. set more off

. 
. * ---------------------------------------------------------------------
. * File paths
. * ---------------------------------------------------------------------
. local long_file "/Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Lon
> g/randhrs1992_2022v1_STATA/_randhrs1992_2022v1_analysis.dta"

. local raw_2004  "/Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAN
> D/_raw/2004/h04f1c_STATA/h04f1c.dta"

. local out_ana   "/Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Lon
> g/randhrs1992_2022v1_STATA/_randhrs1992_2022v1_analysis.dta"

. 
. * ---------------------------------------------------------------------
. * Load unified dataset and check key
. * ---------------------------------------------------------------------
. di as txt "=== Loading unified analysis dataset ==="
=== Loading unified analysis dataset ===

. capture confirm file `"`long_file'"'

. if _rc {
.     di as error "ERROR: unified analysis dataset not found -> `long_file'"
.     exit 198
. }

. use "`long_file'", clear

. capture confirm variable hhidpn

. if _rc {
.     di as error "ERROR: hhidpn not found in unified dataset"
.     exit 198
. }

. 
. * ---------------------------------------------------------------------
. * Load 2004 RAND fat file and extract flows
. * ---------------------------------------------------------------------
. di as txt "=== Loading 2004 RAND fat file ==="
=== Loading 2004 RAND fat file ===

. preserve

. capture confirm file `"`raw_2004'"'

. if _rc {
.     di as error "ERROR: RAW 2004 file not found -> `raw_2004'"
.     exit 198
. }

. use "`raw_2004'", clear

. capture confirm variable hhidpn

. if _rc {
.     di as error "ERROR: hhidpn not found in RAW 2004"
.     exit 198
. }

. 
. * 2004 flow variables per notes (JR* + JQ IRA triplet)
. local flow04 "jr050 jr055 jr063 jr064 jr072 jr030 jr035 jr045 jq171_1 jq171_2 jq171_3
>  jr007 jr013 jr024"

. 
. di as txt "Checking presence of 2004 flow variables..."
Checking presence of 2004 flow variables...

. foreach v of local flow04 {
  2.     capture confirm variable `v'
  3.     if _rc di as warn "  MISSING in 2004 RAW: `v'"
  4.     else  di as txt  "  OK in 2004 RAW: `v'"
  5. }
  OK in 2004 RAW: jr050
  OK in 2004 RAW: jr055
  OK in 2004 RAW: jr063
  OK in 2004 RAW: jr064
  OK in 2004 RAW: jr072
  OK in 2004 RAW: jr030
  OK in 2004 RAW: jr035
  OK in 2004 RAW: jr045
  OK in 2004 RAW: jq171_1
  OK in 2004 RAW: jq171_2
  OK in 2004 RAW: jq171_3
  OK in 2004 RAW: jr007
  OK in 2004 RAW: jr013
  OK in 2004 RAW: jr024

. 
. keep hhidpn `flow04'

. tempfile raw04_flows

. save "`raw04_flows'", replace
(file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_31054.000003 not found)
file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_31054.000003 saved as .dta
    format

. restore

. 
. * ---------------------------------------------------------------------
. * Merge flows into unified dataset
. * ---------------------------------------------------------------------
. di as txt "=== Merging 2004 flows into unified dataset ==="
=== Merging 2004 flows into unified dataset ===

. merge 1:1 hhidpn using "`raw04_flows'", keep(master match)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         9,947
        from master                     9,947  (_merge==1)
        from using                          0  (_merge==2)

    Matched                             5,909  (_merge==3)
    -----------------------------------------

. tab _merge

   Matching result from |
                  merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
        Master only (1) |      9,947       62.73       62.73
            Matched (3) |      5,909       37.27      100.00
------------------------+-----------------------------------
                  Total |     15,856      100.00

. drop _merge

. 
. * ---------------------------------------------------------------------
. * Clean special/miscodes for flow inputs
. * ---------------------------------------------------------------------
. local misscodes 999998 999999 9999999 9999998 99999998 99999999 999999999 999999998 9
> 999999999 9999999998 -8 -9 -9999999 -9999998 98 99

. foreach v of local flow04 {
  2.     capture confirm numeric variable `v'
  3.     if !_rc {
  4.         foreach mc of local misscodes {
  5.             quietly replace `v' = . if `v' == `mc'
  6.         }
  7.     }
  8. }

. 
. * ---------------------------------------------------------------------
. * Compute 2004 flow aggregates (suffix _2004)
. * ---------------------------------------------------------------------
. * jr063 direction and magnitude
. capture drop jr063_dir04

. gen byte jr063_dir04 = .
(15,856 missing values generated)

. replace jr063_dir04 = -1 if jr063 == 1
(124 real changes made)

. replace jr063_dir04 =  1 if jr063 == 2
(86 real changes made)

. replace jr063_dir04 =  0 if jr063 == 3
(111 real changes made)

. 
. capture drop flow_bus_2004

. gen double flow_bus_2004 = .
(15,856 missing values generated)

. replace flow_bus_2004 = jr055 - jr050 if !missing(jr055) & !missing(jr050)
(10 real changes made)

. replace flow_bus_2004 = jr055 if  missing(jr050) & !missing(jr055)
(18 real changes made)

. replace flow_bus_2004 = -jr050 if !missing(jr050) &  missing(jr055)
(83 real changes made)

. 
. capture drop flow_stk_private_2004

. gen double flow_stk_private_2004 = jr063_dir04 * jr064 if !missing(jr063_dir04) & !mi
> ssing(jr064)
(15,714 missing values generated)

. 
. capture drop flow_stk_public_2004

. gen double flow_stk_public_2004 = jr072 if !missing(jr072)
(14,566 missing values generated)

. 
. capture drop flow_stk_2004

. gen double flow_stk_2004 = cond(!missing(flow_stk_private_2004), flow_stk_private_200
> 4, 0) + ///
>                            cond(!missing(flow_stk_public_2004),  flow_stk_public_2004
> ,  0)

. replace flow_stk_2004 = . if missing(flow_stk_private_2004) & missing(flow_stk_public
> _2004)
(14,424 real changes made, 14,424 to missing)

. 
. capture drop flow_re_2004

. gen double flow_re_2004 = .
(15,856 missing values generated)

. replace flow_re_2004 = cond(missing(jr035),0,jr035) - ( cond(missing(jr030),0,jr030) 
> + cond(missing(jr045),0,jr045) ) if !missing(jr035) | !missing(jr030) | !missing(jr04
> 5)
(278 real changes made)

. 
. capture drop flow_ira_2004

. egen double flow_ira_2004 = rowtotal(jq171_1 jq171_2 jq171_3)

. replace flow_ira_2004 = . if missing(jq171_1) & missing(jq171_2) & missing(jq171_3)
(15,225 real changes made, 15,225 to missing)

. 
. capture drop flow_residences_2004

. gen double flow_residences_2004 = .
(15,856 missing values generated)

. replace flow_residences_2004 = cond(missing(jr013),0,jr013) - ( cond(missing(jr007),0
> ,jr007) + cond(missing(jr024),0,jr024) ) if !missing(jr013) | !missing(jr007) | !miss
> ing(jr024)
(1,135 real changes made)

. replace flow_residences_2004 = . if missing(jr013) & missing(jr007) & missing(jr024)
(0 real changes made)

. 
. capture drop flow_total_2004

. gen double flow_total_2004 = .
(15,856 missing values generated)

. egen byte any_flow_present04 = rownonmiss(flow_bus_2004 flow_re_2004 flow_stk_2004 fl
> ow_ira_2004 flow_residences_2004)

. replace flow_total_2004 = cond(missing(flow_bus_2004),0,flow_bus_2004) + ///
>                           cond(missing(flow_re_2004),0,flow_re_2004) + ///
>                           cond(missing(flow_stk_2004),0,flow_stk_2004) + ///
>                           cond(missing(flow_ira_2004),0,flow_ira_2004) + ///
>                           cond(missing(flow_residences_2004),0,flow_residences_2004) 
> ///
>                           if any_flow_present04 > 0
(2,477 real changes made)

. drop any_flow_present04

. 
. di as txt "Flows 2004 summaries:"
Flows 2004 summaries:

. summarize flow_bus_2004 flow_re_2004 flow_stk_2004 flow_ira_2004 flow_residences_2004
>  flow_total_2004

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
flow_bu~2004 |        111   -5033.514    140727.4    -410000     700000
flow_re_2004 |        278    7163.655      174673    -600000    1000000
flow_~k_2004 |      1,432   -5347.355    115263.8   -3000000     250000
flow_ir~2004 |        631    17719.63    27423.27          0     300000
flow_resi~04 |      1,135   -6861.671    100628.1   -1020000     759000
-------------+---------------------------------------------------------
flow_to~2004 |      2,477   -1143.136    132322.8   -3040000    1000001

. 
. * ---------------------------------------------------------------------
. * Compute TOTAL RETURNS for 2004 (period 2002-2004)
. * ---------------------------------------------------------------------
. di as txt "=== Computing 2004 returns (2002-2004) ==="
=== Computing 2004 returns (2002-2004) ===

. 
. * Denominator base: A_{2002}
. capture drop a_2002

. gen double a_2002 = h6atotb
(11,702 missing values generated)

. label var a_2002 "Total net assets (A_2002 = h6atotb)"

. 
. * Capital income y^c_2004
. capture drop y_c_2004

. gen double y_c_2004 = h7icap
(9,947 missing values generated)

. label var y_c_2004 "Capital income 2004 (h7icap)"

. 
. * Capital gains per class: cg_class = V_2004 - V_2002
. capture drop cg_pri_res_2004 cg_sec_res_2004 cg_re_2004 cg_bus_2004 cg_ira_2004 cg_st
> k_2004 cg_bond_2004 cg_chck_2004 cg_cd_2004 cg_veh_2004 cg_oth_2004

. gen double cg_pri_res_2004 = h7atoth - h6atoth
(11,749 missing values generated)

. gen double cg_sec_res_2004 = h7anethb - h6anethb
(11,749 missing values generated)

. gen double cg_re_2004      = h7arles - h6arles
(11,749 missing values generated)

. gen double cg_bus_2004     = h7absns - h6absns
(11,749 missing values generated)

. gen double cg_ira_2004     = h7aira  - h6aira
(11,749 missing values generated)

. gen double cg_stk_2004     = h7astck - h6astck
(11,749 missing values generated)

. gen double cg_bond_2004    = h7abond - h6abond
(11,749 missing values generated)

. gen double cg_chck_2004    = h7achck - h6achck
(11,749 missing values generated)

. gen double cg_cd_2004      = h7acd   - h6acd
(11,749 missing values generated)

. gen double cg_veh_2004     = h7atran - h6atran
(11,749 missing values generated)

. gen double cg_oth_2004     = h7aothr - h6aothr
(11,749 missing values generated)

. 
. di as txt "Capital gains components (2002->2004) summaries:"
Capital gains components (2002->2004) summaries:

. summarize cg_pri_res_2004 cg_sec_res_2004 cg_re_2004 cg_bus_2004 cg_ira_2004 cg_stk_2
> 004 cg_bond_2004 cg_chck_2004 cg_cd_2004 cg_veh_2004 cg_oth_2004

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
cg_pri_~2004 |      4,107       27295      206348   -1800000    8000000
cg_sec_~2004 |      4,107     3739.51    73910.14   -1624512     900000
  cg_re_2004 |      4,107    9707.202    186624.2   -2800000    3000000
 cg_bus_2004 |      4,107    9527.422    364709.1   -9000000   1.50e+07
 cg_ira_2004 |      4,107    6541.011    116781.4   -1700000    1309000
-------------+---------------------------------------------------------
 cg_stk_2004 |      4,107    26332.99    626675.7   -3575000   2.31e+07
cg_bond_2004 |      4,107    3199.471    104552.8   -1000000    4000000
cg_chck_2004 |      4,107    3590.104    86718.99    -996000    2600000
  cg_cd_2004 |      4,107    292.7157    40801.04   -1225000    1000000
 cg_veh_2004 |      4,107    150.7298    19063.04    -195000     282000
-------------+---------------------------------------------------------
 cg_oth_2004 |      4,107   -25248.24     1479345  -8.97e+07    5000000

. 
. * Total capital gains with missing logic (missing only if all components missing)
. capture drop cg_total_2004

. egen byte any_cg_2004 = rownonmiss(cg_pri_res_2004 cg_sec_res_2004 cg_re_2004 cg_bus_
> 2004 cg_ira_2004 cg_stk_2004 cg_bond_2004 cg_chck_2004 cg_cd_2004 cg_veh_2004 cg_oth_
> 2004)

. gen double cg_total_2004 = .
(15,856 missing values generated)

. replace cg_total_2004 = cond(missing(cg_pri_res_2004),0,cg_pri_res_2004) + ///
>                         cond(missing(cg_sec_res_2004),0,cg_sec_res_2004) + ///
>                         cond(missing(cg_re_2004),0,cg_re_2004) + ///
>                         cond(missing(cg_bus_2004),0,cg_bus_2004) + ///
>                         cond(missing(cg_ira_2004),0,cg_ira_2004) + ///
>                         cond(missing(cg_stk_2004),0,cg_stk_2004) + ///
>                         cond(missing(cg_bond_2004),0,cg_bond_2004) + ///
>                         cond(missing(cg_chck_2004),0,cg_chck_2004) + ///
>                         cond(missing(cg_cd_2004),0,cg_cd_2004) + ///
>                         cond(missing(cg_veh_2004),0,cg_veh_2004) + ///
>                         cond(missing(cg_oth_2004),0,cg_oth_2004) if any_cg_2004>0
(4,107 real changes made)

. drop any_cg_2004

. 
. di as txt "[summarize] y_c_2004, cg_total_2004, flow_total_2004"
[summarize] y_c_2004, cg_total_2004, flow_total_2004

. summarize y_c_2004 cg_total_2004 flow_total_2004

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    y_c_2004 |      5,909    17241.84    61509.08          0    1347135
cg_tota~2004 |      4,107    65127.91     1687063  -8.95e+07   2.50e+07
flow_to~2004 |      2,477   -1143.136    132322.8   -3040000    1000001

. 
. * Base: A_2002 + 0.5 * F_2004 (treat flows as 0 only when A_2002 is non-missing)
. capture drop base_2004

. gen double base_2004 = .
(15,856 missing values generated)

. replace base_2004 = a_2002 + 0.5 * cond(missing(flow_total_2004),0,flow_total_2004) i
> f !missing(a_2002)
(4,154 real changes made)

. label var base_2004 "Base for 2004 returns (A_2002 + 0.5*F_2004)"

. 
. di as txt "[summarize] base_2004"
[summarize] base_2004

. summarize base_2004, detail

         Base for 2004 returns (A_2002 + 0.5*F_2004)
-------------------------------------------------------------
      Percentiles      Smallest
 1%       -20750         -94200
 5%          500         -92250
10%        14000      -87204.13       Obs               4,154
25%        73900      -80688.52       Sum of wgt.       4,154

50%       207800                      Mean           463897.5
                        Largest       Std. dev.       1676410
75%     507002.5       1.08e+07
90%      1026656       1.64e+07       Variance       2.81e+12
95%      1582000       3.32e+07       Skewness       39.98937
99%      3649746       9.07e+07       Kurtosis       2059.229

. 
. * Period return and annualization (2-year)
. capture drop num_period_2004 r_period_2004 r_annual_2004 r_annual_trim_2004

. gen double num_period_2004 = cond(missing(y_c_2004),0,y_c_2004) + ///
>                              cond(missing(cg_total_2004),0,cg_total_2004) - ///
>                              cond(missing(flow_total_2004),0,flow_total_2004)

. egen byte __num04_has = rownonmiss(y_c_2004 cg_total_2004 flow_total_2004)

. replace num_period_2004 = . if __num04_has == 0
(9,947 real changes made, 9,947 to missing)

. drop __num04_has

. 
. gen double r_period_2004 = num_period_2004 / base_2004
(11,810 missing values generated)

. replace r_period_2004 = . if base_2004 < 10000
(309 real changes made, 309 to missing)

. 
. gen double r_annual_2004 = (1 + r_period_2004)^(1/2) - 1
(12,168 missing values generated)

. replace r_annual_2004 = . if missing(r_period_2004)
(0 real changes made)

. 
. * Trim 5% tails
. capture drop r_annual_trim_2004

. xtile __p_2004 = r_annual_2004 if !missing(r_annual_2004), n(100)

. gen double r_annual_trim_2004 = r_annual_2004
(12,168 missing values generated)

. replace r_annual_trim_2004 = . if __p_2004 <= 5 | __p_2004 > 95
(370 real changes made, 370 to missing)

. drop __p_2004

. 
. di as txt "[summarize] r_period_2004, r_annual_2004, r_annual_trim_2004"
[summarize] r_period_2004, r_annual_2004, r_annual_trim_2004

. summarize r_period_2004 r_annual_2004 r_annual_trim_2004

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
r_perio~2004 |      3,737    .3849143    1.748527     -8.983   65.89136
r_ann~l_2004 |      3,688    .1168962    .4054186         -1   7.178714
r_ann~m_2004 |      3,318    .0927962    .2202718  -.3907805   .7320508

. 
. * Excluding residential housing
. capture drop cg_total_2004_excl_res flow_total_2004_excl_res

. gen double flow_total_2004_excl_res = .
(15,856 missing values generated)

. egen byte any_flow04_excl = rownonmiss(flow_bus_2004 flow_re_2004 flow_stk_2004 flow_
> ira_2004)

. replace flow_total_2004_excl_res = cond(missing(flow_bus_2004),0,flow_bus_2004) + ///
>                                    cond(missing(flow_re_2004),0,flow_re_2004) + ///
>                                    cond(missing(flow_stk_2004),0,flow_stk_2004) + ///
>                                    cond(missing(flow_ira_2004),0,flow_ira_2004) if an
> y_flow04_excl>0
(1,961 real changes made)

. drop any_flow04_excl

. 
. gen double cg_total_2004_excl_res = .
(15,856 missing values generated)

. egen byte any_cg04_excl = rownonmiss(cg_re_2004 cg_bus_2004 cg_ira_2004 cg_stk_2004 c
> g_bond_2004 cg_chck_2004 cg_cd_2004 cg_veh_2004 cg_oth_2004)

. replace cg_total_2004_excl_res = cond(missing(cg_re_2004),0,cg_re_2004) + ///
>                                  cond(missing(cg_bus_2004),0,cg_bus_2004) + ///
>                                  cond(missing(cg_ira_2004),0,cg_ira_2004) + ///
>                                  cond(missing(cg_stk_2004),0,cg_stk_2004) + ///
>                                  cond(missing(cg_bond_2004),0,cg_bond_2004) + ///
>                                  cond(missing(cg_chck_2004),0,cg_chck_2004) + ///
>                                  cond(missing(cg_cd_2004),0,cg_cd_2004) + ///
>                                  cond(missing(cg_veh_2004),0,cg_veh_2004) + ///
>                                  cond(missing(cg_oth_2004),0,cg_oth_2004) if any_cg04
> _excl>0
(4,107 real changes made)

. drop any_cg04_excl

. 
. di as txt "EXCL-RES: cg_total_2004_excl_res and flow_total_2004_excl_res summaries:"
EXCL-RES: cg_total_2004_excl_res and flow_total_2004_excl_res summaries:

. summarize cg_total_2004_excl_res flow_total_2004_excl_res

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
cg_total_2.. |      4,107     34093.4     1679946  -8.98e+07   2.50e+07
flow_total.. |      1,961    2527.511    124834.2   -3000000    1000001

. 
. * Use SAME base_2004
. capture drop num_period_2004_excl_res r_period_2004_excl_res r_annual_excl_2004 r_ann
> ual_excl_trim_2004

. gen double num_period_2004_excl_res = cond(missing(y_c_2004),0,y_c_2004) + ///
>                                       cond(missing(cg_total_2004_excl_res),0,cg_total
> _2004_excl_res) - ///
>                                       cond(missing(flow_total_2004_excl_res),0,flow_t
> otal_2004_excl_res)

. egen byte __num04ex_has = rownonmiss(y_c_2004 cg_total_2004_excl_res flow_total_2004_
> excl_res)

. replace num_period_2004_excl_res = . if __num04ex_has == 0
(9,947 real changes made, 9,947 to missing)

. drop __num04ex_has

. 
. gen double r_period_2004_excl_res = num_period_2004_excl_res / base_2004
(11,810 missing values generated)

. replace r_period_2004_excl_res = . if base_2004 < 10000
(309 real changes made, 309 to missing)

. gen double r_annual_excl_2004 = (1 + r_period_2004_excl_res)^(1/2) - 1
(12,133 missing values generated)

. replace r_annual_excl_2004 = . if missing(r_period_2004_excl_res)
(0 real changes made)

. 
. * Trim 5% for excl-res
. xtile __p_ex04 = r_annual_excl_2004 if !missing(r_annual_excl_2004), n(100)

. gen double r_annual_excl_trim_2004 = r_annual_excl_2004
(12,133 missing values generated)

. replace r_annual_excl_trim_2004 = . if __p_ex04 <= 5 | __p_ex04 > 95
(374 real changes made, 374 to missing)

. drop __p_ex04

. 
. di as txt "[summarize] r_period_2004_excl_res, r_annual_excl_2004, r_annual_excl_trim
> _2004"
[summarize] r_period_2004_excl_res, r_annual_excl_2004, r_annual_excl_trim_2004

. summarize r_period_2004_excl_res r_annual_excl_2004 r_annual_excl_trim_2004

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
r_period_2.. |      3,737     .239272    1.509217  -2.259893   66.23918
r_an~cl_2004 |      3,723    .0658491    .3317276         -1    7.19995
r_annual_e.. |      3,349    .0436966    .1671359  -.3201508   .5519664

. 
. * ---------------------------------------------------------------------
. * Prepare 2002 controls inline (married_2002, wealth_*_2002, age_2002, inlbrf_2002)
. * ---------------------------------------------------------------------
. di as txt "=== Preparing 2002 controls (inline) ==="
=== Preparing 2002 controls (inline) ===

. 
. * Marital status (2002): r6mstat -> married_2002
. capture confirm variable r6mstat

. if _rc {
.     di as error "ERROR: r6mstat not found"
.     exit 198
. }

. 
. capture drop married_2002

. gen byte married_2002 = .
(15,856 missing values generated)

. replace married_2002 = 1 if inlist(r6mstat, 1, 2)
(3,118 real changes made)

. replace married_2002 = 0 if inlist(r6mstat, 3, 4, 5, 6, 7, 8)
(1,032 real changes made)

. label define yesno 0 "no" 1 "yes", replace

. label values married_2002 yesno

. label var married_2002 "Married (r6mstat: 1 or 2) vs not married (3-8)"

. 
. di as txt "Marital status (2002) summary:"
Marital status (2002) summary:

. tab married_2002, missing

    Married |
(r6mstat: 1 |
   or 2) vs |
not married |
      (3-8) |      Freq.     Percent        Cum.
------------+-----------------------------------
         no |      1,032        6.51        6.51
        yes |      3,118       19.66       26.17
          . |     11,706       73.83      100.00
------------+-----------------------------------
      Total |     15,856      100.00

. 
. * Wealth percentile/deciles for 2002 using h6atotb
. capture confirm variable h6atotb

. if _rc {
.     di as error "ERROR: h6atotb not found"
.     exit 198
. }

. 
. capture drop wealth_rank_2002 wealth_pct_2002

. quietly count if !missing(h6atotb)

. local N_wealth02 = r(N)

. egen double wealth_rank_2002 = rank(h6atotb) if !missing(h6atotb)
(11,702 missing values generated)

. gen double wealth_pct_2002 = .
(15,856 missing values generated)

. replace wealth_pct_2002 = 100 * (wealth_rank_2002 - 1) / (`N_wealth02' - 1) if `N_wea
> lth02' > 1 & !missing(wealth_rank_2002)
(4,154 real changes made)

. replace wealth_pct_2002 = 50 if `N_wealth02' == 1 & !missing(wealth_rank_2002)
(0 real changes made)

. label variable wealth_pct_2002 "Wealth percentile (based on h6atotb)"

. 
. di as txt "Wealth percentile (2002) summary:"
Wealth percentile (2002) summary:

. summarize wealth_pct_2002

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
wealth_pc~02 |      4,154          50    28.87788          0        100

. 
. capture drop wealth_decile_2002

. xtile wealth_decile_2002 = h6atotb if !missing(h6atotb), n(10)

. label var wealth_decile_2002 "Wealth decile (1=lowest,10=highest)"

. 
. di as txt "Wealth decile distribution (2002):"
Wealth decile distribution (2002):

. tab wealth_decile_2002, missing

     Wealth |
     decile |
(1=lowest,1 |
 0=highest) |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        416        2.62        2.62
          2 |        415        2.62        5.24
          3 |        416        2.62        7.86
          4 |        417        2.63       10.49
          5 |        414        2.61       13.11
          6 |        415        2.62       15.72
          7 |        415        2.62       18.34
          8 |        417        2.63       20.97
          9 |        414        2.61       23.58
         10 |        415        2.62       26.20
          . |     11,702       73.80      100.00
------------+-----------------------------------
      Total |     15,856      100.00

. 
. forvalues d = 1/10 {
  2.     capture drop wealth_d`d'_2002
  3.     gen byte wealth_d`d'_2002 = wealth_decile_2002 == `d' if !missing(wealth_decil
> e_2002)
  4.     label values wealth_d`d'_2002 yesno
  5.     label var wealth_d`d'_2002 "Wealth decile `d' (2002)"
  6. }
(11,702 missing values generated)
(11,702 missing values generated)
(11,702 missing values generated)
(11,702 missing values generated)
(11,702 missing values generated)
(11,702 missing values generated)
(11,702 missing values generated)
(11,702 missing values generated)
(11,702 missing values generated)
(11,702 missing values generated)

. 
. * Age (2002): r6agey_b -> age_2002
. capture confirm variable r6agey_b

. if _rc {
.     di as error "ERROR: r6agey_b not found"
.     exit 198
. }

. 
. capture drop age_2002

. gen double age_2002 = r6agey_b
(11,702 missing values generated)

. label var age_2002 "Respondent age in 2002 (r6agey_b)"

. 
. di as txt "Age (2002) summary:"
Age (2002) summary:

. summarize age_2002

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    age_2002 |      4,154    60.73255    6.894336         25         86

. 
. * Employment (2002): r6inlbrf -> inlbrf_2002
. capture confirm variable r6inlbrf

. if _rc {
.     di as error "ERROR: r6inlbrf not found"
.     exit 198
. }

. 
. capture drop inlbrf_2002

. clonevar inlbrf_2002 = r6inlbrf
(11,709 missing values generated)

. label var inlbrf_2002 "Labor force status in 2002 (r6inlbrf)"

. 
. di as txt "Employment (2002) distribution:"
Employment (2002) distribution:

. tab inlbrf_2002, missing

          Labor force status in 2002 |
                          (r6inlbrf) |      Freq.     Percent        Cum.
-------------------------------------+-----------------------------------
                                0.no |      1,717       10.83       10.83
                               1.yes |      2,430       15.33       26.15
                                   . |     11,702       73.80       99.96
                .i=institutionalized |          5        0.03       99.99
                      .m=oth missing |          2        0.01      100.00
-------------------------------------+-----------------------------------
                               Total |     15,856      100.00

. 
. * ---------------------------------------------------------------------
. * Save back and print only overlap counts for all 10 years
. * ---------------------------------------------------------------------
. di as txt "=== Saving updated analysis dataset (with 2004 flows and returns) ==="
=== Saving updated analysis dataset (with 2004 flows and returns) ===

. 
. * Overlap only: All 10-year overlap (included/excl-res and trimmed)
. quietly count if !missing(r_annual_2022) & !missing(r_annual_2020) & !missing(r_annua
> l_2018) & !missing(r_annual_2016) & !missing(r_annual_2014) & !missing(r_annual_2012)
>  & !missing(r_annual_2010) & !missing(r_annual_2008) & !missing(r_annual_2006) & !mis
> sing(r_annual_2004)

. di as txt "  All 10 years (included): " %9.0f r(N)
  All 10 years (included):      2677

. 
. quietly count if !missing(r_annual_excl_2022) & !missing(r_annual_excl_2020) & !missi
> ng(r_annual_excl_2018) & !missing(r_annual_excl_2016) & !missing(r_annual_excl_2014) 
> & !missing(r_annual_excl_2012) & !missing(r_annual_excl_2010) & !missing(r_annual_exc
> l_2008) & !missing(r_annual_excl_2006) & !missing(r_annual_excl_2004)

. di as txt "  All 10 years (excl-res): " %9.0f r(N)
  All 10 years (excl-res):      2704

. 
. quietly count if !missing(r_annual_trim_2022) & !missing(r_annual_trim_2020) & !missi
> ng(r_annual_trim_2018) & !missing(r_annual_trim_2016) & !missing(r_annual_trim_2014) 
> & !missing(r_annual_trim_2012) & !missing(r_annual_trim_2010) & !missing(r_annual_tri
> m_2008) & !missing(r_annual_trim_2006) & !missing(r_annual_trim_2004)

. di as txt "  All 10 years (included, trimmed): " %9.0f r(N)
  All 10 years (included, trimmed):      1846

. 
. quietly count if !missing(r_annual_excl_trim_2022) & !missing(r_annual_excl_trim_2020
> ) & !missing(r_annual_excl_trim_2018) & !missing(r_annual_excl_trim_2016) & !missing(
> r_annual_excl_trim_2014) & !missing(r_annual_excl_trim_2012) & !missing(r_annual_excl
> _trim_2010) & !missing(r_annual_excl_trim_2008) & !missing(r_annual_excl_trim_2006) &
>  !missing(r_annual_excl_trim_2004)

. di as txt "  All 10 years (excl-res, trimmed): " %9.0f r(N)
  All 10 years (excl-res, trimmed):      1637

. 
. save "`out_ana'", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/randhrs1992_2022v1_STATA
    > /_randhrs1992_2022v1_analysis.dta saved

. di as txt "Saved: `out_ana'"
Saved: /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/randhrs199
> 2_2022v1_STATA/_randhrs1992_2022v1_analysis.dta

. 
. log close
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/rand
> hrs1992_2022v1_STATA/RAND_2004_merge_and_returns.log
  log type:  text
 closed on:  20 Oct 2025, 09:55:32
---------------------------------------------------------------------------------------
