--------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/randhrs19
> 92_2022v1_STATA/RAND_2006_merge_and_returns.log
  log type:  text
 opened on:   8 Oct 2025, 12:10:03

. 
. set more off

. 
. * ---------------------------------------------------------------------
. * File paths
. * ---------------------------------------------------------------------
. local long_file "/Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/ran
> dhrs1992_2022v1_STATA/_randhrs1992_2022v1_analysis.dta"

. local raw_2006  "/Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAND/_ra
> w/2006/h06f4b_STATA/h06f4b.dta"

. local out_ana   "/Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/ran
> dhrs1992_2022v1_STATA/_randhrs1992_2022v1_analysis.dta"

. 
. * ---------------------------------------------------------------------
. * Load unified dataset and check key
. * ---------------------------------------------------------------------
. di as txt "=== Loading unified analysis dataset ==="
=== Loading unified analysis dataset ===

. capture confirm file `"`long_file'"'

. if _rc {
.     di as error "ERROR: unified analysis dataset not found -> `long_file'"
.     exit 198
. }

. use "`long_file'", clear

. capture confirm variable hhidpn

. if _rc {
.     di as error "ERROR: hhidpn not found in unified dataset"
.     exit 198
. }

. 
. * ---------------------------------------------------------------------
. * Load 2006 RAND fat file and extract flows
. * ---------------------------------------------------------------------
. di as txt "=== Loading 2006 RAND fat file ==="
=== Loading 2006 RAND fat file ===

. preserve

. capture confirm file `"`raw_2006'"'

. if _rc {
.     di as error "ERROR: RAW 2006 file not found -> `raw_2006'"
.     exit 198
. }

. use "`raw_2006'", clear

. capture confirm variable hhidpn

. if _rc {
.     di as error "ERROR: hhidpn not found in RAW 2006"
.     exit 198
. }

. 
. * 2006 flow variables per notes (KR* + KQ IRA triplet)
. local flow06 "kr050 kr055 kr063 kr064 kr072 kr030 kr035 kr045 kq171_1 kq171_2 kq171_3 kr00
> 7 kr013 kr024"

. 
. di as txt "Checking presence of 2006 flow variables..."
Checking presence of 2006 flow variables...

. foreach v of local flow06 {
  2.     capture confirm variable `v'
  3.     if _rc di as warn "  MISSING in 2006 RAW: `v'"
  4.     else  di as txt  "  OK in 2006 RAW: `v'"
  5. }
  OK in 2006 RAW: kr050
  OK in 2006 RAW: kr055
  OK in 2006 RAW: kr063
  OK in 2006 RAW: kr064
  OK in 2006 RAW: kr072
  OK in 2006 RAW: kr030
  OK in 2006 RAW: kr035
  OK in 2006 RAW: kr045
  OK in 2006 RAW: kq171_1
  OK in 2006 RAW: kq171_2
  OK in 2006 RAW: kq171_3
  OK in 2006 RAW: kr007
  OK in 2006 RAW: kr013
  OK in 2006 RAW: kr024

. 
. keep hhidpn `flow06'

. tempfile raw06_flows

. save "`raw06_flows'", replace
(file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_97518.000003 not found)
file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_97518.000003 saved as .dta format

. restore

. 
. * ---------------------------------------------------------------------
. * Merge flows into unified dataset
. * ---------------------------------------------------------------------
. di as txt "=== Merging 2006 flows into unified dataset ==="
=== Merging 2006 flows into unified dataset ===

. merge 1:1 hhidpn using "`raw06_flows'", keep(master match)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         9,978
        from master                     9,978  (_merge==1)
        from using                          0  (_merge==2)

    Matched                             5,878  (_merge==3)
    -----------------------------------------

. tab _merge

   Matching result from |
                  merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
        Master only (1) |      9,978       62.93       62.93
            Matched (3) |      5,878       37.07      100.00
------------------------+-----------------------------------
                  Total |     15,856      100.00

. drop _merge

. 
. * ---------------------------------------------------------------------
. * Clean special/miscodes for flow inputs (match later-year rules)
. * ---------------------------------------------------------------------
. local misscodes 999998 999999 9999999 9999998 99999998 99999999 999999999 999999998 999999
> 9999 9999999998 -8 -9 -9999999 -9999998 98 99

. foreach v of local flow06 {
  2.     capture confirm numeric variable `v'
  3.     if !_rc {
  4.         foreach mc of local misscodes {
  5.             quietly replace `v' = . if `v' == `mc'
  6.         }
  7.     }
  8. }

. 
. * ---------------------------------------------------------------------
. * Compute 2006 flow aggregates (suffix _2006)
. * ---------------------------------------------------------------------
. * kr063 direction and magnitude
. capture drop kr063_dir06

. gen byte kr063_dir06 = .
(15,856 missing values generated)

. replace kr063_dir06 = -1 if kr063 == 1
(146 real changes made)

. replace kr063_dir06 =  1 if kr063 == 2
(82 real changes made)

. replace kr063_dir06 =  0 if kr063 == 3
(139 real changes made)

. 
. capture drop flow_bus_2006

. gen double flow_bus_2006 = .
(15,856 missing values generated)

. replace flow_bus_2006 = kr055 - kr050 if !missing(kr055) & !missing(kr050)
(6 real changes made)

. replace flow_bus_2006 = kr055 if  missing(kr050) & !missing(kr055)
(21 real changes made)

. replace flow_bus_2006 = -kr050 if !missing(kr050) &  missing(kr055)
(129 real changes made)

. 
. capture drop flow_stk_private_2006

. gen double flow_stk_private_2006 = kr063_dir06 * kr064 if !missing(kr063_dir06) & !missing
> (kr064)
(15,688 missing values generated)

. 
. capture drop flow_stk_public_2006

. gen double flow_stk_public_2006 = kr072 if !missing(kr072)
(14,193 missing values generated)

. 
. capture drop flow_stk_2006

. gen double flow_stk_2006 = cond(!missing(flow_stk_private_2006), flow_stk_private_2006, 0)
>  + ///
>                            cond(!missing(flow_stk_public_2006),  flow_stk_public_2006,  0)

. replace flow_stk_2006 = . if missing(flow_stk_private_2006) & missing(flow_stk_public_2006
> )
(14,025 real changes made, 14,025 to missing)

. 
. capture drop flow_re_2006

. gen double flow_re_2006 = .
(15,856 missing values generated)

. replace flow_re_2006 = cond(missing(kr035),0,kr035) - ( cond(missing(kr030),0,kr030) + con
> d(missing(kr045),0,kr045) ) if !missing(kr035) | !missing(kr030) | !missing(kr045)
(346 real changes made)

. 
. capture drop flow_ira_2006

. egen double flow_ira_2006 = rowtotal(kq171_1 kq171_2 kq171_3)

. replace flow_ira_2006 = . if missing(kq171_1) & missing(kq171_2) & missing(kq171_3)
(15,085 real changes made, 15,085 to missing)

. 
. capture drop flow_residences_2006

. gen double flow_residences_2006 = .
(15,856 missing values generated)

. replace flow_residences_2006 = cond(missing(kr013),0,kr013) - ( cond(missing(kr007),0,kr00
> 7) + cond(missing(kr024),0,kr024) ) if !missing(kr013) | !missing(kr007) | !missing(kr024)
(1,674 real changes made)

. replace flow_residences_2006 = . if missing(kr013) & missing(kr007) & missing(kr024)
(0 real changes made)

. 
. capture drop flow_total_2006

. gen double flow_total_2006 = .
(15,856 missing values generated)

. egen byte any_flow_present06 = rownonmiss(flow_bus_2006 flow_re_2006 flow_stk_2006 flow_ir
> a_2006 flow_residences_2006)

. replace flow_total_2006 = cond(missing(flow_bus_2006),0,flow_bus_2006) + ///
>                           cond(missing(flow_re_2006),0,flow_re_2006) + ///
>                           cond(missing(flow_stk_2006),0,flow_stk_2006) + ///
>                           cond(missing(flow_ira_2006),0,flow_ira_2006) + ///
>                           cond(missing(flow_residences_2006),0,flow_residences_2006) ///
>                           if any_flow_present06 > 0
(3,275 real changes made)

. drop any_flow_present06

. 
. di as txt "Flows 2006 summaries:"
Flows 2006 summaries:

. summarize flow_bus_2006 flow_re_2006 flow_stk_2006 flow_ira_2006 flow_residences_2006 flow
> _total_2006

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
flow_bu~2006 |        156    11077.57    181084.1    -300000    1700000
flow_re_2006 |        346   -9238.725    215210.6   -1200000     750000
flow_~k_2006 |      1,831   -1748.027    27120.78    -700000     150000
flow_ir~2006 |        771    21355.47    44354.06          0     500000
flow_resi~06 |      1,674   -19084.41    326928.6  -1.16e+07    2375000
-------------+---------------------------------------------------------
flow_to~2006 |      3,275   -6153.089    248685.3  -1.16e+07    2243700

. 
. * ---------------------------------------------------------------------
. * Compute TOTAL RETURNS for 2006 (period 2004-2006)
. * ---------------------------------------------------------------------
. di as txt "=== Computing 2006 returns (2004-2006) ==="
=== Computing 2006 returns (2004-2006) ===

. 
. * Denominator base: A_{2004}
. capture drop a_2004

. gen double a_2004 = h7atotb
(9,947 missing values generated)

. label var a_2004 "Total net assets (A_2004 = h7atotb)"

. 
. * Capital income y^c_2006
. capture drop y_c_2006

. gen double y_c_2006 = h8icap
(9,978 missing values generated)

. label var y_c_2006 "Capital income 2006 (h8icap)"

. 
. * Capital gains per class: cg_class = V_2006 - V_2004
. capture drop cg_pri_res_2006 cg_sec_res_2006 cg_re_2006 cg_bus_2006 cg_ira_2006 cg_stk_200
> 6 cg_bond_2006 cg_chck_2006 cg_cd_2006 cg_veh_2006 cg_oth_2006

. gen double cg_pri_res_2006 = h8atoth - h7atoth
(10,096 missing values generated)

. gen double cg_sec_res_2006 = h8anethb - h7anethb
(10,096 missing values generated)

. gen double cg_re_2006      = h8arles - h7arles
(10,096 missing values generated)

. gen double cg_bus_2006     = h8absns - h7absns
(10,096 missing values generated)

. gen double cg_ira_2006     = h8aira  - h7aira
(10,096 missing values generated)

. gen double cg_stk_2006     = h8astck - h7astck
(10,096 missing values generated)

. gen double cg_bond_2006    = h8abond - h7abond
(10,096 missing values generated)

. gen double cg_chck_2006    = h8achck - h7achck
(10,096 missing values generated)

. gen double cg_cd_2006      = h8acd   - h7acd
(10,096 missing values generated)

. gen double cg_veh_2006     = h8atran - h7atran
(10,096 missing values generated)

. gen double cg_oth_2006     = h8aothr - h7aothr
(10,096 missing values generated)

. 
. di as txt "Capital gains components (2004->2006) summaries:"
Capital gains components (2004->2006) summaries:

. summarize cg_pri_res_2006 cg_sec_res_2006 cg_re_2006 cg_bus_2006 cg_ira_2006 cg_stk_2006 c
> g_bond_2006 cg_chck_2006 cg_cd_2006 cg_veh_2006 cg_oth_2006

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
cg_pri_~2006 |      5,760    40006.22    215577.6   -8000000    4000000
cg_sec_~2006 |      5,760    7826.953    84080.24  -788165.5    1705000
  cg_re_2006 |      5,760    11843.92    209865.7   -3000000    4826910
 cg_bus_2006 |      5,760    12100.49      357489  -1.30e+07   1.00e+07
 cg_ira_2006 |      5,760    19808.18      265857   -1400000   1.66e+07
-------------+---------------------------------------------------------
 cg_stk_2006 |      5,760    3652.154    509129.2  -1.97e+07   2.80e+07
cg_bond_2006 |      5,760    -3093.06    112930.5   -3300000    1288280
cg_chck_2006 |      5,760    2107.159    77466.43   -1492000    1800000
  cg_cd_2006 |      5,760    5740.545     44970.3    -900000     650000
 cg_veh_2006 |      5,760    595.2538    21733.69    -400000     320000
-------------+---------------------------------------------------------
 cg_oth_2006 |      5,760    2583.031    172809.7   -4900000    9950000

. 
. * Total capital gains with missing logic (missing only if all components missing)
. capture drop cg_total_2006

. egen byte any_cg_2006 = rownonmiss(cg_pri_res_2006 cg_sec_res_2006 cg_re_2006 cg_bus_2006 
> cg_ira_2006 cg_stk_2006 cg_bond_2006 cg_chck_2006 cg_cd_2006 cg_veh_2006 cg_oth_2006)

. gen double cg_total_2006 = .
(15,856 missing values generated)

. replace cg_total_2006 = cond(missing(cg_pri_res_2006),0,cg_pri_res_2006) + ///
>                         cond(missing(cg_sec_res_2006),0,cg_sec_res_2006) + ///
>                         cond(missing(cg_re_2006),0,cg_re_2006) + ///
>                         cond(missing(cg_bus_2006),0,cg_bus_2006) + ///
>                         cond(missing(cg_ira_2006),0,cg_ira_2006) + ///
>                         cond(missing(cg_stk_2006),0,cg_stk_2006) + ///
>                         cond(missing(cg_bond_2006),0,cg_bond_2006) + ///
>                         cond(missing(cg_chck_2006),0,cg_chck_2006) + ///
>                         cond(missing(cg_cd_2006),0,cg_cd_2006) + ///
>                         cond(missing(cg_veh_2006),0,cg_veh_2006) + ///
>                         cond(missing(cg_oth_2006),0,cg_oth_2006) if any_cg_2006>0
(5,760 real changes made)

. drop any_cg_2006

. 
. di as txt "[summarize] y_c_2006, cg_total_2006, flow_total_2006"
[summarize] y_c_2006, cg_total_2006, flow_total_2006

. summarize y_c_2006 cg_total_2006 flow_total_2006

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    y_c_2006 |      5,878    20597.18    134416.6          0    6521043
cg_tota~2006 |      5,760    103170.8    801783.7  -2.21e+07   2.78e+07
flow_to~2006 |      3,275   -6153.089    248685.3  -1.16e+07    2243700

. 
. * Base: A_2004 + 0.5 * F_2006 (treat flows as 0 only when A_2004 is non-missing)
. capture drop base_2006

. gen double base_2006 = .
(15,856 missing values generated)

. replace base_2006 = a_2004 + 0.5 * cond(missing(flow_total_2006),0,flow_total_2006) if !mi
> ssing(a_2004)
(5,909 real changes made)

. label var base_2006 "Base for 2006 returns (A_2004 + 0.5*F_2006)"

. 
. di as txt "[summarize] base_2006"
[summarize] base_2006

. summarize base_2006, detail

         Base for 2006 returns (A_2004 + 0.5*F_2006)
-------------------------------------------------------------
      Percentiles      Smallest
 1%       -37500      -678347.5
 5%            0      -319997.5
10%         4900      -319997.5       Obs               5,909
25%        63000        -241200       Sum of wgt.       5,909

50%     210002.5                      Mean           482941.8
                        Largest       Std. dev.       1120405
75%     521709.9       1.67e+07
90%      1103303       2.59e+07       Variance       1.26e+12
95%      1657118       3.00e+07       Skewness       12.22423
99%      4159000       3.00e+07       Kurtosis       248.2561

. 
. * Period return and annualization (2-year)
. capture drop num_period_2006 r_period_2006 r_annual_2006 r_annual_2006_trim

. gen double num_period_2006 = cond(missing(y_c_2006),0,y_c_2006) + ///
>                              cond(missing(cg_total_2006),0,cg_total_2006) - ///
>                              cond(missing(flow_total_2006),0,flow_total_2006)

. egen byte __num06_has = rownonmiss(y_c_2006 cg_total_2006 flow_total_2006)

. replace num_period_2006 = . if __num06_has == 0
(9,978 real changes made, 9,978 to missing)

. drop __num06_has

. 
. gen double r_period_2006 = num_period_2006 / base_2006
(10,199 missing values generated)

. replace r_period_2006 = . if base_2006 < 10000
(551 real changes made, 551 to missing)

. 
. gen double r_annual_2006 = (1 + r_period_2006)^(1/2) - 1
(10,835 missing values generated)

. replace r_annual_2006 = . if missing(r_period_2006)
(0 real changes made)

. 
. * Trim 5% tails
. capture drop r_annual_2006_trim

. xtile __p_2006 = r_annual_2006 if !missing(r_annual_2006), n(100)

. gen double r_annual_2006_trim = r_annual_2006
(10,835 missing values generated)

. replace r_annual_2006_trim = . if __p_2006 <= 5 | __p_2006 > 95
(504 real changes made, 504 to missing)

. drop __p_2006

. 
. di as txt "[summarize] r_period_2006, r_annual_2006, r_annual_2006_trim"
[summarize] r_period_2006, r_annual_2006, r_annual_2006_trim

. summarize r_period_2006 r_annual_2006 r_annual_2006_trim

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
r_perio~2006 |      5,106    .5362711    2.688258  -10.16176   135.8529
r_annua~2006 |      5,021    .1614187    .4748977         -1   10.69842
r_an~06_trim |      4,517    .1295081    .2488542   -.408392   .8230332

. 
. * Excluding residential housing
. capture drop cg_total_2006_excl_res flow_total_2006_excl_res

. gen double flow_total_2006_excl_res = .
(15,856 missing values generated)

. egen byte any_flow06_excl = rownonmiss(flow_bus_2006 flow_re_2006 flow_stk_2006 flow_ira_2
> 006)

. replace flow_total_2006_excl_res = cond(missing(flow_bus_2006),0,flow_bus_2006) + ///
>                                    cond(missing(flow_re_2006),0,flow_re_2006) + ///
>                                    cond(missing(flow_stk_2006),0,flow_stk_2006) + ///
>                                    cond(missing(flow_ira_2006),0,flow_ira_2006) if any_flo
> w06_excl>0
(2,489 real changes made)

. drop any_flow06_excl

. 
. gen double cg_total_2006_excl_res = .
(15,856 missing values generated)

. egen byte any_cg06_excl = rownonmiss(cg_re_2006 cg_bus_2006 cg_ira_2006 cg_stk_2006 cg_bon
> d_2006 cg_chck_2006 cg_cd_2006 cg_veh_2006 cg_oth_2006)

. replace cg_total_2006_excl_res = cond(missing(cg_re_2006),0,cg_re_2006) + ///
>                                  cond(missing(cg_bus_2006),0,cg_bus_2006) + ///
>                                  cond(missing(cg_ira_2006),0,cg_ira_2006) + ///
>                                  cond(missing(cg_stk_2006),0,cg_stk_2006) + ///
>                                  cond(missing(cg_bond_2006),0,cg_bond_2006) + ///
>                                  cond(missing(cg_chck_2006),0,cg_chck_2006) + ///
>                                  cond(missing(cg_cd_2006),0,cg_cd_2006) + ///
>                                  cond(missing(cg_veh_2006),0,cg_veh_2006) + ///
>                                  cond(missing(cg_oth_2006),0,cg_oth_2006) if any_cg06_excl
> >0
(5,760 real changes made)

. drop any_cg06_excl

. 
. di as txt "EXCL-RES: cg_total_2006_excl_res and flow_total_2006_excl_res summaries:"
EXCL-RES: cg_total_2006_excl_res and flow_total_2006_excl_res summaries:

. summarize cg_total_2006_excl_res flow_total_2006_excl_res

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
cg_total_2.. |      5,760    55337.67      768819  -2.23e+07   2.77e+07
flow_total.. |      2,489    4739.227    98417.11   -1200000    1700005

. 
. * Use SAME base_2006
. capture drop num_period_2006_excl_res r_period_2006_excl_res r_annual_2006_excl_res r_annu
> al_2006_excl_res_trim

. gen double num_period_2006_excl_res = cond(missing(y_c_2006),0,y_c_2006) + ///
>                                       cond(missing(cg_total_2006_excl_res),0,cg_total_2006
> _excl_res) - ///
>                                       cond(missing(flow_total_2006_excl_res),0,flow_total_
> 2006_excl_res)

. egen byte __num06ex_has = rownonmiss(y_c_2006 cg_total_2006_excl_res flow_total_2006_excl_
> res)

. replace num_period_2006_excl_res = . if __num06ex_has == 0
(9,978 real changes made, 9,978 to missing)

. drop __num06ex_has

. 
. gen double r_period_2006_excl_res = num_period_2006_excl_res / base_2006
(10,199 missing values generated)

. replace r_period_2006_excl_res = . if base_2006 < 10000
(551 real changes made, 551 to missing)

. gen double r_annual_2006_excl_res = (1 + r_period_2006_excl_res)^(1/2) - 1
(10,779 missing values generated)

. replace r_annual_2006_excl_res = . if missing(r_period_2006_excl_res)
(0 real changes made)

. 
. * Trim 5% for excl-res
. xtile __p_ex06 = r_annual_2006_excl_res if !missing(r_annual_2006_excl_res), n(100)

. gen double r_annual_2006_excl_res_trim = r_annual_2006_excl_res
(10,779 missing values generated)

. replace r_annual_2006_excl_res_trim = . if __p_ex06 <= 5 | __p_ex06 > 95
(508 real changes made, 508 to missing)

. drop __p_ex06

. 
. di as txt "[summarize] r_period_2006_excl_res, r_annual_2006_excl_res, r_annual_2006_excl_
> res_trim"
[summarize] r_period_2006_excl_res, r_annual_2006_excl_res, r_annual_2006_excl_res_trim

. summarize r_period_2006_excl_res r_annual_2006_excl_res r_annual_2006_excl_res_trim

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
r_period_2.. |      5,106    .2938621    1.429127  -3.520324   57.53127
r_annual_2.. |      5,077    .0849466    .3548647         -1   6.650573
r_annual_2.. |      4,569    .0588537    .1777398  -.3109969   .5976829

. 
. * ---------------------------------------------------------------------
. * Prepare 2004 controls inline (married_2004, wealth_*_2004, age_2004, inlbrf_2004)
. * ---------------------------------------------------------------------
. di as txt "=== Preparing 2004 controls (inline) ==="
=== Preparing 2004 controls (inline) ===

. 
. * Marital status (2004): r7mstat -> married_2004
. capture confirm variable r7mstat

. if _rc {
.     di as error "ERROR: r7mstat not found"
.     exit 198
. }

. 
. capture drop married_2004

. gen byte married_2004 = .
(15,856 missing values generated)

. replace married_2004 = 1 if inlist(r7mstat, 1, 2)
(4,335 real changes made)

. replace married_2004 = 0 if inlist(r7mstat, 3, 4, 5, 6, 7, 8)
(1,571 real changes made)

. label define yesno 0 "no" 1 "yes", replace

. label values married_2004 yesno

. label var married_2004 "Married (r7mstat: 1 or 2) vs not married (3-8)"

. 
. di as txt "Marital status (2004) summary:"
Marital status (2004) summary:

. tab married_2004, missing

    Married |
(r7mstat: 1 |
   or 2) vs |
not married |
      (3-8) |      Freq.     Percent        Cum.
------------+-----------------------------------
         no |      1,571        9.91        9.91
        yes |      4,335       27.34       37.25
          . |      9,950       62.75      100.00
------------+-----------------------------------
      Total |     15,856      100.00

. 
. * Wealth percentile/deciles for 2004 using h7atotb
. capture confirm variable h7atotb

. if _rc {
.     di as error "ERROR: h7atotb not found"
.     exit 198
. }

. 
. capture drop wealth_rank_2004 wealth_pct_2004

. quietly count if !missing(h7atotb)

. local N_wealth04 = r(N)

. egen double wealth_rank_2004 = rank(h7atotb) if !missing(h7atotb)
(9,947 missing values generated)

. gen double wealth_pct_2004 = .
(15,856 missing values generated)

. replace wealth_pct_2004 = 100 * (wealth_rank_2004 - 1) / (`N_wealth04' - 1) if `N_wealth04
> ' > 1 & !missing(wealth_rank_2004)
(5,909 real changes made)

. replace wealth_pct_2004 = 50 if `N_wealth04' == 1 & !missing(wealth_rank_2004)
(0 real changes made)

. label variable wealth_pct_2004 "Wealth percentile (based on h7atotb)"

. 
. di as txt "Wealth percentile (2004) summary:"
Wealth percentile (2004) summary:

. summarize wealth_pct_2004

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
wealth_pc~04 |      5,909          50    28.87473   .0084631   99.99154

. 
. capture drop wealth_decile_2004

. xtile wealth_decile_2004 = h7atotb if !missing(h7atotb), n(10)

. label var wealth_decile_2004 "Wealth decile (1=lowest,10=highest)"

. 
. di as txt "Wealth decile distribution (2004):"
Wealth decile distribution (2004):

. tab wealth_decile_2004, missing

     Wealth |
     decile |
(1=lowest,1 |
 0=highest) |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        592        3.73        3.73
          2 |        590        3.72        7.45
          3 |        594        3.75       11.20
          4 |        588        3.71       14.91
          5 |        591        3.73       18.64
          6 |        592        3.73       22.37
          7 |        590        3.72       26.09
          8 |        591        3.73       29.82
          9 |        591        3.73       33.55
         10 |        590        3.72       37.27
          . |      9,947       62.73      100.00
------------+-----------------------------------
      Total |     15,856      100.00

. 
. forvalues d = 1/10 {
  2.     capture drop wealth_d`d'_2004
  3.     gen byte wealth_d`d'_2004 = wealth_decile_2004 == `d' if !missing(wealth_decile_200
> 4)
  4.     label values wealth_d`d'_2004 yesno
  5.     label var wealth_d`d'_2004 "Wealth decile `d' (2004)"
  6. }
(9,947 missing values generated)
(9,947 missing values generated)
(9,947 missing values generated)
(9,947 missing values generated)
(9,947 missing values generated)
(9,947 missing values generated)
(9,947 missing values generated)
(9,947 missing values generated)
(9,947 missing values generated)
(9,947 missing values generated)

. 
. * Age (2004): r7agey_b -> age_2004
. capture confirm variable r7agey_b

. if _rc {
.     di as error "ERROR: r7agey_b not found"
.     exit 198
. }

. 
. capture drop age_2004

. gen double age_2004 = r7agey_b
(9,947 missing values generated)

. label var age_2004 "Respondent age in 2004 (r7agey_b)"

. 
. di as txt "Age (2004) summary:"
Age (2004) summary:

. summarize age_2004

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    age_2004 |      5,909    59.41699    7.974258         24         87

. 
. * Employment (2004): r7inlbrf -> inlbrf_2004
. capture confirm variable r7inlbrf

. if _rc {
.     di as error "ERROR: r7inlbrf not found"
.     exit 198
. }

. 
. capture drop inlbrf_2004

. clonevar inlbrf_2004 = r7inlbrf
(9,952 missing values generated)

. label var inlbrf_2004 "Labor force status in 2004 (r7inlbrf)"

. 
. di as txt "Employment (2004) distribution:"
Employment (2004) distribution:

. tab inlbrf_2004, missing

          Labor force status in 2004 |
                          (r7inlbrf) |      Freq.     Percent        Cum.
-------------------------------------+-----------------------------------
                                0.no |      2,137       13.48       13.48
                               1.yes |      3,767       23.76       37.24
                                   . |      9,947       62.73       99.97
                .i=institutionalized |          2        0.01       99.98
                      .m=oth missing |          3        0.02      100.00
-------------------------------------+-----------------------------------
                               Total |     15,856      100.00

. 
. * ---------------------------------------------------------------------
. * Save back and print only overlap counts for all 9 years
. * ---------------------------------------------------------------------
. di as txt "=== Saving updated analysis dataset (with 2006 flows and returns) ==="
=== Saving updated analysis dataset (with 2006 flows and returns) ===

. 
. * Overlap only: All 9-year overlap (included/excl-res and trimmed)
. quietly count if !missing(r_annual_2022) & !missing(r_annual_2020) & !missing(r_annual_201
> 8) & !missing(r_annual_2016) & !missing(r_annual_2014) & !missing(r_annual_2012) & !missin
> g(r_annual_2010) & !missing(r_annual_2008) & !missing(r_annual_2006)

. di as txt "  All 9 years (included): " %9.0f r(N)
  All 9 years (included):      3654

. 
. quietly count if !missing(r_annual_2022_excl_res) & !missing(r_annual_2020_excl_res) & !mi
> ssing(r_annual_2018_excl_res) & !missing(r_annual_2016_excl_res) & !missing(r_annual_2014_
> excl_res) & !missing(r_annual_2012_excl_res) & !missing(r_annual_2010_excl_res) & !missing
> (r_annual_2008_excl_res) & !missing(r_annual_2006_excl_res)

. di as txt "  All 9 years (excl-res): " %9.0f r(N)
  All 9 years (excl-res):      3684

. 
. quietly count if !missing(r_annual_2022_trim) & !missing(r_annual_2020_trim) & !missing(r_
> annual_2018_trim) & !missing(r_annual_2016_trim) & !missing(r_annual_2014_trim) & !missing
> (r_annual_2012_trim) & !missing(r_annual_2010_trim) & !missing(r_annual_2008_trim) & !miss
> ing(r_annual_2006_trim)

. di as txt "  All 9 years (included, trimmed): " %9.0f r(N)
  All 9 years (included, trimmed):      2562

. 
. quietly count if !missing(r_annual_2022_excl_res_trim) & !missing(r_annual_2020_excl_res_t
> rim) & !missing(r_annual_2018_excl_res_trim) & !missing(r_annual_2016_excl_res_trim) & !mi
> ssing(r_annual_2014_excl_res_trim) & !missing(r_annual_2012_excl_res_trim) & !missing(r_an
> nual_2010_excl_res_trim) & !missing(r_annual_2008_excl_res_trim) & !missing(r_annual_2006_
> excl_res_trim)

. di as txt "  All 9 years (excl-res, trimmed): " %9.0f r(N)
  All 9 years (excl-res, trimmed):      2288

. 
. save "`out_ana'", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/randhrs1992_2022v1_STATA/_ran
    > dhrs1992_2022v1_analysis.dta saved

. di as txt "Saved: `out_ana'"
Saved: /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/randhrs1992_202
> 2v1_STATA/_randhrs1992_2022v1_analysis.dta

. 
. log close
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/randhrs19
> 92_2022v1_STATA/RAND_2006_merge_and_returns.log
  log type:  text
 closed on:   8 Oct 2025, 12:10:08
--------------------------------------------------------------------------------------------
