---------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/rand
> hrs1992_2022v1_STATA/RAND_2008_merge_and_returns.log
  log type:  text
 opened on:  17 Oct 2025, 18:59:07

. 
. set more off

. 
. * ---------------------------------------------------------------------
. * File paths
. * ---------------------------------------------------------------------
. local long_file "/Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Lon
> g/randhrs1992_2022v1_STATA/_randhrs1992_2022v1_analysis.dta"

. local raw_2008  "/Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAN
> D/_raw/2008/h08f3b_STATA/h08f3b.dta"

. local out_ana   "/Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Lon
> g/randhrs1992_2022v1_STATA/_randhrs1992_2022v1_analysis.dta"

. 
. * ---------------------------------------------------------------------
. * Load unified dataset and check key
. * ---------------------------------------------------------------------
. di as txt "=== Loading unified analysis dataset ==="
=== Loading unified analysis dataset ===

. capture confirm file `"`long_file'"'

. if _rc {
.     di as error "ERROR: unified analysis dataset not found -> `long_file'"
.     exit 198
. }

. use "`long_file'", clear

. capture confirm variable hhidpn

. if _rc {
.     di as error "ERROR: hhidpn not found in unified dataset"
.     exit 198
. }

. 
. * ---------------------------------------------------------------------
. * Load 2008 RAND fat file and extract flows
. * ---------------------------------------------------------------------
. di as txt "=== Loading 2008 RAND fat file ==="
=== Loading 2008 RAND fat file ===

. preserve

. capture confirm file `"`raw_2008'"'

. if _rc {
.     di as error "ERROR: RAW 2008 file not found -> `raw_2008'"
.     exit 198
. }

. use "`raw_2008'", clear

. capture confirm variable hhidpn

. if _rc {
.     di as error "ERROR: hhidpn not found in RAW 2008"
.     exit 198
. }

. 
. * 2008 flow variables per notes (LR* + LQ IRA triplet)
. local flow08 "lr050 lr055 lr063 lr064 lr072 lr030 lr035 lr045 lq171_1 lq171_2 lq171_3
>  lr007 lr013 lr024"

. 
. di as txt "Checking presence of 2008 flow variables..."
Checking presence of 2008 flow variables...

. foreach v of local flow08 {
  2.     capture confirm variable `v'
  3.     if _rc di as warn "  MISSING in 2008 RAW: `v'"
  4.     else  di as txt  "  OK in 2008 RAW: `v'"
  5. }
  OK in 2008 RAW: lr050
  OK in 2008 RAW: lr055
  OK in 2008 RAW: lr063
  OK in 2008 RAW: lr064
  OK in 2008 RAW: lr072
  OK in 2008 RAW: lr030
  OK in 2008 RAW: lr035
  OK in 2008 RAW: lr045
  OK in 2008 RAW: lq171_1
  OK in 2008 RAW: lq171_2
  OK in 2008 RAW: lq171_3
  OK in 2008 RAW: lr007
  OK in 2008 RAW: lr013
  OK in 2008 RAW: lr024

. 
. keep hhidpn `flow08'

. tempfile raw08_flows

. save "`raw08_flows'", replace
(file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_32628.000003 not found)
file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_32628.000003 saved as .dta
    format

. restore

. 
. * ---------------------------------------------------------------------
. * Merge flows into unified dataset
. * ---------------------------------------------------------------------
. di as txt "=== Merging 2008 flows into unified dataset ==="
=== Merging 2008 flows into unified dataset ===

. merge 1:1 hhidpn using "`raw08_flows'", keep(master match)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         9,887
        from master                     9,887  (_merge==1)
        from using                          0  (_merge==2)

    Matched                             5,969  (_merge==3)
    -----------------------------------------

. tab _merge

   Matching result from |
                  merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
        Master only (1) |      9,887       62.35       62.35
            Matched (3) |      5,969       37.65      100.00
------------------------+-----------------------------------
                  Total |     15,856      100.00

. drop _merge

. 
. * ---------------------------------------------------------------------
. * Clean special/miscodes for flow inputs (match later-year rules)
. * ---------------------------------------------------------------------
. local misscodes 999998 999999 9999999 9999998 99999998 99999999 999999999 999999998 9
> 999999999 9999999998 -8 -9 -9999999 -9999998 98 99

. foreach v of local flow08 {
  2.     capture confirm numeric variable `v'
  3.     if !_rc {
  4.         foreach mc of local misscodes {
  5.             quietly replace `v' = . if `v' == `mc'
  6.         }
  7.     }
  8. }

. 
. * ---------------------------------------------------------------------
. * Compute 2008 flow aggregates (suffix _2008)
. * ---------------------------------------------------------------------
. * lr063 direction and magnitude
. capture drop lr063_dir08

. gen byte lr063_dir08 = .
(15,856 missing values generated)

. replace lr063_dir08 = -1 if lr063 == 1
(85 real changes made)

. replace lr063_dir08 =  1 if lr063 == 2
(103 real changes made)

. replace lr063_dir08 =  0 if lr063 == 3
(132 real changes made)

. 
. capture drop flow_bus_2008

. gen double flow_bus_2008 = .
(15,856 missing values generated)

. replace flow_bus_2008 = lr055 - lr050 if !missing(lr055) & !missing(lr050)
(6 real changes made)

. replace flow_bus_2008 = lr055 if  missing(lr050) & !missing(lr055)
(25 real changes made)

. replace flow_bus_2008 = -lr050 if !missing(lr050) &  missing(lr055)
(133 real changes made)

. 
. capture drop flow_stk_private_2008

. gen double flow_stk_private_2008 = lr063_dir08 * lr064 if !missing(lr063_dir08) & !mi
> ssing(lr064)
(15,714 missing values generated)

. 
. capture drop flow_stk_public_2008

. gen double flow_stk_public_2008 = lr072 if !missing(lr072)
(14,242 missing values generated)

. 
. capture drop flow_stk_2008

. gen double flow_stk_2008 = cond(!missing(flow_stk_private_2008), flow_stk_private_200
> 8, 0) + ///
>                            cond(!missing(flow_stk_public_2008),  flow_stk_public_2008
> ,  0)

. replace flow_stk_2008 = . if missing(flow_stk_private_2008) & missing(flow_stk_public
> _2008)
(14,100 real changes made, 14,100 to missing)

. 
. capture drop flow_re_2008

. gen double flow_re_2008 = .
(15,856 missing values generated)

. replace flow_re_2008 = cond(missing(lr035),0,lr035) - ( cond(missing(lr030),0,lr030) 
> + cond(missing(lr045),0,lr045) ) if !missing(lr035) | !missing(lr030) | !missing(lr04
> 5)
(223 real changes made)

. 
. capture drop flow_ira_2008

. egen double flow_ira_2008 = rowtotal(lq171_1 lq171_2 lq171_3)

. replace flow_ira_2008 = . if missing(lq171_1) & missing(lq171_2) & missing(lq171_3)
(14,933 real changes made, 14,933 to missing)

. 
. capture drop flow_residences_2008

. gen double flow_residences_2008 = .
(15,856 missing values generated)

. replace flow_residences_2008 = cond(missing(lr013),0,lr013) - ( cond(missing(lr007),0
> ,lr007) + cond(missing(lr024),0,lr024) ) if !missing(lr013) | !missing(lr007) | !miss
> ing(lr024)
(1,477 real changes made)

. replace flow_residences_2008 = . if missing(lr013) & missing(lr007) & missing(lr024)
(0 real changes made)

. 
. capture drop flow_total_2008

. gen double flow_total_2008 = .
(15,856 missing values generated)

. egen byte any_flow_present08 = rownonmiss(flow_bus_2008 flow_re_2008 flow_stk_2008 fl
> ow_ira_2008 flow_residences_2008)

. replace flow_total_2008 = cond(missing(flow_bus_2008),0,flow_bus_2008) + ///
>                           cond(missing(flow_re_2008),0,flow_re_2008) + ///
>                           cond(missing(flow_stk_2008),0,flow_stk_2008) + ///
>                           cond(missing(flow_ira_2008),0,flow_ira_2008) + ///
>                           cond(missing(flow_residences_2008),0,flow_residences_2008) 
> ///
>                           if any_flow_present08 > 0
(3,168 real changes made)

. drop any_flow_present08

. 
. di as txt "Flows 2008 summaries:"
Flows 2008 summaries:

. summarize flow_bus_2008 flow_re_2008 flow_stk_2008 flow_ira_2008 flow_residences_2008
>  flow_total_2008

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
flow_bu~2008 |        164     5109.47    308917.7   -1400000    2000000
flow_re_2008 |        223   -13906.95    161604.5   -1000000     505000
flow_~k_2008 |      1,756   -193.2722    33958.57    -650000     310000
flow_ir~2008 |        923       19765    33345.59          0     338000
flow_resi~08 |      1,477   -28884.47    224033.3   -7000000     770000
-------------+---------------------------------------------------------
flow_to~2008 |      3,168   -8529.655    178583.4   -7000000    2000000

. 
. * ---------------------------------------------------------------------
. * Compute TOTAL RETURNS for 2008 (period 2006-2008)
. * ---------------------------------------------------------------------
. di as txt "=== Computing 2008 returns (2006-2008) ==="
=== Computing 2008 returns (2006-2008) ===

. 
. * Denominator base: A_{2006}
. capture drop a_2006

. gen double a_2006 = h8atotb
(9,978 missing values generated)

. label var a_2006 "Total net assets (A_2006 = h8atotb)"

. 
. * Capital income y^c_2008
. capture drop y_c_2008

. gen double y_c_2008 = h9icap
(9,887 missing values generated)

. label var y_c_2008 "Capital income 2008 (h9icap)"

. 
. * Capital gains per class: cg_class = V_2008 - V_2006
. capture drop cg_pri_res_2008 cg_sec_res_2008 cg_re_2008 cg_bus_2008 cg_ira_2008 cg_st
> k_2008 cg_bond_2008 cg_chck_2008 cg_cd_2008 cg_veh_2008 cg_oth_2008

. gen double cg_pri_res_2008 = h9atoth - h8atoth
(10,080 missing values generated)

. gen double cg_sec_res_2008 = h9anethb - h8anethb
(10,080 missing values generated)

. gen double cg_re_2008      = h9arles - h8arles
(10,080 missing values generated)

. gen double cg_bus_2008     = h9absns - h8absns
(10,080 missing values generated)

. gen double cg_ira_2008     = h9aira  - h8aira
(10,080 missing values generated)

. gen double cg_stk_2008     = h9astck - h8astck
(10,080 missing values generated)

. gen double cg_bond_2008    = h9abond - h8abond
(10,080 missing values generated)

. gen double cg_chck_2008    = h9achck - h8achck
(10,080 missing values generated)

. gen double cg_cd_2008      = h9acd   - h8acd
(10,080 missing values generated)

. gen double cg_veh_2008     = h9atran - h8atran
(10,080 missing values generated)

. gen double cg_oth_2008     = h9aothr - h8aothr
(10,080 missing values generated)

. 
. di as txt "Capital gains components (2006->2008) summaries:"
Capital gains components (2006->2008) summaries:

. summarize cg_pri_res_2008 cg_sec_res_2008 cg_re_2008 cg_bus_2008 cg_ira_2008 cg_stk_2
> 008 cg_bond_2008 cg_chck_2008 cg_cd_2008 cg_veh_2008 cg_oth_2008

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
cg_pri_~2008 |      5,776    5969.088    464858.3   -1229036   2.29e+07
cg_sec_~2008 |      5,776    1161.047    92216.27   -1510000    2000000
  cg_re_2008 |      5,776    6363.001    298888.2   -3500000    7975821
 cg_bus_2008 |      5,776   -7714.085    373784.8   -9900000    6689474
 cg_ira_2008 |      5,776    5949.929    259803.1  -1.63e+07    2720000
-------------+---------------------------------------------------------
 cg_stk_2008 |      5,776   -4484.718    436484.8  -2.62e+07    4998000
cg_bond_2008 |      5,776    2515.184    75397.18   -1223488    2500000
cg_chck_2008 |      5,776    850.2657    78858.41   -1900000     975000
  cg_cd_2008 |      5,776    4563.464    59259.26    -750000    1500000
 cg_veh_2008 |      5,776   -787.1574    21651.89    -360000   341191.2
-------------+---------------------------------------------------------
 cg_oth_2008 |      5,776   -1198.615      161198   -8000000    3000000

. 
. * Total capital gains with missing logic (missing only if all components missing)
. capture drop cg_total_2008

. egen byte any_cg_2008 = rownonmiss(cg_pri_res_2008 cg_sec_res_2008 cg_re_2008 cg_bus_
> 2008 cg_ira_2008 cg_stk_2008 cg_bond_2008 cg_chck_2008 cg_cd_2008 cg_veh_2008 cg_oth_
> 2008)

. gen double cg_total_2008 = .
(15,856 missing values generated)

. replace cg_total_2008 = cond(missing(cg_pri_res_2008),0,cg_pri_res_2008) + ///
>                         cond(missing(cg_sec_res_2008),0,cg_sec_res_2008) + ///
>                         cond(missing(cg_re_2008),0,cg_re_2008) + ///
>                         cond(missing(cg_bus_2008),0,cg_bus_2008) + ///
>                         cond(missing(cg_ira_2008),0,cg_ira_2008) + ///
>                         cond(missing(cg_stk_2008),0,cg_stk_2008) + ///
>                         cond(missing(cg_bond_2008),0,cg_bond_2008) + ///
>                         cond(missing(cg_chck_2008),0,cg_chck_2008) + ///
>                         cond(missing(cg_cd_2008),0,cg_cd_2008) + ///
>                         cond(missing(cg_veh_2008),0,cg_veh_2008) + ///
>                         cond(missing(cg_oth_2008),0,cg_oth_2008) if any_cg_2008>0
(5,776 real changes made)

. drop any_cg_2008

. 
. di as txt "[summarize] y_c_2008, cg_total_2008, flow_total_2008"
[summarize] y_c_2008, cg_total_2008, flow_total_2008

. summarize y_c_2008 cg_total_2008 flow_total_2008

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    y_c_2008 |      5,969    19869.97    79091.63          0    3000480
cg_tota~2008 |      5,776     13187.4    834224.9  -2.71e+07   1.47e+07
flow_to~2008 |      3,168   -8529.655    178583.4   -7000000    2000000

. 
. * Base: A_2006 + 0.5 * F_2008 (treat flows as 0 only when A_2006 is non-missing)
. capture drop base_2008

. gen double base_2008 = .
(15,856 missing values generated)

. replace base_2008 = a_2006 + 0.5 * cond(missing(flow_total_2008),0,flow_total_2008) i
> f !missing(a_2006)
(5,878 real changes made)

. label var base_2008 "Base for 2008 returns (A_2006 + 0.5*F_2008)"

. 
. di as txt "[summarize] base_2008"
[summarize] base_2008

. summarize base_2008, detail

         Base for 2008 returns (A_2006 + 0.5*F_2008)
-------------------------------------------------------------
      Percentiles      Smallest
 1%       -42000       -1000000
 5%            0       -1000000
10%         5000        -769100       Obs               5,878
25%        75000        -769100       Sum of wgt.       5,878

50%       256500                      Mean           583978.9
                        Largest       Std. dev.       1268970
75%     642502.5       2.12e+07
90%      1357350       2.40e+07       Variance       1.61e+12
95%      2036688       2.40e+07       Skewness       10.00611
99%      4916079       3.30e+07       Kurtosis       165.1557

. 
. * Period return and annualization (2-year)
. capture drop num_period_2008 r_period_2008 r_annual_2008 r_annual_trim_2008

. gen double num_period_2008 = cond(missing(y_c_2008),0,y_c_2008) + ///
>                              cond(missing(cg_total_2008),0,cg_total_2008) - ///
>                              cond(missing(flow_total_2008),0,flow_total_2008)

. egen byte __num08_has = rownonmiss(y_c_2008 cg_total_2008 flow_total_2008)

. replace num_period_2008 = . if __num08_has == 0
(9,887 real changes made, 9,887 to missing)

. drop __num08_has

. 
. gen double r_period_2008 = num_period_2008 / base_2008
(10,189 missing values generated)

. replace r_period_2008 = . if base_2008 < 10000
(555 real changes made, 555 to missing)

. 
. gen double r_annual_2008 = (1 + r_period_2008)^(1/2) - 1
(10,808 missing values generated)

. replace r_annual_2008 = . if missing(r_period_2008)
(0 real changes made)

. 
. * Trim 5% tails
. capture drop r_annual_trim_2008

. xtile __p_2008 = r_annual_2008 if !missing(r_annual_2008), n(100)

. gen double r_annual_trim_2008 = r_annual_2008
(10,808 missing values generated)

. replace r_annual_trim_2008 = . if __p_2008 <= 5 | __p_2008 > 95
(504 real changes made, 504 to missing)

. drop __p_2008

. 
. di as txt "[summarize] r_period_2008, r_annual_2008, r_annual_trim_2008"
[summarize] r_period_2008, r_annual_2008, r_annual_trim_2008

. summarize r_period_2008 r_annual_2008 r_annual_trim_2008

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
r_perio~2008 |      5,112    .2582628    1.463403  -9.818966   35.56906
r_ann~l_2008 |      5,048    .0605027    .3984405         -1   5.047236
r_ann~m_2008 |      4,544    .0337804    .2138087  -.4495592   .7118128

. 
. * Excluding residential housing
. capture drop cg_total_2008_excl_res flow_total_2008_excl_res

. gen double flow_total_2008_excl_res = .
(15,856 missing values generated)

. egen byte any_flow08_excl = rownonmiss(flow_bus_2008 flow_re_2008 flow_stk_2008 flow_
> ira_2008)

. replace flow_total_2008_excl_res = cond(missing(flow_bus_2008),0,flow_bus_2008) + ///
>                                    cond(missing(flow_re_2008),0,flow_re_2008) + ///
>                                    cond(missing(flow_stk_2008),0,flow_stk_2008) + ///
>                                    cond(missing(flow_ira_2008),0,flow_ira_2008) if an
> y_flow08_excl>0
(2,469 real changes made)

. drop any_flow08_excl

. 
. gen double cg_total_2008_excl_res = .
(15,856 missing values generated)

. egen byte any_cg08_excl = rownonmiss(cg_re_2008 cg_bus_2008 cg_ira_2008 cg_stk_2008 c
> g_bond_2008 cg_chck_2008 cg_cd_2008 cg_veh_2008 cg_oth_2008)

. replace cg_total_2008_excl_res = cond(missing(cg_re_2008),0,cg_re_2008) + ///
>                                  cond(missing(cg_bus_2008),0,cg_bus_2008) + ///
>                                  cond(missing(cg_ira_2008),0,cg_ira_2008) + ///
>                                  cond(missing(cg_stk_2008),0,cg_stk_2008) + ///
>                                  cond(missing(cg_bond_2008),0,cg_bond_2008) + ///
>                                  cond(missing(cg_chck_2008),0,cg_chck_2008) + ///
>                                  cond(missing(cg_cd_2008),0,cg_cd_2008) + ///
>                                  cond(missing(cg_veh_2008),0,cg_veh_2008) + ///
>                                  cond(missing(cg_oth_2008),0,cg_oth_2008) if any_cg08
> _excl>0
(5,776 real changes made)

. drop any_cg08_excl

. 
. di as txt "EXCL-RES: cg_total_2008_excl_res and flow_total_2008_excl_res summaries:"
EXCL-RES: cg_total_2008_excl_res and flow_total_2008_excl_res summaries:

. summarize cg_total_2008_excl_res flow_total_2008_excl_res

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
cg_total_2.. |      5,776    6057.269    782492.9  -2.71e+07   1.47e+07
flow_total.. |      2,469    6334.714    105418.8   -1999995    2000000

. 
. * Use SAME base_2008
. capture drop num_period_2008_excl_res r_period_2008_excl_res r_annual_excl_2008 r_ann
> ual_excl_trim_2008

. gen double num_period_2008_excl_res = cond(missing(y_c_2008),0,y_c_2008) + ///
>                                       cond(missing(cg_total_2008_excl_res),0,cg_total
> _2008_excl_res) - ///
>                                       cond(missing(flow_total_2008_excl_res),0,flow_t
> otal_2008_excl_res)

. egen byte __num08ex_has = rownonmiss(y_c_2008 cg_total_2008_excl_res flow_total_2008_
> excl_res)

. replace num_period_2008_excl_res = . if __num08ex_has == 0
(9,887 real changes made, 9,887 to missing)

. drop __num08ex_has

. 
. gen double r_period_2008_excl_res = num_period_2008_excl_res / base_2008
(10,189 missing values generated)

. replace r_period_2008_excl_res = . if base_2008 < 10000
(555 real changes made, 555 to missing)

. gen double r_annual_excl_2008 = (1 + r_period_2008_excl_res)^(1/2) - 1
(10,764 missing values generated)

. replace r_annual_excl_2008 = . if missing(r_period_2008_excl_res)
(0 real changes made)

. 
. * Trim 5% for excl-res
. xtile __p_ex08 = r_annual_excl_2008 if !missing(r_annual_excl_2008), n(100)

. gen double r_annual_excl_trim_2008 = r_annual_excl_2008
(10,764 missing values generated)

. replace r_annual_excl_trim_2008 = . if __p_ex08 <= 5 | __p_ex08 > 95
(509 real changes made, 509 to missing)

. drop __p_ex08

. 
. di as txt "[summarize] r_period_2008_excl_res, r_annual_excl_2008, r_annual_excl_trim
> _2008"
[summarize] r_period_2008_excl_res, r_annual_excl_2008, r_annual_excl_trim_2008

. summarize r_period_2008_excl_res r_annual_excl_2008 r_annual_excl_trim_2008

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
r_period_2.. |      5,112    .1745976    1.000549   -4.96118   29.36922
r_an~cl_2008 |      5,092    .0442468    .3015038         -1   4.510827
r_annual_e.. |      4,583    .0234978    .1515157  -.3210864   .5157786

. 
. * ---------------------------------------------------------------------
. * Prepare 2006 controls inline (married_2006, wealth_*_2006, age_2006, inlbrf_2006)
. * ---------------------------------------------------------------------
. di as txt "=== Preparing 2006 controls (inline) ==="
=== Preparing 2006 controls (inline) ===

. 
. * Marital status (2006): r8mstat -> married_2006
. capture confirm variable r8mstat

. if _rc {
.     di as error "ERROR: r8mstat not found"
.     exit 198
. }

. 
. capture drop married_2006

. gen byte married_2006 = .
(15,856 missing values generated)

. replace married_2006 = 1 if inlist(r8mstat, 1, 2)
(4,210 real changes made)

. replace married_2006 = 0 if inlist(r8mstat, 3, 4, 5, 6, 7, 8)
(1,668 real changes made)

. label define yesno 0 "no" 1 "yes", replace

. label values married_2006 yesno

. label var married_2006 "Married (r8mstat: 1 or 2) vs not married (3-8)"

. 
. di as txt "Marital status (2006) summary:"
Marital status (2006) summary:

. tab married_2006, missing

    Married |
(r8mstat: 1 |
   or 2) vs |
not married |
      (3-8) |      Freq.     Percent        Cum.
------------+-----------------------------------
         no |      1,668       10.52       10.52
        yes |      4,210       26.55       37.07
          . |      9,978       62.93      100.00
------------+-----------------------------------
      Total |     15,856      100.00

. 
. * Wealth percentile/deciles for 2006 using h8atotb
. capture confirm variable h8atotb

. if _rc {
.     di as error "ERROR: h8atotb not found"
.     exit 198
. }

. 
. capture drop wealth_rank_2006 wealth_pct_2006

. quietly count if !missing(h8atotb)

. local N_wealth06 = r(N)

. egen double wealth_rank_2006 = rank(h8atotb) if !missing(h8atotb)
(9,978 missing values generated)

. gen double wealth_pct_2006 = .
(15,856 missing values generated)

. replace wealth_pct_2006 = 100 * (wealth_rank_2006 - 1) / (`N_wealth06' - 1) if `N_wea
> lth06' > 1 & !missing(wealth_rank_2006)
(5,878 real changes made)

. replace wealth_pct_2006 = 50 if `N_wealth06' == 1 & !missing(wealth_rank_2006)
(0 real changes made)

. label variable wealth_pct_2006 "Wealth percentile (based on h8atotb)"

. 
. di as txt "Wealth percentile (2006) summary:"
Wealth percentile (2006) summary:

. summarize wealth_pct_2006

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
wealth_pc~06 |      5,878          50    28.87475   .0085077        100

. 
. capture drop wealth_decile_2006

. xtile wealth_decile_2006 = h8atotb if !missing(h8atotb), n(10)

. label var wealth_decile_2006 "Wealth decile (1=lowest,10=highest)"

. 
. di as txt "Wealth decile distribution (2006):"
Wealth decile distribution (2006):

. tab wealth_decile_2006, missing

     Wealth |
     decile |
(1=lowest,1 |
 0=highest) |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        589        3.71        3.71
          2 |        587        3.70        7.42
          3 |        589        3.71       11.13
          4 |        589        3.71       14.85
          5 |        590        3.72       18.57
          6 |        583        3.68       22.24
          7 |        588        3.71       25.95
          8 |        589        3.71       29.67
          9 |        587        3.70       33.37
         10 |        587        3.70       37.07
          . |      9,978       62.93      100.00
------------+-----------------------------------
      Total |     15,856      100.00

. 
. forvalues d = 1/10 {
  2.     capture drop wealth_d`d'_2006
  3.     gen byte wealth_d`d'_2006 = wealth_decile_2006 == `d' if !missing(wealth_decil
> e_2006)
  4.     label values wealth_d`d'_2006 yesno
  5.     label var wealth_d`d'_2006 "Wealth decile `d' (2006)"
  6. }
(9,978 missing values generated)
(9,978 missing values generated)
(9,978 missing values generated)
(9,978 missing values generated)
(9,978 missing values generated)
(9,978 missing values generated)
(9,978 missing values generated)
(9,978 missing values generated)
(9,978 missing values generated)
(9,978 missing values generated)

. 
. * Age (2006): r8agey_b -> age_2006
. capture confirm variable r8agey_b

. if _rc {
.     di as error "ERROR: r8agey_b not found"
.     exit 198
. }

. 
. capture drop age_2006

. gen double age_2006 = r8agey_b
(9,978 missing values generated)

. label var age_2006 "Respondent age in 2006 (r8agey_b)"

. 
. di as txt "Age (2006) summary:"
Age (2006) summary:

. summarize age_2006

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    age_2006 |      5,878    61.41664    8.031297         25         89

. 
. * Employment (2006): r8inlbrf -> inlbrf_2006
. capture confirm variable r8inlbrf

. if _rc {
.     di as error "ERROR: r8inlbrf not found"
.     exit 198
. }

. 
. capture drop inlbrf_2006

. clonevar inlbrf_2006 = r8inlbrf
(9,981 missing values generated)

. label var inlbrf_2006 "Labor force status in 2006 (r8inlbrf)"

. 
. di as txt "Employment (2006) distribution:"
Employment (2006) distribution:

. tab inlbrf_2006, missing

          Labor force status in 2006 |
                          (r8inlbrf) |      Freq.     Percent        Cum.
-------------------------------------+-----------------------------------
                                0.no |      2,425       15.29       15.29
                               1.yes |      3,450       21.76       37.05
                                   . |      9,978       62.93       99.98
                .i=institutionalized |          2        0.01       99.99
                      .m=oth missing |          1        0.01      100.00
-------------------------------------+-----------------------------------
                               Total |     15,856      100.00

. 
. * ---------------------------------------------------------------------
. * Save back and print only overlap counts for all 8 years
. * ---------------------------------------------------------------------
. di as txt "=== Saving updated analysis dataset (with 2008 flows and returns) ==="
=== Saving updated analysis dataset (with 2008 flows and returns) ===

. 
. * Overlap only: All 8-year overlap (included/excl-res and trimmed)
. quietly count if !missing(r_annual_2022) & !missing(r_annual_2020) & !missing(r_annua
> l_2018) & !missing(r_annual_2016) & !missing(r_annual_2014) & !missing(r_annual_2012)
>  & !missing(r_annual_2010) & !missing(r_annual_2008)

. di as txt "  All 8 years (included): " %9.0f r(N)
  All 8 years (included):      3753

. 
. quietly count if !missing(r_annual_excl_2022) & !missing(r_annual_excl_2020) & !missi
> ng(r_annual_excl_2018) & !missing(r_annual_excl_2016) & !missing(r_annual_excl_2014) 
> & !missing(r_annual_excl_2012) & !missing(r_annual_excl_2010) & !missing(r_annual_exc
> l_2008)

. di as txt "  All 8 years (excl-res): " %9.0f r(N)
  All 8 years (excl-res):      3799

. 
. quietly count if !missing(r_annual_trim_2022) & !missing(r_annual_trim_2020) & !missi
> ng(r_annual_trim_2018) & !missing(r_annual_trim_2016) & !missing(r_annual_trim_2014) 
> & !missing(r_annual_trim_2012) & !missing(r_annual_trim_2010) & !missing(r_annual_tri
> m_2008)

. di as txt "  All 8 years (included, trimmed): " %9.0f r(N)
  All 8 years (included, trimmed):      2740

. 
. quietly count if !missing(r_annual_excl_trim_2022) & !missing(r_annual_excl_trim_2020
> ) & !missing(r_annual_excl_trim_2018) & !missing(r_annual_excl_trim_2016) & !missing(
> r_annual_excl_trim_2014) & !missing(r_annual_excl_trim_2012) & !missing(r_annual_excl
> _trim_2010) & !missing(r_annual_excl_trim_2008)

. di as txt "  All 8 years (excl-res, trimmed): " %9.0f r(N)
  All 8 years (excl-res, trimmed):      2499

. 
. save "`out_ana'", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/randhrs1992_2022v1_STATA
    > /_randhrs1992_2022v1_analysis.dta saved

. di as txt "Saved: `out_ana'"
Saved: /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/randhrs199
> 2_2022v1_STATA/_randhrs1992_2022v1_analysis.dta

. 
. log close
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/rand
> hrs1992_2022v1_STATA/RAND_2008_merge_and_returns.log
  log type:  text
 closed on:  17 Oct 2025, 18:59:11
---------------------------------------------------------------------------------------
