-------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data
> /HRS_Long/randhrs1992_2022v1_STATA/RAND_2002_merge_and_returns.log
  log type:  text
 opened on:   4 Nov 2025, 13:27:12

. 
. set more off

. 
. * ---------------------------------------------------------------------
. * File paths
. * ---------------------------------------------------------------------
. local long_file "/Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Cod
> e/Data/HRS_Long/randhrs1992_2022v1_STATA/_randhrs1992_2022v1_analysis.d
> ta"

. local raw_2002  "/Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Cod
> e/Data/HRS_RAND/_raw/2002/h02f2c_STATA/h02f2c.dta"

. local out_ana   "/Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Cod
> e/Data/HRS_Long/randhrs1992_2022v1_STATA/_randhrs1992_2022v1_analysis.d
> ta"

. 
. * ---------------------------------------------------------------------
. * Load unified dataset and check key
. * ---------------------------------------------------------------------
. di as txt "=== Loading unified analysis dataset ==="
=== Loading unified analysis dataset ===

. capture confirm file `"`long_file'"'

. if _rc {
.     di as error "ERROR: unified analysis dataset not found -> `long_fil
> e'"
.     exit 198
. }

. use "`long_file'", clear

. capture confirm variable hhidpn

. if _rc {
.     di as error "ERROR: hhidpn not found in unified dataset"
.     exit 198
. }

. 
. * ---------------------------------------------------------------------
. * Load 2002 RAND fat file and extract flows
. * ---------------------------------------------------------------------
. di as txt "=== Loading 2002 RAND fat file ==="
=== Loading 2002 RAND fat file ===

. preserve

. capture confirm file `"`raw_2002'"'

. if _rc {
.     di as error "ERROR: RAW 2002 file not found -> `raw_2002'"
.     exit 198
. }

. use "`raw_2002'", clear

. capture confirm variable hhidpn

. if _rc {
.     di as error "ERROR: hhidpn not found in RAW 2002"
.     exit 198
. }

. 
. * 2002 flow variables per notes (HR* + HQ IRA triplet)
. local flow02 "hr050 hr055 hr063 hr064 hr072 hr030 hr035 hr045 hq171_1 h
> q171_2 hq171_3 hr007 hr013 hr024"

. 
. di as txt "Checking presence of 2002 flow variables..."
Checking presence of 2002 flow variables...

. foreach v of local flow02 {
  2.     capture confirm variable `v'
  3.     if _rc di as warn "  MISSING in 2002 RAW: `v'"
  4.     else  di as txt  "  OK in 2002 RAW: `v'"
  5. }
  OK in 2002 RAW: hr050
  OK in 2002 RAW: hr055
  OK in 2002 RAW: hr063
  OK in 2002 RAW: hr064
  OK in 2002 RAW: hr072
  OK in 2002 RAW: hr030
  OK in 2002 RAW: hr035
  OK in 2002 RAW: hr045
  OK in 2002 RAW: hq171_1
  OK in 2002 RAW: hq171_2
  OK in 2002 RAW: hq171_3
  OK in 2002 RAW: hr007
  OK in 2002 RAW: hr013
  OK in 2002 RAW: hr024

. 
. keep hhidpn `flow02'

. tempfile raw02_flows

. save "`raw02_flows'", replace
(file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_43292.000003
    not found)
file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_43292.000003
    saved as .dta format

. restore

. 
. * ---------------------------------------------------------------------
. * Merge flows into unified dataset
. * ---------------------------------------------------------------------
. di as txt "=== Merging 2002 flows into unified dataset ==="
=== Merging 2002 flows into unified dataset ===

. merge 1:1 hhidpn using "`raw02_flows'", keep(master match)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        11,702
        from master                    11,702  (_merge==1)
        from using                          0  (_merge==2)

    Matched                             4,154  (_merge==3)
    -----------------------------------------

. tab _merge

   Matching result from |
                  merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
        Master only (1) |     11,702       73.80       73.80
            Matched (3) |      4,154       26.20      100.00
------------------------+-----------------------------------
                  Total |     15,856      100.00

. drop _merge

. 
. * ---------------------------------------------------------------------
. * Clean special/miscodes for flow inputs
. * ---------------------------------------------------------------------
. local misscodes 999998 999999 9999999 9999998 99999998 99999999 9999999
> 99 999999998 9999999999 9999999998 -8 -9 -9999999 -9999998 98 99

. foreach v of local flow02 {
  2.     capture confirm numeric variable `v'
  3.     if !_rc {
  4.         foreach mc of local misscodes {
  5.             quietly replace `v' = . if `v' == `mc'
  6.         }
  7.     }
  8. }

. 
. * ---------------------------------------------------------------------
. * Compute 2002 flow aggregates (suffix _2002)
. * ---------------------------------------------------------------------
. * hr063 direction and magnitude
. capture drop hr063_dir02

. gen byte hr063_dir02 = .
(15,856 missing values generated)

. replace hr063_dir02 = -1 if hr063 == 1
(92 real changes made)

. replace hr063_dir02 =  1 if hr063 == 2
(79 real changes made)

. replace hr063_dir02 =  0 if hr063 == 3
(103 real changes made)

. 
. capture drop flow_bus_2002

. gen double flow_bus_2002 = .
(15,856 missing values generated)

. replace flow_bus_2002 = hr055 - hr050 if !missing(hr055) & !missing(hr0
> 50)
(3 real changes made)

. replace flow_bus_2002 = hr055 if  missing(hr050) & !missing(hr055)
(13 real changes made)

. replace flow_bus_2002 = -hr050 if !missing(hr050) &  missing(hr055)
(86 real changes made)

. 
. capture drop flow_stk_private_2002

. gen double flow_stk_private_2002 = hr063_dir02 * hr064 if !missing(hr06
> 3_dir02) & !missing(hr064)
(15,738 missing values generated)

. 
. capture drop flow_stk_public_2002

. gen double flow_stk_public_2002 = hr072 if !missing(hr072)
(14,476 missing values generated)

. 
. capture drop flow_stk_2002

. gen double flow_stk_2002 = cond(!missing(flow_stk_private_2002), flow_s
> tk_private_2002, 0) + ///
>                            cond(!missing(flow_stk_public_2002),  flow_s
> tk_public_2002,  0)

. replace flow_stk_2002 = . if missing(flow_stk_private_2002) & missing(f
> low_stk_public_2002)
(14,358 real changes made, 14,358 to missing)

. 
. capture drop flow_re_2002

. gen double flow_re_2002 = .
(15,856 missing values generated)

. replace flow_re_2002 = cond(missing(hr035),0,hr035) - ( cond(missing(hr
> 030),0,hr030) + cond(missing(hr045),0,hr045) ) if !missing(hr035) | !mi
> ssing(hr030) | !missing(hr045)
(265 real changes made)

. 
. capture drop flow_ira_2002

. egen double flow_ira_2002 = rowtotal(hq171_1 hq171_2 hq171_3)

. replace flow_ira_2002 = . if missing(hq171_1) & missing(hq171_2) & miss
> ing(hq171_3)
(15,408 real changes made, 15,408 to missing)

. 
. capture drop flow_residences_2002

. gen double flow_residences_2002 = .
(15,856 missing values generated)

. replace flow_residences_2002 = cond(missing(hr013),0,hr013) - ( cond(mi
> ssing(hr007),0,hr007) + cond(missing(hr024),0,hr024) ) if !missing(hr01
> 3) | !missing(hr007) | !missing(hr024)
(1,131 real changes made)

. replace flow_residences_2002 = . if missing(hr013) & missing(hr007) & m
> issing(hr024)
(0 real changes made)

. 
. capture drop flow_total_2002

. gen double flow_total_2002 = .
(15,856 missing values generated)

. egen byte any_flow_present02 = rownonmiss(flow_bus_2002 flow_re_2002 fl
> ow_stk_2002 flow_ira_2002 flow_residences_2002)

. replace flow_total_2002 = cond(missing(flow_bus_2002),0,flow_bus_2002) 
> + ///
>                           cond(missing(flow_re_2002),0,flow_re_2002) + 
> ///
>                           cond(missing(flow_stk_2002),0,flow_stk_2002) 
> + ///
>                           cond(missing(flow_ira_2002),0,flow_ira_2002) 
> + ///
>                           cond(missing(flow_residences_2002),0,flow_res
> idences_2002) ///
>                           if any_flow_present02 > 0
(2,390 real changes made)

. drop any_flow_present02

. 
. di as txt "Flows 2002 summaries:"
Flows 2002 summaries:

. summarize flow_bus_2002 flow_re_2002 flow_stk_2002 flow_ira_2002 flow_r
> esidences_2002 flow_total_2002

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
flow_bu~2002 |        102   -25584.31    95646.21    -690000     200000
flow_re_2002 |        265   -13124.15    158906.4    -760000     875000
flow_~k_2002 |      1,498   -853.1696    33347.14    -500000     700000
flow_ir~2002 |        448    22297.19    36342.68         34     280000
flow_resi~02 |      1,131   -17116.48    113398.9    -700000    1500000
-------------+---------------------------------------------------------
flow_to~2002 |      2,390   -7002.154    106664.4   -1399000    1507500

. 
. * ---------------------------------------------------------------------
. * Compute TOTAL RETURNS for 2002 (period 2000-2002)
. * ---------------------------------------------------------------------
. di as txt "=== Computing 2002 returns (2000-2002) ==="
=== Computing 2002 returns (2000-2002) ===

. 
. * Denominator base: A_{2000}
. capture drop a_2000

. gen double a_2000 = h5atotb
(11,799 missing values generated)

. label var a_2000 "Total net assets (A_2000 = h5atotb)"

. 
. * Capital income y^c_2002
. capture drop y_c_2002

. gen double y_c_2002 = h6icap
(11,702 missing values generated)

. label var y_c_2002 "Capital income 2002 (h6icap)"

. 
. * Capital gains per class: cg_class = V_2002 - V_2000
. capture drop cg_pri_res_2002 cg_sec_res_2002 cg_re_2002 cg_bus_2002 cg_
> ira_2002 cg_stk_2002 cg_bond_2002 cg_chck_2002 cg_cd_2002 cg_veh_2002 c
> g_oth_2002

. gen double cg_pri_res_2002 = h6atoth - h5atoth
(11,870 missing values generated)

. gen double cg_sec_res_2002 = h6anethb - h5anethb
(11,870 missing values generated)

. gen double cg_re_2002      = h6arles - h5arles
(11,870 missing values generated)

. gen double cg_bus_2002     = h6absns - h5absns
(11,870 missing values generated)

. gen double cg_ira_2002     = h6aira  - h5aira
(11,870 missing values generated)

. gen double cg_stk_2002     = h6astck - h5astck
(11,870 missing values generated)

. gen double cg_bond_2002    = h6abond - h5abond
(11,870 missing values generated)

. gen double cg_chck_2002    = h6achck - h5achck
(11,870 missing values generated)

. gen double cg_cd_2002      = h6acd   - h5acd
(11,870 missing values generated)

. gen double cg_veh_2002     = h6atran - h5atran
(11,870 missing values generated)

. gen double cg_oth_2002     = h6aothr - h5aothr
(11,870 missing values generated)

. 
. di as txt "Capital gains components (2000->2002) summaries:"
Capital gains components (2000->2002) summaries:

. summarize cg_pri_res_2002 cg_sec_res_2002 cg_re_2002 cg_bus_2002 cg_ira
> _2002 cg_stk_2002 cg_bond_2002 cg_chck_2002 cg_cd_2002 cg_veh_2002 cg_o
> th_2002

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
cg_pri_~2002 |      3,986    15867.93      276587  -1.39e+07    1300000
cg_sec_~2002 |      3,986      5950.3    80147.06    -730000    2200000
  cg_re_2002 |      3,986   -4110.645    337830.6  -1.88e+07    2000000
 cg_bus_2002 |      3,986    180.6254    201621.6   -4575390    4526032
 cg_ira_2002 |      3,986   -11204.89    223294.4  -1.16e+07    1396000
-------------+---------------------------------------------------------
 cg_stk_2002 |      3,986   -16057.28    317964.5   -9950000    2500000
cg_bond_2002 |      3,986    3023.101    92693.95   -1000400    3410000
cg_chck_2002 |      3,986    2682.895    55750.25    -800000     901000
  cg_cd_2002 |      3,986    927.4404    38908.48  -384492.3    1225000
 cg_veh_2002 |      3,986    1319.858    21255.56  -276261.9     500000
-------------+---------------------------------------------------------
 cg_oth_2002 |      3,986    30610.55     1490405    -980000   9.00e+07

. 
. * Total capital gains with missing logic (missing only if all component
> s missing)
. capture drop cg_total_2002

. egen byte any_cg_2002 = rownonmiss(cg_pri_res_2002 cg_sec_res_2002 cg_r
> e_2002 cg_bus_2002 cg_ira_2002 cg_stk_2002 cg_bond_2002 cg_chck_2002 cg
> _cd_2002 cg_veh_2002 cg_oth_2002)

. gen double cg_total_2002 = .
(15,856 missing values generated)

. replace cg_total_2002 = cond(missing(cg_pri_res_2002),0,cg_pri_res_2002
> ) + ///
>                         cond(missing(cg_sec_res_2002),0,cg_sec_res_2002
> ) + ///
>                         cond(missing(cg_re_2002),0,cg_re_2002) + ///
>                         cond(missing(cg_bus_2002),0,cg_bus_2002) + ///
>                         cond(missing(cg_ira_2002),0,cg_ira_2002) + ///
>                         cond(missing(cg_stk_2002),0,cg_stk_2002) + ///
>                         cond(missing(cg_bond_2002),0,cg_bond_2002) + //
> /
>                         cond(missing(cg_chck_2002),0,cg_chck_2002) + //
> /
>                         cond(missing(cg_cd_2002),0,cg_cd_2002) + ///
>                         cond(missing(cg_veh_2002),0,cg_veh_2002) + ///
>                         cond(missing(cg_oth_2002),0,cg_oth_2002) if any
> _cg_2002>0
(3,986 real changes made)

. drop any_cg_2002

. 
. di as txt "[summarize] y_c_2002, cg_total_2002, flow_total_2002"
[summarize] y_c_2002, cg_total_2002, flow_total_2002

. summarize y_c_2002 cg_total_2002 flow_total_2002

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    y_c_2002 |      4,154    16791.12    56498.77          0    1121304
cg_tota~2002 |      3,986    29189.89     1671760  -3.68e+07   8.94e+07
flow_to~2002 |      2,390   -7002.154    106664.4   -1399000    1507500

. 
. * Base: A_2000 + 0.5 * F_2002 (treat flows as 0 only when A_2000 is non
> -missing)
. capture drop base_2002

. gen double base_2002 = .
(15,856 missing values generated)

. replace base_2002 = a_2000 + 0.5 * cond(missing(flow_total_2002),0,flow
> _total_2002) if !missing(a_2000)
(4,057 real changes made)

. label var base_2002 "Base for 2002 returns (A_2000 + 0.5*F_2002)"

. 
. di as txt "[summarize] base_2002"
[summarize] base_2002

. summarize base_2002, detail

         Base for 2002 returns (A_2000 + 0.5*F_2002)
-------------------------------------------------------------
      Percentiles      Smallest
 1%       -25700        -364500
 5%           60        -364500
10%        10200        -112000       Obs               4,057
25%        63690         -92000       Sum of wgt.       4,057

50%     185002.5                      Mean           438256.4
                        Largest       Std. dev.       1082233
75%       469500       1.07e+07
90%       985950       1.27e+07       Variance       1.17e+12
95%      1552003       2.61e+07       Skewness        18.1513
99%      3774003       4.06e+07       Kurtosis       561.0427

. 
. * Period return and annualization (2-year)
. capture drop num_period_2002 r_period_2002 r_annual_2002 r_annual_trim_
> 2002

. gen double num_period_2002 = cond(missing(y_c_2002),0,y_c_2002) + ///
>                              cond(missing(cg_total_2002),0,cg_total_200
> 2) - ///
>                              cond(missing(flow_total_2002),0,flow_total
> _2002)

. egen byte __num02_has = rownonmiss(y_c_2002 cg_total_2002 flow_total_20
> 02)

. replace num_period_2002 = . if __num02_has == 0
(11,702 real changes made, 11,702 to missing)

. drop __num02_has

. 
. gen double r_period_2002 = num_period_2002 / base_2002
(11,922 missing values generated)

. replace r_period_2002 = . if base_2002 < 10000
(332 real changes made, 332 to missing)

. 
. gen double r_annual_2002 = (1 + r_period_2002)^(1/2) - 1
(12,283 missing values generated)

. replace r_annual_2002 = . if missing(r_period_2002)
(0 real changes made)

. 
. * Trim 5% tails
. capture drop r_annual_trim_2002

. xtile __p_2002 = r_annual_2002 if !missing(r_annual_2002), n(100)

. gen double r_annual_trim_2002 = r_annual_2002
(12,283 missing values generated)

. replace r_annual_trim_2002 = . if __p_2002 <= 5 | __p_2002 > 95
(357 real changes made, 357 to missing)

. drop __p_2002

. 
. di as txt "[summarize] r_period_2002, r_annual_2002, r_annual_trim_2002
> "
[summarize] r_period_2002, r_annual_2002, r_annual_trim_2002

. summarize r_period_2002 r_annual_2002 r_annual_trim_2002

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
r_perio~2002 |      3,602    .4383931    2.354757         -3   65.94952
r_ann~l_2002 |      3,573    .1128267    .4641794         -1   7.182269
r_ann~m_2002 |      3,216    .0767754    .2404192  -.4059071   .7854029

. 
. * Excluding residential housing
. capture drop cg_total_2002_excl_res flow_total_2002_excl_res

. gen double flow_total_2002_excl_res = .
(15,856 missing values generated)

. egen byte any_flow02_excl = rownonmiss(flow_bus_2002 flow_re_2002 flow_
> stk_2002 flow_ira_2002)

. replace flow_total_2002_excl_res = cond(missing(flow_bus_2002),0,flow_b
> us_2002) + ///
>                                    cond(missing(flow_re_2002),0,flow_re
> _2002) + ///
>                                    cond(missing(flow_stk_2002),0,flow_s
> tk_2002) + ///
>                                    cond(missing(flow_ira_2002),0,flow_i
> ra_2002) if any_flow02_excl>0
(1,887 real changes made)

. drop any_flow02_excl

. 
. gen double cg_total_2002_excl_res = .
(15,856 missing values generated)

. egen byte any_cg02_excl = rownonmiss(cg_re_2002 cg_bus_2002 cg_ira_2002
>  cg_stk_2002 cg_bond_2002 cg_chck_2002 cg_cd_2002 cg_veh_2002 cg_oth_20
> 02)

. replace cg_total_2002_excl_res = cond(missing(cg_re_2002),0,cg_re_2002)
>  + ///
>                                  cond(missing(cg_bus_2002),0,cg_bus_200
> 2) + ///
>                                  cond(missing(cg_ira_2002),0,cg_ira_200
> 2) + ///
>                                  cond(missing(cg_stk_2002),0,cg_stk_200
> 2) + ///
>                                  cond(missing(cg_bond_2002),0,cg_bond_2
> 002) + ///
>                                  cond(missing(cg_chck_2002),0,cg_chck_2
> 002) + ///
>                                  cond(missing(cg_cd_2002),0,cg_cd_2002)
>  + ///
>                                  cond(missing(cg_veh_2002),0,cg_veh_200
> 2) + ///
>                                  cond(missing(cg_oth_2002),0,cg_oth_200
> 2) if any_cg02_excl>0
(3,986 real changes made)

. drop any_cg02_excl

. 
. di as txt "EXCL-RES: cg_total_2002_excl_res and flow_total_2002_excl_re
> s summaries:"
EXCL-RES: cg_total_2002_excl_res and flow_total_2002_excl_res summaries:

. summarize cg_total_2002_excl_res flow_total_2002_excl_res

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
cg_total_2.. |      3,986     7371.66     1616131  -2.84e+07   8.94e+07
flow_total.. |      1,887     1390.35     75919.2   -1399000     787000

. 
. * Use SAME base_2002
. capture drop num_period_2002_excl_res r_period_2002_excl_res r_annual_e
> xcl_2002 r_annual_excl_trim_2002

. gen double num_period_2002_excl_res = cond(missing(y_c_2002),0,y_c_2002
> ) + ///
>                                       cond(missing(cg_total_2002_excl_r
> es),0,cg_total_2002_excl_res) - ///
>                                       cond(missing(flow_total_2002_excl
> _res),0,flow_total_2002_excl_res)

. egen byte __num02ex_has = rownonmiss(y_c_2002 cg_total_2002_excl_res fl
> ow_total_2002_excl_res)

. replace num_period_2002_excl_res = . if __num02ex_has == 0
(11,702 real changes made, 11,702 to missing)

. drop __num02ex_has

. 
. gen double r_period_2002_excl_res = num_period_2002_excl_res / base_200
> 2
(11,922 missing values generated)

. replace r_period_2002_excl_res = . if base_2002 < 10000
(332 real changes made, 332 to missing)

. gen double r_annual_excl_2002 = (1 + r_period_2002_excl_res)^(1/2) - 1
(12,263 missing values generated)

. replace r_annual_excl_2002 = . if missing(r_period_2002_excl_res)
(0 real changes made)

. 
. * Trim 5% for excl-res
. xtile __p_ex02 = r_annual_excl_2002 if !missing(r_annual_excl_2002), n(
> 100)

. gen double r_annual_excl_trim_2002 = r_annual_excl_2002
(12,263 missing values generated)

. replace r_annual_excl_trim_2002 = . if __p_ex02 <= 5 | __p_ex02 > 95
(359 real changes made, 359 to missing)

. drop __p_ex02

. 
. di as txt "[summarize] r_period_2002_excl_res, r_annual_excl_2002, r_an
> nual_excl_trim_2002"
[summarize] r_period_2002_excl_res, r_annual_excl_2002, r_annual_excl_tri
> m_2002

. summarize r_period_2002_excl_res r_annual_excl_2002 r_annual_excl_trim_
> 2002

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
r_period_2.. |      3,602    .2213208     1.50786  -2.531273   65.97904
r_an~cl_2002 |      3,593    .0493064    .3530702         -1   7.184072
r_annual_e.. |      3,234    .0236706    .1876628  -.3741738   .5758399

. 
. * ---------------------------------------------------------------------
. * Prepare 2000 controls inline (married_2000, wealth_*_2000, age_2000, 
> inlbrf_2000)
. * ---------------------------------------------------------------------
. di as txt "=== Preparing 2000 controls (inline) ==="
=== Preparing 2000 controls (inline) ===

. 
. * Marital status (2000): r5mstat -> married_2000
. capture confirm variable r5mstat

. if _rc {
.     di as error "ERROR: r5mstat not found"
.     exit 198
. }

. 
. capture drop married_2000

. gen byte married_2000 = .
(15,856 missing values generated)

. replace married_2000 = 1 if inlist(r5mstat, 1, 2)
(3,107 real changes made)

. replace married_2000 = 0 if inlist(r5mstat, 3, 4, 5, 6, 7, 8)
(945 real changes made)

. label define yesno 0 "no" 1 "yes", replace

. label values married_2000 yesno

. label var married_2000 "Married (r5mstat: 1 or 2) vs not married (3-8)"

. 
. di as txt "Marital status (2000) summary:"
Marital status (2000) summary:

. tab married_2000, missing

    Married |
(r5mstat: 1 |
   or 2) vs |
not married |
      (3-8) |      Freq.     Percent        Cum.
------------+-----------------------------------
         no |        945        5.96        5.96
        yes |      3,107       19.60       25.55
          . |     11,804       74.45      100.00
------------+-----------------------------------
      Total |     15,856      100.00

. 
. * Wealth percentile/deciles for 2000 using h5atotb
. capture confirm variable h5atotb

. if _rc {
.     di as error "ERROR: h5atotb not found"
.     exit 198
. }

. 
. capture drop wealth_rank_2000 wealth_pct_2000

. quietly count if !missing(h5atotb)

. local N_wealth00 = r(N)

. egen double wealth_rank_2000 = rank(h5atotb) if !missing(h5atotb)
(11,799 missing values generated)

. gen double wealth_pct_2000 = .
(15,856 missing values generated)

. replace wealth_pct_2000 = 100 * (wealth_rank_2000 - 1) / (`N_wealth00' 
> - 1) if `N_wealth00' > 1 & !missing(wealth_rank_2000)
(4,057 real changes made)

. replace wealth_pct_2000 = 50 if `N_wealth00' == 1 & !missing(wealth_ran
> k_2000)
(0 real changes made)

. label variable wealth_pct_2000 "Wealth percentile (based on h5atotb)"

. 
. di as txt "Wealth percentile (2000) summary:"
Wealth percentile (2000) summary:

. summarize wealth_pct_2000

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
wealth_pc~00 |      4,057          50    28.87813   .0123274        100

. 
. capture drop wealth_decile_2000

. xtile wealth_decile_2000 = h5atotb if !missing(h5atotb), n(10)

. label var wealth_decile_2000 "Wealth decile (1=lowest,10=highest)"

. 
. di as txt "Wealth decile distribution (2000):"
Wealth decile distribution (2000):

. tab wealth_decile_2000, missing

     Wealth |
     decile |
(1=lowest,1 |
 0=highest) |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        406        2.56        2.56
          2 |        406        2.56        5.12
          3 |        406        2.56        7.68
          4 |        411        2.59       10.27
          5 |        409        2.58       12.85
          6 |        400        2.52       15.38
          7 |        404        2.55       17.92
          8 |        405        2.55       20.48
          9 |        405        2.55       23.03
         10 |        405        2.55       25.59
          . |     11,799       74.41      100.00
------------+-----------------------------------
      Total |     15,856      100.00

. 
. forvalues d = 1/10 {
  2.     capture drop wealth_d`d'_2000
  3.     gen byte wealth_d`d'_2000 = wealth_decile_2000 == `d' if !missin
> g(wealth_decile_2000)
  4.     label values wealth_d`d'_2000 yesno
  5.     label var wealth_d`d'_2000 "Wealth decile `d' (2000)"
  6. }
(11,799 missing values generated)
(11,799 missing values generated)
(11,799 missing values generated)
(11,799 missing values generated)
(11,799 missing values generated)
(11,799 missing values generated)
(11,799 missing values generated)
(11,799 missing values generated)
(11,799 missing values generated)
(11,799 missing values generated)

. 
. * Age (2000): r5agey_b -> age_2000
. capture confirm variable r5agey_b

. if _rc {
.     di as error "ERROR: r5agey_b not found"
.     exit 198
. }

. 
. capture drop age_2000

. gen double age_2000 = r5agey_b
(11,799 missing values generated)

. label var age_2000 "Respondent age in 2000 (r5agey_b)"

. 
. di as txt "Age (2000) summary:"
Age (2000) summary:

. summarize age_2000

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    age_2000 |      4,057     58.6771    6.812887         23         83

. 
. * Employment (2000): r5inlbrf -> inlbrf_2000
. capture confirm variable r5inlbrf

. if _rc {
.     di as error "ERROR: r5inlbrf not found"
.     exit 198
. }

. 
. capture drop inlbrf_2000

. clonevar inlbrf_2000 = r5inlbrf
(11,802 missing values generated)

. label var inlbrf_2000 "Labor force status in 2000 (r5inlbrf)"

. 
. di as txt "Employment (2000) distribution:"
Employment (2000) distribution:

. tab inlbrf_2000, missing

          Labor force status in 2000 |
                          (r5inlbrf) |      Freq.     Percent        Cum.
-------------------------------------+-----------------------------------
                                0.no |      1,424        8.98        8.98
                               1.yes |      2,630       16.59       25.57
                                   . |     11,799       74.41       99.98
                .i=institutionalized |          2        0.01       99.99
                      .m=oth missing |          1        0.01      100.00
-------------------------------------+-----------------------------------
                               Total |     15,856      100.00

. 
. * ---------------------------------------------------------------------
. * Save back and print only overlap counts for all 11 years
. * ---------------------------------------------------------------------
. di as txt "=== Saving updated analysis dataset (with 2002 flows and ret
> urns) ==="
=== Saving updated analysis dataset (with 2002 flows and returns) ===

. 
. * Overlap only: All 11-year overlap (included/excl-res and trimmed)
. quietly count if !missing(r_annual_2022) & !missing(r_annual_2020) & !m
> issing(r_annual_2018) & !missing(r_annual_2016) & !missing(r_annual_201
> 4) & !missing(r_annual_2012) & !missing(r_annual_2010) & !missing(r_ann
> ual_2008) & !missing(r_annual_2006) & !missing(r_annual_2004) & !missin
> g(r_annual_2002)

. di as txt "  All 11 years (included): " %9.0f r(N)
  All 11 years (included):      2565

. 
. quietly count if !missing(r_annual_excl_2022) & !missing(r_annual_excl_
> 2020) & !missing(r_annual_excl_2018) & !missing(r_annual_excl_2016) & !
> missing(r_annual_excl_2014) & !missing(r_annual_excl_2012) & !missing(r
> _annual_excl_2010) & !missing(r_annual_excl_2008) & !missing(r_annual_e
> xcl_2006) & !missing(r_annual_excl_2004) & !missing(r_annual_excl_2002)

. di as txt "  All 11 years (excl-res): " %9.0f r(N)
  All 11 years (excl-res):      2596

. 
. quietly count if !missing(r_annual_trim_2022) & !missing(r_annual_trim_
> 2020) & !missing(r_annual_trim_2018) & !missing(r_annual_trim_2016) & !
> missing(r_annual_trim_2014) & !missing(r_annual_trim_2012) & !missing(r
> _annual_trim_2010) & !missing(r_annual_trim_2008) & !missing(r_annual_t
> rim_2006) & !missing(r_annual_trim_2004) & !missing(r_annual_trim_2002)

. di as txt "  All 11 years (included, trimmed): " %9.0f r(N)
  All 11 years (included, trimmed):      1706

. 
. quietly count if !missing(r_annual_excl_trim_2022) & !missing(r_annual_
> excl_trim_2020) & !missing(r_annual_excl_trim_2018) & !missing(r_annual
> _excl_trim_2016) & !missing(r_annual_excl_trim_2014) & !missing(r_annua
> l_excl_trim_2012) & !missing(r_annual_excl_trim_2010) & !missing(r_annu
> al_excl_trim_2008) & !missing(r_annual_excl_trim_2006) & !missing(r_ann
> ual_excl_trim_2004) & !missing(r_annual_excl_trim_2002)

. di as txt "  All 11 years (excl-res, trimmed): " %9.0f r(N)
  All 11 years (excl-res, trimmed):      1508

. 
. save "`out_ana'", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/randhrs199
    > 2_2022v1_STATA/_randhrs1992_2022v1_analysis.dta saved

. di as txt "Saved: `out_ana'"
Saved: /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_L
> ong/randhrs1992_2022v1_STATA/_randhrs1992_2022v1_analysis.dta

. 
. log close
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data
> /HRS_Long/randhrs1992_2022v1_STATA/RAND_2002_merge_and_returns.log
  log type:  text
 closed on:   4 Nov 2025, 13:27:17
-------------------------------------------------------------------------
