---------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/rand
> hrs1992_2022v1_STATA/RAND_2012_merge_and_returns.log
  log type:  text
 opened on:  17 Oct 2025, 18:58:58

. 
. set more off

. 
. * ---------------------------------------------------------------------
. * File paths
. * ---------------------------------------------------------------------
. local long_file "/Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Lon
> g/randhrs1992_2022v1_STATA/_randhrs1992_2022v1_analysis.dta"

. local raw_2012  "/Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_RAN
> D/_raw/2012/h12f3a_STATA/h12f3a.dta"

. local out_ana   "/Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Lon
> g/randhrs1992_2022v1_STATA/_randhrs1992_2022v1_analysis.dta"

. 
. * ---------------------------------------------------------------------
. * Load unified dataset and check key
. * ---------------------------------------------------------------------
. di as txt "=== Loading unified analysis dataset ==="
=== Loading unified analysis dataset ===

. capture confirm file "`long_file'"

. if _rc {
.     di as error "ERROR: unified analysis dataset not found -> `long_file'"
.     exit 198
. }

. use "`long_file'", clear

. capture confirm variable hhidpn

. if _rc {
.     di as error "ERROR: hhidpn not found in unified dataset"
.     exit 198
. }

. 
. * ---------------------------------------------------------------------
. * Load 2012 RAND fat file and extract flows
. * ---------------------------------------------------------------------
. di as txt "=== Loading 2012 RAND fat file ==="
=== Loading 2012 RAND fat file ===

. preserve

. capture confirm file "`raw_2012'"

. if _rc {
.     di as error "ERROR: RAW 2012 file not found -> `raw_2012'"
.     exit 198
. }

. use "`raw_2012'", clear

. capture confirm variable hhidpn

. if _rc {
.     di as error "ERROR: hhidpn not found in RAW 2012"
.     exit 198
. }

. 
. * 2012 flow variables per notes
. local flow12 "nr050 nr055 nr063 nr064 nr072 nr030 nr035 nr045 nq171_1 nq171_2 nq171_3
>  nr007 nr013 nr024"

. 
. di as txt "Checking presence of 2012 flow variables..."
Checking presence of 2012 flow variables...

. foreach v of local flow12 {
  2.     capture confirm variable `v'
  3.     if _rc di as warn "  MISSING in 2012 RAW: `v'"
  4.     else  di as txt  "  OK in 2012 RAW: `v'"
  5. }
  OK in 2012 RAW: nr050
  OK in 2012 RAW: nr055
  OK in 2012 RAW: nr063
  OK in 2012 RAW: nr064
  OK in 2012 RAW: nr072
  OK in 2012 RAW: nr030
  OK in 2012 RAW: nr035
  OK in 2012 RAW: nr045
  OK in 2012 RAW: nq171_1
  OK in 2012 RAW: nq171_2
  OK in 2012 RAW: nq171_3
  OK in 2012 RAW: nr007
  OK in 2012 RAW: nr013
  OK in 2012 RAW: nr024

. 
. keep hhidpn `flow12'

. tempfile raw12_flows

. save "`raw12_flows'", replace
(file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_32628.000003 not found)
file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_32628.000003 saved as .dta
    format

. restore

. 
. * ---------------------------------------------------------------------
. * Merge flows into unified dataset
. * ---------------------------------------------------------------------
. di as txt "=== Merging 2012 flows into unified dataset ==="
=== Merging 2012 flows into unified dataset ===

. merge 1:1 hhidpn using "`raw12_flows'", keep(master match)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         6,083
        from master                     6,083  (_merge==1)
        from using                          0  (_merge==2)

    Matched                             9,773  (_merge==3)
    -----------------------------------------

. tab _merge

   Matching result from |
                  merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
        Master only (1) |      6,083       38.36       38.36
            Matched (3) |      9,773       61.64      100.00
------------------------+-----------------------------------
                  Total |     15,856      100.00

. drop _merge

. 
. * ---------------------------------------------------------------------
. * Clean special/miscodes for flow inputs (mirror prior rules)
. * ---------------------------------------------------------------------
. local misscodes 999998 999999 9999999 9999998 99999998 99999999 999999999 999999998 9
> 999999999 9999999998 -8 -9 -9999999 -9999998

. foreach v of local flow12 {
  2.     capture confirm numeric variable `v'
  3.     if !_rc {
  4.         foreach mc of local misscodes {
  5.             quietly replace `v' = . if `v' == `mc'
  6.         }
  7.     }
  8. }

. 
. * ---------------------------------------------------------------------
. * Compute 2012 flow aggregates (suffix _2012)
. * ---------------------------------------------------------------------
. * nr063 direction and magnitude
. capture drop nr063_dir12

. gen byte nr063_dir12 = .
(15,856 missing values generated)

. replace nr063_dir12 = -1 if nr063 == 1
(94 real changes made)

. replace nr063_dir12 =  1 if nr063 == 2
(102 real changes made)

. replace nr063_dir12 =  0 if nr063 == 3
(164 real changes made)

. 
. capture drop flow_bus_2012

. gen double flow_bus_2012 = .
(15,856 missing values generated)

. replace flow_bus_2012 = nr055 - nr050 if !missing(nr055) & !missing(nr050)
(8 real changes made)

. replace flow_bus_2012 = nr055 if  missing(nr050) & !missing(nr055)
(33 real changes made)

. replace flow_bus_2012 = -nr050 if !missing(nr050) &  missing(nr055)
(163 real changes made)

. 
. capture drop flow_stk_private_2012

. gen double flow_stk_private_2012 = nr063_dir12 * nr064 if !missing(nr063_dir12) & !mi
> ssing(nr064)
(15,705 missing values generated)

. 
. capture drop flow_stk_public_2012

. gen double flow_stk_public_2012 = nr072 if !missing(nr072)
(13,941 missing values generated)

. 
. capture drop flow_stk_2012

. gen double flow_stk_2012 = cond(!missing(flow_stk_private_2012), flow_stk_private_201
> 2, 0) + ///
>                            cond(!missing(flow_stk_public_2012),  flow_stk_public_2012
> ,  0)

. replace flow_stk_2012 = . if missing(flow_stk_private_2012) & missing(flow_stk_public
> _2012)
(13,790 real changes made, 13,790 to missing)

. 
. capture drop flow_re_2012

. gen double flow_re_2012 = .
(15,856 missing values generated)

. replace flow_re_2012 = cond(missing(nr035),0,nr035) - ( cond(missing(nr030),0,nr030) 
> + cond(missing(nr045),0,nr045) ) if !missing(nr035) | !missing(nr030) | !missing(nr04
> 5)
(305 real changes made)

. 
. capture drop flow_ira_2012

. egen double flow_ira_2012 = rowtotal(nq171_1 nq171_2 nq171_3)

. replace flow_ira_2012 = . if missing(nq171_1) & missing(nq171_2) & missing(nq171_3)
(14,585 real changes made, 14,585 to missing)

. 
. capture drop flow_residences_2012

. gen double flow_residences_2012 = .
(15,856 missing values generated)

. replace flow_residences_2012 = cond(missing(nr013),0,nr013) - ( cond(missing(nr007),0
> ,nr007) + cond(missing(nr024),0,nr024) ) if !missing(nr013) | !missing(nr007) | !miss
> ing(nr024)
(1,819 real changes made)

. replace flow_residences_2012 = . if missing(nr013) & missing(nr007) & missing(nr024)
(0 real changes made)

. 
. capture drop flow_total_2012

. gen double flow_total_2012 = .
(15,856 missing values generated)

. egen byte any_flow_present12 = rownonmiss(flow_bus_2012 flow_re_2012 flow_stk_2012 fl
> ow_ira_2012 flow_residences_2012)

. replace flow_total_2012 = cond(missing(flow_bus_2012),0,flow_bus_2012) + ///
>                           cond(missing(flow_re_2012),0,flow_re_2012) + ///
>                           cond(missing(flow_stk_2012),0,flow_stk_2012) + ///
>                           cond(missing(flow_ira_2012),0,flow_ira_2012) + ///
>                           cond(missing(flow_residences_2012),0,flow_residences_2012) 
> ///
>                           if any_flow_present12 > 0
(4,054 real changes made)

. drop any_flow_present12

. 
. di as txt "Flows 2012 summaries:"
Flows 2012 summaries:

. summarize flow_bus_2012 flow_re_2012 flow_stk_2012 flow_ira_2012 flow_residences_2012
>  flow_total_2012

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
flow_bu~2012 |        204    9399.201      139084    -600000    1000000
flow_re_2012 |        305   -18099.12    198542.8    -600000    1600000
flow_~k_2012 |      2,066    143.2744    23144.88    -250000     500000
flow_ir~2012 |      1,271    19166.35    34138.94          0     490000
flow_resi~12 |      1,819   -18220.16    123770.4    -995000    1500000
-------------+---------------------------------------------------------
flow_to~2012 |      4,054    -2981.95    110559.9   -1470000    1600000

. 
. * ---------------------------------------------------------------------
. * Compute TOTAL RETURNS for 2012 (period 2010-2012)
. * ---------------------------------------------------------------------
. di as txt "=== Computing 2012 returns (2010-2012) ==="
=== Computing 2012 returns (2010-2012) ===

. 
. * Denominator base: A_{2010}
. capture drop a_2010

. gen double a_2010 = h10atotb
(6,172 missing values generated)

. label var a_2010 "Total net assets (A_2010 = h10atotb)"

. 
. * Capital income y^c_2012
. capture drop y_c_2012

. gen double y_c_2012 = h11icap
(6,083 missing values generated)

. label var y_c_2012 "Capital income 2012 (h11icap)"

. 
. * Capital gains per class: cg_class = V_2012 - V_2010
. capture drop cg_pri_res_2012 cg_sec_res_2012 cg_re_2012 cg_bus_2012 cg_ira_2012 cg_st
> k_2012 cg_bond_2012 cg_chck_2012 cg_cd_2012 cg_veh_2012 cg_oth_2012

. gen double cg_pri_res_2012 = h11atoth - h10atoth
(6,320 missing values generated)

. 
. gen double cg_sec_res_2012 = h11anethb - h10anethb
(6,320 missing values generated)

. 
. gen double cg_re_2012      = h11arles - h10arles
(6,320 missing values generated)

. 
. gen double cg_bus_2012     = h11absns - h10absns
(6,320 missing values generated)

. 
. gen double cg_ira_2012     = h11aira  - h10aira
(6,320 missing values generated)

. 
. gen double cg_stk_2012     = h11astck - h10astck
(6,320 missing values generated)

. 
. gen double cg_bond_2012    = h11abond - h10abond
(6,320 missing values generated)

. 
. gen double cg_chck_2012    = h11achck - h10achck
(6,320 missing values generated)

. 
. gen double cg_cd_2012      = h11acd   - h10acd
(6,320 missing values generated)

. 
. gen double cg_veh_2012     = h11atran - h10atran
(6,320 missing values generated)

. 
. gen double cg_oth_2012     = h11aothr - h10aothr
(6,320 missing values generated)

. 
. * Summaries of each capital gains component
. di as txt "Capital gains components (2010->2012) summaries:"
Capital gains components (2010->2012) summaries:

. summarize cg_pri_res_2012 cg_sec_res_2012 cg_re_2012 cg_bus_2012 cg_ira_2012 cg_stk_2
> 012 cg_bond_2012 cg_chck_2012 cg_cd_2012 cg_veh_2012 cg_oth_2012

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
cg_pri_~2012 |      9,536   -4521.534    173821.5   -8500000    6900000
cg_sec_~2012 |      9,536     1134.52    85809.57   -3550000    1250000
  cg_re_2012 |      9,536   -5477.954    197499.6   -9200000    4000000
 cg_bus_2012 |      9,536   -2835.444    244070.2   -8300000    5569412
 cg_ira_2012 |      9,536    4795.242    132142.7   -1990000    2000000
-------------+---------------------------------------------------------
 cg_stk_2012 |      9,536    3406.549    248307.3   -6500000    8999996
cg_bond_2012 |      9,536    709.0242    80729.65   -1900000    4000000
cg_chck_2012 |      9,536     3918.55    103563.1    -610000    6000000
  cg_cd_2012 |      9,536   -1929.183    43119.95    -800000    1000000
 cg_veh_2012 |      9,536    313.3183    22461.95   -1000000   248434.8
-------------+---------------------------------------------------------
 cg_oth_2012 |      9,536   -3741.696    211268.5  -1.80e+07    4822964

. 
. * Total capital gains with missing logic
. capture drop cg_total_2012

. egen byte any_cg_2012 = rownonmiss(cg_pri_res_2012 cg_sec_res_2012 cg_re_2012 cg_bus_
> 2012 cg_ira_2012 cg_stk_2012 cg_bond_2012 cg_chck_2012 cg_cd_2012 cg_veh_2012 cg_oth_
> 2012)

. 
. gen double cg_total_2012 = .
(15,856 missing values generated)

. replace cg_total_2012 = cond(missing(cg_pri_res_2012),0,cg_pri_res_2012) + ///
>                         cond(missing(cg_sec_res_2012),0,cg_sec_res_2012) + ///
>                         cond(missing(cg_re_2012),0,cg_re_2012) + ///
>                         cond(missing(cg_bus_2012),0,cg_bus_2012) + ///
>                         cond(missing(cg_ira_2012),0,cg_ira_2012) + ///
>                         cond(missing(cg_stk_2012),0,cg_stk_2012) + ///
>                         cond(missing(cg_bond_2012),0,cg_bond_2012) + ///
>                         cond(missing(cg_chck_2012),0,cg_chck_2012) + ///
>                         cond(missing(cg_cd_2012),0,cg_cd_2012) + ///
>                         cond(missing(cg_veh_2012),0,cg_veh_2012) + ///
>                         cond(missing(cg_oth_2012),0,cg_oth_2012) if any_cg_2012>0
(9,536 real changes made)

. 
. drop any_cg_2012

. 
. * Diagnostics
. di as txt "[summarize] y_c_2012, cg_total_2012, flow_total_2012"
[summarize] y_c_2012, cg_total_2012, flow_total_2012

. summarize y_c_2012 cg_total_2012 flow_total_2012

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    y_c_2012 |      9,773    14722.49    68891.04          0    2836240
cg_tota~2012 |      9,536   -4228.607    565365.4  -2.50e+07   1.05e+07
flow_to~2012 |      4,054    -2981.95    110559.9   -1470000    1600000

. 
. * Base: A_2010 + 0.5 * F_2012 (treat flows as 0 only when A_2010 is non-missing)
. capture drop base_2012

. gen double base_2012 = .
(15,856 missing values generated)

. replace base_2012 = a_2010 + 0.5 * cond(missing(flow_total_2012),0,flow_total_2012) i
> f !missing(a_2010)
(9,684 real changes made)

. label var base_2012 "Base for 2012 returns (A_2010 + 0.5*F_2012)"

. 
. di as txt "[summarize] base_2012"
[summarize] base_2012

. summarize base_2012, detail

         Base for 2012 returns (A_2010 + 0.5*F_2012)
-------------------------------------------------------------
      Percentiles      Smallest
 1%      -105600      -992497.5
 5%       -15000        -500000
10%         -100        -499000       Obs               9,684
25%        17800        -499000       Sum of wgt.       9,684

50%       143950                      Mean           423698.2
                        Largest       Std. dev.        997472
75%       460050       1.76e+07
90%      1048253       2.06e+07       Variance       9.95e+11
95%      1615000       2.06e+07       Skewness       8.864224
99%      4131374       2.54e+07       Kurtosis       132.6411

. 
. * Period return and annualization (2-year)
. capture drop num_period_2012 r_period_2012 r_annual_2012 r_annual_trim_2012

. gen double num_period_2012 = cond(missing(y_c_2012),0,y_c_2012) + ///
>                              cond(missing(cg_total_2012),0,cg_total_2012) - ///
>                              cond(missing(flow_total_2012),0,flow_total_2012)

. 
. egen byte __num12_has = rownonmiss(y_c_2012 cg_total_2012 flow_total_2012)

. replace num_period_2012 = . if __num12_has == 0
(6,083 real changes made, 6,083 to missing)

. 
. drop __num12_has

. 
. gen double r_period_2012 = num_period_2012 / base_2012
(6,710 missing values generated)

. replace r_period_2012 = . if base_2012 < 10000
(1,707 real changes made, 1,707 to missing)

. 
. gen double r_annual_2012 = (1 + r_period_2012)^(1/2) - 1
(8,632 missing values generated)

. replace r_annual_2012 = . if missing(r_period_2012)
(0 real changes made)

. 
. * Trim 5% tails
. capture drop r_annual_trim_2012

. xtile __p_2012 = r_annual_2012 if !missing(r_annual_2012), n(100)

. 
. gen double r_annual_trim_2012 = r_annual_2012
(8,632 missing values generated)

. replace r_annual_trim_2012 = . if __p_2012 <= 5 | __p_2012 > 95
(723 real changes made, 723 to missing)

. 
. drop __p_2012

. 
. di as txt "[summarize] r_period_2012, r_annual_2012, r_annual_trim_2012"
[summarize] r_period_2012, r_annual_2012, r_annual_trim_2012

. summarize r_period_2012 r_annual_2012 r_annual_trim_2012

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
r_perio~2012 |      7,439    .2046569    1.548539   -15.8264   35.19524
r_ann~l_2012 |      7,224    .0446472      .41732         -1   5.016248
r_ann~m_2012 |      6,501    .0173067    .2239601  -.4911291   .6966522

. 
. * Excluding residential housing
. capture drop cg_total_2012_excl_res flow_total_2012_excl_res

. 
. gen double flow_total_2012_excl_res = .
(15,856 missing values generated)

. egen byte any_flow12_excl = rownonmiss(flow_bus_2012 flow_re_2012 flow_stk_2012 flow_
> ira_2012)

. replace flow_total_2012_excl_res = cond(missing(flow_bus_2012),0,flow_bus_2012) + ///
>                                    cond(missing(flow_re_2012),0,flow_re_2012) + ///
>                                    cond(missing(flow_stk_2012),0,flow_stk_2012) + ///
>                                    cond(missing(flow_ira_2012),0,flow_ira_2012) if an
> y_flow12_excl>0
(3,116 real changes made)

. 
. drop any_flow12_excl

. 
. gen double cg_total_2012_excl_res = .
(15,856 missing values generated)

. egen byte any_cg12_excl = rownonmiss(cg_re_2012 cg_bus_2012 cg_ira_2012 cg_stk_2012 c
> g_bond_2012 cg_chck_2012 cg_cd_2012 cg_veh_2012 cg_oth_2012)

. replace cg_total_2012_excl_res = cond(missing(cg_re_2012),0,cg_re_2012) + ///
>                                  cond(missing(cg_bus_2012),0,cg_bus_2012) + ///
>                                  cond(missing(cg_ira_2012),0,cg_ira_2012) + ///
>                                  cond(missing(cg_stk_2012),0,cg_stk_2012) + ///
>                                  cond(missing(cg_bond_2012),0,cg_bond_2012) + ///
>                                  cond(missing(cg_chck_2012),0,cg_chck_2012) + ///
>                                  cond(missing(cg_cd_2012),0,cg_cd_2012) + ///
>                                  cond(missing(cg_veh_2012),0,cg_veh_2012) + ///
>                                  cond(missing(cg_oth_2012),0,cg_oth_2012) if any_cg12
> _excl>0
(9,536 real changes made)

. 
. drop any_cg12_excl

. 
. 
. di as txt "EXCL-RES: cg_total_2012_excl_res and flow_total_2012_excl_res summaries:"
EXCL-RES: cg_total_2012_excl_res and flow_total_2012_excl_res summaries:

. summarize cg_total_2012_excl_res flow_total_2012_excl_res

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
cg_total_2.. |      9,536   -841.5923    514405.7  -2.42e+07   1.00e+07
flow_total.. |      3,116    6756.624    79652.95    -930000    1600000

. 
. * Use SAME base_2012
. capture drop num_period_2012_excl_res r_period_2012_excl_res r_annual_excl_2012 r_ann
> ual_excl_trim_2012

. 
. gen double num_period_2012_excl_res = cond(missing(y_c_2012),0,y_c_2012) + ///
>                                       cond(missing(cg_total_2012_excl_res),0,cg_total
> _2012_excl_res) - ///
>                                       cond(missing(flow_total_2012_excl_res),0,flow_t
> otal_2012_excl_res)

. 
. egen byte __num12ex_has = rownonmiss(y_c_2012 cg_total_2012_excl_res flow_total_2012_
> excl_res)

. replace num_period_2012_excl_res = . if __num12ex_has == 0
(6,083 real changes made, 6,083 to missing)

. 
. drop __num12ex_has

. 
. gen double r_period_2012_excl_res = num_period_2012_excl_res / base_2012
(6,710 missing values generated)

. replace r_period_2012_excl_res = . if base_2012 < 10000
(1,707 real changes made, 1,707 to missing)

. 
. gen double r_annual_excl_2012 = (1 + r_period_2012_excl_res)^(1/2) - 1
(8,484 missing values generated)

. replace r_annual_excl_2012 = . if missing(r_period_2012_excl_res)
(0 real changes made)

. 
. * Trim 5% for excl-res
. xtile __p_ex12 = r_annual_excl_2012 if !missing(r_annual_excl_2012), n(100)

. 
. gen double r_annual_excl_trim_2012 = r_annual_excl_2012
(8,484 missing values generated)

. replace r_annual_excl_trim_2012 = . if __p_ex12 <= 5 | __p_ex12 > 95
(738 real changes made, 738 to missing)

. 
. drop __p_ex12

. 
. di as txt "[summarize] r_period_2012_excl_res, r_annual_excl_2012, r_annual_excl_trim
> _2012"
[summarize] r_period_2012_excl_res, r_annual_excl_2012, r_annual_excl_trim_2012

. summarize r_period_2012_excl_res r_annual_excl_2012 r_annual_excl_trim_2012

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
r~2_excl_res |      7,439     .145605    1.071195   -19.2264      34.16
r_an~cl_2012 |      7,372    .0335177    .3112335         -1   4.929587
r_annual_e.. |      6,634    .0151474    .1528612  -.3659919   .4796217

. 
. * ---------------------------------------------------------------------
. * Prepare 2010 controls inline (married_2010, wealth_*_2010, age_2010, inlbrf_2010)
. * ---------------------------------------------------------------------
. di as txt "=== Preparing 2010 controls (inline) ==="
=== Preparing 2010 controls (inline) ===

. 
. * Marital status (2010): r10mstat -> married_2010
. capture confirm variable r10mstat

. if _rc {
.     di as error "ERROR: r10mstat not found"
.     exit 198
. }

. 
. capture drop married_2010

. gen byte married_2010 = .
(15,856 missing values generated)

. replace married_2010 = 1 if inlist(r10mstat, 1, 2)
(6,331 real changes made)

. replace married_2010 = 0 if inlist(r10mstat, 3, 4, 5, 6, 7, 8)
(3,351 real changes made)

. label define yesno 0 "no" 1 "yes", replace

. label values married_2010 yesno

. label var married_2010 "Married (r10mstat: 1 or 2) vs not married (3-8)"

. 
. di as txt "Marital status (2010) summary:"
Marital status (2010) summary:

. tab married_2010, missing

    Married |
 (r10mstat: |
 1 or 2) vs |
not married |
      (3-8) |      Freq.     Percent        Cum.
------------+-----------------------------------
         no |      3,351       21.13       21.13
        yes |      6,331       39.93       61.06
          . |      6,174       38.94      100.00
------------+-----------------------------------
      Total |     15,856      100.00

. 
. * Wealth percentile/deciles for 2010 using h10atotb
. capture confirm variable h10atotb

. if _rc {
.     di as error "ERROR: h10atotb not found"
.     exit 198
. }

. 
. capture drop wealth_rank_2010 wealth_pct_2010

. quietly count if !missing(h10atotb)

. local N_wealth10 = r(N)

. 
. egen double wealth_rank_2010 = rank(h10atotb) if !missing(h10atotb)
(6,172 missing values generated)

. 
. gen double wealth_pct_2010 = .
(15,856 missing values generated)

. replace wealth_pct_2010 = 100 * (wealth_rank_2010 - 1) / (`N_wealth10' - 1) if `N_wea
> lth10' > 1 & !missing(wealth_rank_2010)
(9,684 real changes made)

. replace wealth_pct_2010 = 50 if `N_wealth10' == 1 & !missing(wealth_rank_2010)
(0 real changes made)

. 
. label variable wealth_pct_2010 "Wealth percentile (based on h10atotb)"

. 
. di as txt "Wealth percentile (2010) summary:"
Wealth percentile (2010) summary:

. summarize wealth_pct_2010

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
wealth_pc~10 |      9,684          50     28.8709          0        100

. 
. capture drop wealth_decile_2010

. xtile wealth_decile_2010 = h10atotb if !missing(h10atotb), n(10)

. label var wealth_decile_2010 "Wealth decile (1=lowest,10=highest)"

. 
. di as txt "Wealth decile distribution (2010):"
Wealth decile distribution (2010):

. tab wealth_decile_2010, missing

     Wealth |
     decile |
(1=lowest,1 |
 0=highest) |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,345        8.48        8.48
          2 |        593        3.74       12.22
          3 |        970        6.12       18.34
          4 |        975        6.15       24.49
          5 |        971        6.12       30.61
          6 |        957        6.04       36.65
          7 |        969        6.11       42.76
          8 |        973        6.14       48.90
          9 |        965        6.09       54.98
         10 |        966        6.09       61.07
          . |      6,172       38.93      100.00
------------+-----------------------------------
      Total |     15,856      100.00

. 
. forvalues d = 1/10 {
  2.     capture drop wealth_d`d'_2010
  3.     gen byte wealth_d`d'_2010 = wealth_decile_2010 == `d' if !missing(wealth_decil
> e_2010)
  4.     label values wealth_d`d'_2010 yesno
  5.     label var wealth_d`d'_2010 "Wealth decile `d' (2010)"
  6. }
(6,172 missing values generated)
(6,172 missing values generated)
(6,172 missing values generated)
(6,172 missing values generated)
(6,172 missing values generated)
(6,172 missing values generated)
(6,172 missing values generated)
(6,172 missing values generated)
(6,172 missing values generated)
(6,172 missing values generated)

. 
. * Age (2010): r10agey_b -> age_2010
. capture confirm variable r10agey_b

. if _rc {
.     di as error "ERROR: r10agey_b not found"
.     exit 198
. }

. 
. capture drop age_2010

. gen double age_2010 = r10agey_b
(6,172 missing values generated)

. label var age_2010 "Respondent age in 2010 (r10agey_b)"

. 
. di as txt "Age (2010) summary:"
Age (2010) summary:

. summarize age_2010

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    age_2010 |      9,684    60.97904    9.244869         25         93

. 
. * Employment (2010): r10inlbrf -> inlbrf_2010
. capture confirm variable r10inlbrf

. if _rc {
.     di as error "ERROR: r10inlbrf not found"
.     exit 198
. }

. 
. capture drop inlbrf_2010

. clonevar inlbrf_2010 = r10inlbrf
(6,268 missing values generated)

. label var inlbrf_2010 "Labor force status in 2010 (r10inlbrf)"

. 
. di as txt "Employment (2010) distribution:"
Employment (2010) distribution:

. tab inlbrf_2010, missing

          Labor force status in 2010 |
                         (r10inlbrf) |      Freq.     Percent        Cum.
-------------------------------------+-----------------------------------
                                0.no |      3,883       24.49       24.49
                               1.yes |      5,705       35.98       60.47
                                   . |      6,172       38.93       99.39
                .i=institutionalized |          4        0.03       99.42
                      .m=oth missing |         90        0.57       99.99
                               .r=rf |          2        0.01      100.00
-------------------------------------+-----------------------------------
                               Total |     15,856      100.00

. 
. * Save back to unified analysis dataset
. 
. di as txt "=== Saving updated analysis dataset (with 2012 flows and returns) ==="
=== Saving updated analysis dataset (with 2012 flows and returns) ===

. 
. * Overlap only: All 6-year overlap (included/excl-res and trimmed)
. quietly count if !missing(r_annual_2022) & !missing(r_annual_2020) & !missing(r_annua
> l_2018) & !missing(r_annual_2016) & !missing(r_annual_2014) & !missing(r_annual_2012)

. 
. di as txt "  All 6 years (included): " %9.0f r(N)
  All 6 years (included):      5510

. 
. quietly count if !missing(r_annual_excl_2022) & !missing(r_annual_excl_2020) & !missi
> ng(r_annual_excl_2018) & !missing(r_annual_excl_2016) & !missing(r_annual_excl_2014) 
> & !missing(r_annual_excl_2012)

. 
. di as txt "  All 6 years (excl-res): " %9.0f r(N)
  All 6 years (excl-res):      5555

. 
. quietly count if !missing(r_annual_trim_2022) & !missing(r_annual_trim_2020) & !missi
> ng(r_annual_trim_2018) & !missing(r_annual_trim_2016) & !missing(r_annual_trim_2014) 
> & !missing(r_annual_trim_2012)

. 
. di as txt "  All 6 years (included, trimmed): " %9.0f r(N)
  All 6 years (included, trimmed):      4132

. 
. quietly count if !missing(r_annual_excl_trim_2022) & !missing(r_annual_excl_trim_2020
> ) & !missing(r_annual_excl_trim_2018) & !missing(r_annual_excl_trim_2016) & !missing(
> r_annual_excl_trim_2014) & !missing(r_annual_excl_trim_2012)

. 
. di as txt "  All 6 years (excl-res, trimmed): " %9.0f r(N)
  All 6 years (excl-res, trimmed):      3890

. 
. save "`out_ana'", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/randhrs1992_2022v1_STATA
    > /_randhrs1992_2022v1_analysis.dta saved

. 
. di as txt "Saved: `out_ana'"
Saved: /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/randhrs199
> 2_2022v1_STATA/_randhrs1992_2022v1_analysis.dta

. 
. log close
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/rand
> hrs1992_2022v1_STATA/RAND_2012_merge_and_returns.log
  log type:  text
 closed on:  17 Oct 2025, 18:59:03
---------------------------------------------------------------------------------------
