---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/randhrs1992_2022v1_STATA/reg_fixed_effects.log
  log type:  text
 opened on:  17 Oct 2025, 20:41:57
r; t=0.00 20:41:57

. 
. set more off
r; t=0.00 20:41:57

. log on
(log already on)
r; t=0.00 20:41:57

. 
. * Install estout package if not already installed
. capture which estout
r; t=0.00 20:41:57

. if _rc {
.     ssc install estout, replace
r; t=0.00 20:41:57
. }
r; t=0.00 20:41:57

. 
. di as txt "===================================================================="
====================================================================
r; t=0.00 20:41:57

. di as txt "=== Regression Set 3: Individual Fixed Effects                   ==="
=== Regression Set 3: Individual Fixed Effects                   ===
r; t=0.00 20:41:57

. di as txt "===================================================================="
====================================================================
r; t=0.00 20:41:57

. di as txt ""

r; t=0.00 20:41:57

. 
. * ---------------------------------------------------------------------
. * Load panel dataset
. * ---------------------------------------------------------------------
. use "_randhrs1992_2022v1_panel.dta", clear
r; t=0.00 20:41:57

. 
. * Restrict to balanced panel: keep only individuals with non-missing returns in ALL waves
. di as txt "Initial sample size: " %9.0f _N
Initial sample size:    174416
r; t=0.00 20:41:57

. 
. * Check which years are in the dataset
. quietly summarize year
r; t=0.01 20:41:57

. local min_year = r(min)
r; t=0.00 20:41:57

. local max_year = r(max)
r; t=0.00 20:41:57

. di as txt "Years in dataset: `min_year' to `max_year'"
Years in dataset: 2002 to 2022
r; t=0.00 20:41:57

. 
. * Count how many years each individual has non-missing r_annual
. bysort hhidpn: egen n_nonmissing_returns = count(r_annual) if !missing(r_annual)
(102,698 missing values generated)
r; t=0.06 20:41:57

. 
. * Count total years per individual
. bysort hhidpn: gen n_total_years = _N
r; t=0.01 20:41:57

. 
. * Check if individual has returns in ALL years
. gen has_all_returns = (n_nonmissing_returns == n_total_years)
r; t=0.01 20:41:57

. 
. * Keep only individuals with returns in ALL years
. keep if has_all_returns == 1
(146,201 observations deleted)
r; t=0.01 20:41:57

. di as txt "After keeping only individuals with returns in ALL years: " %9.0f _N
After keeping only individuals with returns in ALL years:     28215
r; t=0.00 20:41:57

. 
. * Count unique individuals
. quietly bysort hhidpn: gen tag = _n == 1
r; t=0.00 20:41:57

. quietly count if tag == 1
r; t=0.00 20:41:57

. local n_individuals = r(N)
r; t=0.00 20:41:57

. di as txt "Number of unique individuals in balanced panel: " %9.0f `n_individuals'
Number of unique individuals in balanced panel:      2565
r; t=0.00 20:41:57

. drop tag n_nonmissing_returns n_total_years has_all_returns
r; t=0.00 20:41:57

. 
. * Set panel structure
. xtset hhidpn year

Panel variable: hhidpn (strongly balanced)
 Time variable: year, 2002 to 2022, but with gaps
         Delta: 1 unit
r; t=0.02 20:41:57

. 
. * Generate age squared
. gen age_sq = age^2
r; t=0.00 20:41:57

. label var age_sq "Age squared"
r; t=0.00 20:41:57

. 
. di as txt "Panel structure set: hhidpn (individual) x year (time)"
Panel structure set: hhidpn (individual) x year (time)
r; t=0.00 20:41:57

. di as txt "Observations: " _N
Observations: 28215
r; t=0.00 20:41:57

. di as txt "Individuals: " r(N_g)
Individuals: .
r; t=0.00 20:41:57

. di as txt ""

r; t=0.00 20:41:57

. 
. * ---------------------------------------------------------------------
. * Regression 3.1: r_annual (including residential)
. * ---------------------------------------------------------------------
. di as txt "===================================================================="
====================================================================
r; t=0.00 20:41:57

. di as txt "Regression 3.1: r_annual (including residential)"
Regression 3.1: r_annual (including residential)
r; t=0.00 20:41:57

. di as txt "===================================================================="
====================================================================
r; t=0.00 20:41:57

. 
. eststo clear
r; t=0.00 20:41:57

. eststo reg3_1: xtreg r_annual age age_sq i.married i.inlbrf ///
>     i.wealth_d2 i.wealth_d3 i.wealth_d4 i.wealth_d5 i.wealth_d6 ///
>     i.wealth_d7 i.wealth_d8 i.wealth_d9 i.wealth_d10 ///
>     risky_share year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year_10 year_11, fe vce(cluster hhidpn)
note: year_11 omitted because of collinearity.

Fixed-effects (within) regression               Number of obs     =     28,143
Group variable: hhidpn                          Number of groups  =      2,565

R-squared:                                      Obs per group:
     Within  = 0.1363                                         min =          2
     Between = 0.0050                                         avg =       11.0
     Overall = 0.0362                                         max =         11

                                                F(24, 2564)       =     101.36
corr(u_i, Xb) = -0.8098                         Prob > F          =     0.0000

                             (Std. err. adjusted for 2,565 clusters in hhidpn)
------------------------------------------------------------------------------
             |               Robust
    r_annual | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         age |   .0103011    .007485     1.38   0.169    -.0043761    .0249783
      age_sq |  -.0001012   .0000298    -3.40   0.001    -.0001597   -.0000428
             |
     married |
        yes  |   .0101081   .0101361     1.00   0.319    -.0097677     .029984
             |
      inlbrf |
      1.yes  |  -.0009181   .0068888    -0.13   0.894    -.0144263    .0125901
 1.wealth_d2 |  -.0291831   .0275611    -1.06   0.290    -.0832274    .0248613
 1.wealth_d3 |  -.0589298    .028442    -2.07   0.038    -.1147013   -.0031582
 1.wealth_d4 |  -.1533777   .0270337    -5.67   0.000    -.2063878   -.1003675
 1.wealth_d5 |  -.2091492   .0273554    -7.65   0.000    -.2627901   -.1555083
 1.wealth_d6 |  -.3090357   .0278198   -11.11   0.000    -.3635873   -.2544841
 1.wealth_d7 |  -.4198783   .0289069   -14.53   0.000    -.4765615   -.3631952
 1.wealth_d8 |  -.5508978   .0303539   -18.15   0.000    -.6104183   -.4913772
 1.wealth_d9 |  -.6768081      .0322   -21.02   0.000    -.7399488   -.6136675
1.wealth_d10 |   -.873202    .037433   -23.33   0.000    -.9466039   -.7998001
 risky_share |    .073023    .060361     1.21   0.226    -.0453383    .1913843
      year_1 |  -.1360776   .1310308    -1.04   0.299    -.3930145    .1208593
      year_2 |  -.1251503   .1166248    -1.07   0.283    -.3538386     .103538
      year_3 |  -.0468394   .1032281    -0.45   0.650    -.2492583    .1555794
      year_4 |  -.1515813   .0911867    -1.66   0.097    -.3303884    .0272259
      year_5 |  -.1962492   .0789943    -2.48   0.013    -.3511483   -.0413501
      year_6 |  -.0926962    .063814    -1.45   0.146    -.2178285    .0324361
      year_7 |  -.0438989   .0526225    -0.83   0.404    -.1470859     .059288
      year_8 |   -.064032   .0401675    -1.59   0.111    -.1427961    .0147321
      year_9 |  -.0303737   .0274779    -1.11   0.269    -.0842549    .0235074
     year_10 |   -.051959   .0163323    -3.18   0.001    -.0839849   -.0199331
     year_11 |          0  (omitted)
       _cons |   .3964946   .5237769     0.76   0.449    -.6305741    1.423563
-------------+----------------------------------------------------------------
     sigma_u |  .23942065
     sigma_e |  .33814538
         rho |  .33392013   (fraction of variance due to u_i)
------------------------------------------------------------------------------
r; t=0.37 20:41:58

. 
. * Display fixed effects summary
. di as txt "Fixed effects summary for regression 3.1:"
Fixed effects summary for regression 3.1:
r; t=0.00 20:41:58

. di as txt "Number of groups (individuals): " e(N_g)
Number of groups (individuals): 2565
r; t=0.00 20:41:58

. di as txt "Average observations per group: " %6.2f e(g_avg)
Average observations per group:  10.97
r; t=0.00 20:41:58

. 
. * Predict and plot fixed effects
. predict fe_hat, u
(72 missing values generated)
r; t=0.03 20:41:58

. histogram fe_hat, title("Distribution of Individual Fixed Effects") ///
>     subtitle("Regression 3.1: r_annual") ///
>     xtitle("Fixed Effect Coefficient") ///
>     ytitle("Density") ///
>     normal
(bin=44, start=-.53629369, width=.02984382)
r; t=0.69 20:41:58

. graph export "fixed_effects_hist_reg3_1.png", replace
file /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/randhrs1992_2022v1_STATA/fixed_effects_hist_reg3_1.png saved as PNG format
r; t=0.09 20:41:58

. 
. * Summary statistics of fixed effects
. summarize fe_hat, detail

                          u[hhidpn]
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.4659618      -.5362937
 5%    -.3807831      -.5362937
10%    -.3152521      -.5362937       Obs              28,143
25%    -.1850112      -.5362937       Sum of wgt.      28,143

50%    -.0029684                      Mean           1.44e-10
                        Largest       Std. dev.      .2393595
75%     .1900546       .7768344
90%     .3286222       .7768344       Variance        .057293
95%     .3741004       .7768344       Skewness       .0844469
99%     .4815174       .7768344       Kurtosis       2.224918
r; t=0.00 20:41:58

. di as txt "Fixed effects summary statistics:"
Fixed effects summary statistics:
r; t=0.00 20:41:58

. di as txt "Mean: " %8.4f r(mean)
Mean:   0.0000
r; t=0.00 20:41:58

. di as txt "Std Dev: " %8.4f r(sd)
Std Dev:   0.2394
r; t=0.00 20:41:58

. di as txt "Min: " %8.4f r(min)
Min:  -0.5363
r; t=0.00 20:41:58

. di as txt "Max: " %8.4f r(max)
Max:   0.7768
r; t=0.00 20:41:58

. drop fe_hat
r; t=0.00 20:41:58

. 
. di as txt ""

r; t=0.00 20:41:58

. di as txt "Note: raedyrs and born_us dropped (time-invariant)"
Note: raedyrs and born_us dropped (time-invariant)
r; t=0.00 20:41:58

. di as txt ""

r; t=0.00 20:41:58

. 
. * ---------------------------------------------------------------------
. * Regression 3.2: r_annual_trim (including residential, trimmed)
. * ---------------------------------------------------------------------
. di as txt "===================================================================="
====================================================================
r; t=0.00 20:41:58

. di as txt "Regression 3.2: r_annual_trim (including residential, trimmed)"
Regression 3.2: r_annual_trim (including residential, trimmed)
r; t=0.00 20:41:58

. di as txt "===================================================================="
====================================================================
r; t=0.00 20:41:58

. 
. eststo reg3_2: xtreg r_annual_trim age age_sq i.married i.inlbrf ///
>     i.wealth_d2 i.wealth_d3 i.wealth_d4 i.wealth_d5 i.wealth_d6 ///
>     i.wealth_d7 i.wealth_d8 i.wealth_d9 i.wealth_d10 ///
>     risky_share year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year_10 year_11, fe vce(cluster hhidpn)
note: year_11 omitted because of collinearity.

Fixed-effects (within) regression               Number of obs     =     26,767
Group variable: hhidpn                          Number of groups  =      2,565

R-squared:                                      Obs per group:
     Within  = 0.1539                                         min =          1
     Between = 0.0081                                         avg =       10.4
     Overall = 0.0419                                         max =         11

                                                F(24, 2564)       =     148.28
corr(u_i, Xb) = -0.8063                         Prob > F          =     0.0000

                             (Std. err. adjusted for 2,565 clusters in hhidpn)
------------------------------------------------------------------------------
             |               Robust
r_annual_t~m | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         age |    .008204   .0046833     1.75   0.080    -.0009793    .0173873
      age_sq |  -.0000725   .0000169    -4.28   0.000    -.0001057   -.0000392
             |
     married |
        yes  |   .0148311   .0061949     2.39   0.017     .0026836    .0269787
             |
      inlbrf |
      1.yes  |   -.001302   .0040476    -0.32   0.748    -.0092389     .006635
 1.wealth_d2 |  -.0242632   .0148694    -1.63   0.103    -.0534204    .0048941
 1.wealth_d3 |  -.0568826   .0141157    -4.03   0.000    -.0845619   -.0292034
 1.wealth_d4 |  -.0974897   .0146491    -6.65   0.000    -.1262151   -.0687644
 1.wealth_d5 |  -.1392007   .0147762    -9.42   0.000    -.1681753   -.1102262
 1.wealth_d6 |  -.1966766   .0147203   -13.36   0.000    -.2255415   -.1678117
 1.wealth_d7 |  -.2690677   .0151244   -17.79   0.000     -.298725   -.2394104
 1.wealth_d8 |   -.339246   .0154392   -21.97   0.000    -.3695205   -.3089715
 1.wealth_d9 |  -.4285696   .0159873   -26.81   0.000    -.4599189   -.3972203
1.wealth_d10 |  -.5494815   .0169472   -32.42   0.000    -.5827131     -.51625
 risky_share |  -.0208285     .01187    -1.75   0.079    -.0441042    .0024472
      year_1 |  -.0979726    .082705    -1.18   0.236    -.2601481    .0642028
      year_2 |  -.0681051   .0737954    -0.92   0.356    -.2128097    .0765995
      year_3 |  -.0192845   .0660767    -0.29   0.770    -.1488535    .1102846
      year_4 |  -.1068088   .0577572    -1.85   0.065    -.2200642    .0064467
      year_5 |  -.1659233   .0498456    -3.33   0.001    -.2636651   -.0681815
      year_6 |  -.0878573   .0405135    -2.17   0.030    -.1672998   -.0084148
      year_7 |  -.0345806   .0332925    -1.04   0.299    -.0998636    .0307024
      year_8 |  -.0538691    .025907    -2.08   0.038    -.1046699   -.0030683
      year_9 |  -.0356689   .0173458    -2.06   0.040    -.0696822   -.0016556
     year_10 |  -.0525778   .0105283    -4.99   0.000    -.0732225    -.031933
     year_11 |          0  (omitted)
       _cons |   .1963906   .3330928     0.59   0.556    -.4567677     .849549
-------------+----------------------------------------------------------------
     sigma_u |  .15477794
     sigma_e |  .20514331
         rho |  .36275311   (fraction of variance due to u_i)
------------------------------------------------------------------------------
r; t=0.29 20:41:59

. 
. * Predict and plot fixed effects for regression 3.2
. predict fe_hat, u
(1,448 missing values generated)
r; t=0.03 20:41:59

. histogram fe_hat, title("Distribution of Individual Fixed Effects") ///
>     subtitle("Regression 3.2: r_annual_trim") ///
>     xtitle("Fixed Effect Coefficient") ///
>     ytitle("Density") ///
>     normal
(bin=44, start=-.36048996, width=.01808409)
r; t=0.35 20:41:59

. graph export "fixed_effects_hist_reg3_2.png", replace
file /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/randhrs1992_2022v1_STATA/fixed_effects_hist_reg3_2.png saved as PNG format
r; t=0.06 20:41:59

. drop fe_hat
r; t=0.00 20:41:59

. 
. di as txt ""

r; t=0.00 20:41:59

. 
. * ---------------------------------------------------------------------
. * Regression 3.3: r_annual_excl (excluding residential)
. * ---------------------------------------------------------------------
. di as txt "===================================================================="
====================================================================
r; t=0.00 20:41:59

. di as txt "Regression 3.3: r_annual_excl (excluding residential)"
Regression 3.3: r_annual_excl (excluding residential)
r; t=0.00 20:41:59

. di as txt "===================================================================="
====================================================================
r; t=0.00 20:41:59

. 
. eststo reg3_3: xtreg r_annual_excl age age_sq i.married i.inlbrf ///
>     i.wealth_nonres_d2 i.wealth_nonres_d3 i.wealth_nonres_d4 i.wealth_nonres_d5 i.wealth_nonres_d6 ///
>     i.wealth_nonres_d7 i.wealth_nonres_d8 i.wealth_nonres_d9 i.wealth_nonres_d10 ///
>     risky_share year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year_10 year_11, fe vce(cluster hhidpn)
note: year_11 omitted because of collinearity.

Fixed-effects (within) regression               Number of obs     =     28,122
Group variable: hhidpn                          Number of groups  =      2,565

R-squared:                                      Obs per group:
     Within  = 0.1718                                         min =          2
     Between = 0.0296                                         avg =       11.0
     Overall = 0.0227                                         max =         11

                                                F(24, 2564)       =      99.76
corr(u_i, Xb) = -0.8451                         Prob > F          =     0.0000

                                    (Std. err. adjusted for 2,565 clusters in hhidpn)
-------------------------------------------------------------------------------------
                    |               Robust
      r_annual_excl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
                age |   .0061444   .0059201     1.04   0.299    -.0054642    .0177531
             age_sq |  -.0000662    .000025    -2.65   0.008    -.0001152   -.0000172
                    |
            married |
               yes  |   .0108039   .0085186     1.27   0.205       -.0059    .0275079
                    |
             inlbrf |
             1.yes  |   .0013584   .0054779     0.25   0.804    -.0093833       .0121
 1.wealth_nonres_d2 |  -.0319858   .0197518    -1.62   0.105     -.070717    .0067453
 1.wealth_nonres_d3 |  -.0683223   .0201061    -3.40   0.001    -.1077481   -.0288965
 1.wealth_nonres_d4 |   -.137509   .0200429    -6.86   0.000    -.1768108   -.0982071
 1.wealth_nonres_d5 |  -.1934141   .0206178    -9.38   0.000    -.2338432   -.1529849
 1.wealth_nonres_d6 |  -.2903404   .0209974   -13.83   0.000     -.331514   -.2491669
 1.wealth_nonres_d7 |  -.3889119   .0219372   -17.73   0.000    -.4319283   -.3458956
 1.wealth_nonres_d8 |  -.5001222   .0229033   -21.84   0.000    -.5450331   -.4552112
 1.wealth_nonres_d9 |  -.6208009   .0243462   -25.50   0.000    -.6685411   -.5730607
1.wealth_nonres_d10 |   -.796483   .0270997   -29.39   0.000    -.8496225   -.7433434
        risky_share |  -.0419111   .0312451    -1.34   0.180    -.1031793    .0193572
             year_1 |  -.1237809   .1019535    -1.21   0.225    -.3237004    .0761386
             year_2 |  -.1085676   .0906601    -1.20   0.231    -.2863422    .0692069
             year_3 |  -.0555136    .080712    -0.69   0.492    -.2137809    .1027537
             year_4 |  -.0987031   .0707846    -1.39   0.163    -.2375038    .0400977
             year_5 |  -.1201572   .0614689    -1.95   0.051    -.2406909    .0003765
             year_6 |  -.0385232   .0497986    -0.77   0.439    -.1361727    .0591263
             year_7 |  -.0117081   .0408647    -0.29   0.775    -.0918392     .068423
             year_8 |  -.0381425   .0312457    -1.22   0.222    -.0994119    .0231269
             year_9 |  -.0059832   .0212934    -0.28   0.779    -.0477372    .0357709
            year_10 |  -.0239666   .0127379    -1.88   0.060    -.0489443     .001011
            year_11 |          0  (omitted)
              _cons |   .4270221    .406993     1.05   0.294    -.3710462     1.22509
--------------------+----------------------------------------------------------------
            sigma_u |  .23916571
            sigma_e |  .26488194
                rho |  .44911302   (fraction of variance due to u_i)
-------------------------------------------------------------------------------------
r; t=0.32 20:41:59

. 
. * Predict and plot fixed effects for regression 3.3
. predict fe_hat, u
(93 missing values generated)
r; t=0.04 20:41:59

. histogram fe_hat, title("Distribution of Individual Fixed Effects") ///
>     subtitle("Regression 3.3: r_annual_excl") ///
>     xtitle("Fixed Effect Coefficient") ///
>     ytitle("Density") ///
>     normal
(bin=44, start=-.48717499, width=.02833593)
r; t=0.36 20:42:00

. graph export "fixed_effects_hist_reg3_3.png", replace
file /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/randhrs1992_2022v1_STATA/fixed_effects_hist_reg3_3.png saved as PNG format
r; t=0.06 20:42:00

. drop fe_hat
r; t=0.00 20:42:00

. 
. di as txt ""

r; t=0.00 20:42:00

. 
. * ---------------------------------------------------------------------
. * Regression 3.4: r_annual_excl_trim (excluding residential, trimmed)
. * ---------------------------------------------------------------------
. di as txt "===================================================================="
====================================================================
r; t=0.00 20:42:00

. di as txt "Regression 3.4: r_annual_excl_trim (excluding residential, trimmed)"
Regression 3.4: r_annual_excl_trim (excluding residential, trimmed)
r; t=0.00 20:42:00

. di as txt "===================================================================="
====================================================================
r; t=0.00 20:42:00

. 
. eststo reg3_4: xtreg r_annual_excl_trim age age_sq i.married i.inlbrf ///
>     i.wealth_nonres_d2 i.wealth_nonres_d3 i.wealth_nonres_d4 i.wealth_nonres_d5 i.wealth_nonres_d6 ///
>     i.wealth_nonres_d7 i.wealth_nonres_d8 i.wealth_nonres_d9 i.wealth_nonres_d10 ///
>     risky_share year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year_10 year_11, fe vce(cluster hhidpn)
note: year_11 omitted because of collinearity.

Fixed-effects (within) regression               Number of obs     =     26,216
Group variable: hhidpn                          Number of groups  =      2,565

R-squared:                                      Obs per group:
     Within  = 0.1521                                         min =          2
     Between = 0.0254                                         avg =       10.2
     Overall = 0.0142                                         max =         11

                                                F(24, 2564)       =     108.91
corr(u_i, Xb) = -0.8451                         Prob > F          =     0.0000

                                    (Std. err. adjusted for 2,565 clusters in hhidpn)
-------------------------------------------------------------------------------------
                    |               Robust
 r_annual_excl_trim | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
                age |   .0053619   .0033874     1.58   0.114    -.0012804    .0120042
             age_sq |  -.0000413   .0000134    -3.07   0.002    -.0000677   -.0000149
                    |
            married |
               yes  |   .0124463   .0047124     2.64   0.008     .0032058    .0216869
                    |
             inlbrf |
             1.yes  |    .000751   .0031284     0.24   0.810    -.0053835    .0068855
 1.wealth_nonres_d2 |  -.0007962   .0069492    -0.11   0.909    -.0144228    .0128304
 1.wealth_nonres_d3 |  -.0390579   .0066865    -5.84   0.000    -.0521694   -.0259463
 1.wealth_nonres_d4 |  -.0713355   .0075094    -9.50   0.000    -.0860605   -.0566104
 1.wealth_nonres_d5 |  -.1119175   .0080131   -13.97   0.000    -.1276304   -.0962047
 1.wealth_nonres_d6 |  -.1596796   .0081358   -19.63   0.000    -.1756331   -.1437262
 1.wealth_nonres_d7 |  -.2150236   .0086009   -25.00   0.000     -.231889   -.1981582
 1.wealth_nonres_d8 |  -.2712308   .0090975   -29.81   0.000      -.28907   -.2533917
 1.wealth_nonres_d9 |  -.3365813   .0097375   -34.57   0.000    -.3556754   -.3174871
1.wealth_nonres_d10 |  -.4291834   .0108251   -39.65   0.000    -.4504102   -.4079566
        risky_share |  -.0406314   .0097798    -4.15   0.000    -.0598086   -.0214542
             year_1 |  -.0553069   .0583499    -0.95   0.343    -.1697245    .0591108
             year_2 |  -.0322807   .0519754    -0.62   0.535    -.1341987    .0696372
             year_3 |   -.007328   .0465379    -0.16   0.875    -.0985838    .0839277
             year_4 |  -.0406326   .0407728    -1.00   0.319    -.1205835    .0393183
             year_5 |   -.068773    .035096    -1.96   0.050    -.1375923    .0000463
             year_6 |  -.0227245   .0285555    -0.80   0.426    -.0787186    .0332697
             year_7 |   .0028216   .0235251     0.12   0.905    -.0433086    .0489517
             year_8 |  -.0174469   .0183355    -0.95   0.341    -.0534008     .018507
             year_9 |  -.0065534    .012249    -0.54   0.593    -.0305723    .0174655
            year_10 |  -.0218482   .0073572    -2.97   0.003    -.0362748   -.0074215
            year_11 |          0  (omitted)
              _cons |   .1078749   .2349385     0.46   0.646    -.3528137    .5685635
--------------------+----------------------------------------------------------------
            sigma_u |  .13556796
            sigma_e |  .14758876
                rho |  .45762355   (fraction of variance due to u_i)
-------------------------------------------------------------------------------------
r; t=0.32 20:42:00

. 
. * Predict and plot fixed effects for regression 3.4
. predict fe_hat, u
(1,999 missing values generated)
r; t=0.04 20:42:00

. histogram fe_hat, title("Distribution of Individual Fixed Effects") ///
>     subtitle("Regression 3.4: r_annual_excl_trim") ///
>     xtitle("Fixed Effect Coefficient") ///
>     ytitle("Density") ///
>     normal
(bin=44, start=-.27296364, width=.01396176)
r; t=0.32 20:42:01

. graph export "fixed_effects_hist_reg3_4.png", replace
file /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/randhrs1992_2022v1_STATA/fixed_effects_hist_reg3_4.png saved as PNG format
r; t=0.06 20:42:01

. drop fe_hat
r; t=0.00 20:42:01

. 
. di as txt ""

r; t=0.00 20:42:01

. 
. * ---------------------------------------------------------------------
. * Export results
. * ---------------------------------------------------------------------
. di as txt "===================================================================="
====================================================================
r; t=0.00 20:42:01

. di as txt "Exporting results to fixed_effects.tex"
Exporting results to fixed_effects.tex
r; t=0.00 20:42:01

. di as txt "===================================================================="
====================================================================
r; t=0.00 20:42:01

. 
. esttab reg3_1 reg3_2 reg3_3 reg3_4 using "fixed_effects.tex", replace ///
>     se star(* 0.10 ** 0.05 *** 0.01) ///
>     label booktabs compress nogaps ///
>     stats(N N_g r2_w r2_b r2_o, labels("Observations" "Individuals" "Within R-sq" "Between R-sq" "Overall R-sq")) ///
>     title("Individual Fixed Effects Regressions") ///
>     addnote("Clustered standard errors at individual level in parentheses" ///
>             "*** p<0.01, ** p<0.05, * p<0.10" ///
>             "Individual fixed effects control for time-invariant heterogeneity" ///
>             "Time-invariant variables (raedyrs, born_us) automatically dropped")
(output written to fixed_effects.tex)
r; t=0.17 20:42:01

. 
. * Display results in log
. esttab reg3_1 reg3_2 reg3_3 reg3_4, ///
>     se star(* 0.10 ** 0.05 *** 0.01) ///
>     label compress ///
>     stats(N N_g r2_w r2_b r2_o, labels("Observations" "Individuals" "Within R-sq" "Between R-sq" "Overall R-sq"))

--------------------------------------------------------------------
                       (1)          (2)          (3)          (4)   
                  r_annual    r~al_trim    r_annu~cl    r~cl_trim   
--------------------------------------------------------------------
age                 0.0103      0.00820*     0.00614      0.00536   
                 (0.00748)    (0.00468)    (0.00592)    (0.00339)   

Age squared      -0.000101*** -0.0000725*** -0.0000662*** -0.0000413***
                 (0.0000298)    (0.0000169)    (0.0000250)    (0.0000134)   

no                       0            0            0            0   
                       (.)          (.)          (.)          (.)   

yes                 0.0101       0.0148**     0.0108       0.0124***
                  (0.0101)    (0.00619)    (0.00852)    (0.00471)   

0.no                     0            0            0            0   
                       (.)          (.)          (.)          (.)   

1.yes            -0.000918     -0.00130      0.00136     0.000751   
                 (0.00689)    (0.00405)    (0.00548)    (0.00313)   

wealth_d2=0              0            0                             
                       (.)          (.)                             

wealth_d2=1        -0.0292      -0.0243                             
                  (0.0276)     (0.0149)                             

wealth_d3=0              0            0                             
                       (.)          (.)                             

wealth_d3=1        -0.0589**    -0.0569***                          
                  (0.0284)     (0.0141)                             

wealth_d4=0              0            0                             
                       (.)          (.)                             

wealth_d4=1         -0.153***   -0.0975***                          
                  (0.0270)     (0.0146)                             

wealth_d5=0              0            0                             
                       (.)          (.)                             

wealth_d5=1         -0.209***    -0.139***                          
                  (0.0274)     (0.0148)                             

wealth_d6=0              0            0                             
                       (.)          (.)                             

wealth_d6=1         -0.309***    -0.197***                          
                  (0.0278)     (0.0147)                             

wealth_d7=0              0            0                             
                       (.)          (.)                             

wealth_d7=1         -0.420***    -0.269***                          
                  (0.0289)     (0.0151)                             

wealth_d8=0              0            0                             
                       (.)          (.)                             

wealth_d8=1         -0.551***    -0.339***                          
                  (0.0304)     (0.0154)                             

wealth_d9=0              0            0                             
                       (.)          (.)                             

wealth_d9=1         -0.677***    -0.429***                          
                  (0.0322)     (0.0160)                             

wealth_d10=0             0            0                             
                       (.)          (.)                             

wealth_d10=1        -0.873***    -0.549***                          
                  (0.0374)     (0.0169)                             

risky_share         0.0730      -0.0208*     -0.0419      -0.0406***
                  (0.0604)     (0.0119)     (0.0312)    (0.00978)   

year==  2..0000     -0.136      -0.0980       -0.124      -0.0553   
                   (0.131)     (0.0827)      (0.102)     (0.0583)   

year==  2..0000     -0.125      -0.0681       -0.109      -0.0323   
                   (0.117)     (0.0738)     (0.0907)     (0.0520)   

year==  2..0000    -0.0468      -0.0193      -0.0555     -0.00733   
                   (0.103)     (0.0661)     (0.0807)     (0.0465)   

year==  2..0000     -0.152*      -0.107*     -0.0987      -0.0406   
                  (0.0912)     (0.0578)     (0.0708)     (0.0408)   

year==  2..0000     -0.196**     -0.166***    -0.120*     -0.0688*  
                  (0.0790)     (0.0498)     (0.0615)     (0.0351)   

year==  2..0000    -0.0927      -0.0879**    -0.0385      -0.0227   
                  (0.0638)     (0.0405)     (0.0498)     (0.0286)   

year==  2..0000    -0.0439      -0.0346      -0.0117      0.00282   
                  (0.0526)     (0.0333)     (0.0409)     (0.0235)   

year==  2..0000    -0.0640      -0.0539**    -0.0381      -0.0174   
                  (0.0402)     (0.0259)     (0.0312)     (0.0183)   

year==  2..0000    -0.0304      -0.0357**   -0.00598     -0.00655   
                  (0.0275)     (0.0173)     (0.0213)     (0.0122)   

year==  2..0000    -0.0520***   -0.0526***   -0.0240*     -0.0218***
                  (0.0163)     (0.0105)     (0.0127)    (0.00736)   

year==  2..0000          0            0            0            0   
                       (.)          (.)          (.)          (.)   

wealth_nonres_~0                                   0            0   
                                                 (.)          (.)   

wealth_nonres_~1                             -0.0320    -0.000796   
                                            (0.0198)    (0.00695)   

wealth_nonres_~0                                   0            0   
                                                 (.)          (.)   

wealth_nonres_~1                             -0.0683***   -0.0391***
                                            (0.0201)    (0.00669)   

wealth_nonres_~0                                   0            0   
                                                 (.)          (.)   

wealth_nonres_~1                              -0.138***   -0.0713***
                                            (0.0200)    (0.00751)   

wealth_nonres_~0                                   0            0   
                                                 (.)          (.)   

wealth_nonres_~1                              -0.193***    -0.112***
                                            (0.0206)    (0.00801)   

wealth_nonres_~0                                   0            0   
                                                 (.)          (.)   

wealth_nonres_~1                              -0.290***    -0.160***
                                            (0.0210)    (0.00814)   

wealth_nonres_~0                                   0            0   
                                                 (.)          (.)   

wealth_nonres_~1                              -0.389***    -0.215***
                                            (0.0219)    (0.00860)   

wealth_nonres_~0                                   0            0   
                                                 (.)          (.)   

wealth_nonres_~1                              -0.500***    -0.271***
                                            (0.0229)    (0.00910)   

wealth_nonres_~0                                   0            0   
                                                 (.)          (.)   

wealth_nonres_~1                              -0.621***    -0.337***
                                            (0.0243)    (0.00974)   

wealth_nonres_~0                                   0            0   
                                                 (.)          (.)   

wealth_nonres_~1                              -0.796***    -0.429***
                                            (0.0271)     (0.0108)   

Constant             0.396        0.196        0.427        0.108   
                   (0.524)      (0.333)      (0.407)      (0.235)   
--------------------------------------------------------------------
Observations         28143        26767        28122        26216   
Individuals           2565         2565         2565         2565   
Within R-sq          0.136        0.154        0.172        0.152   
Between R-sq       0.00500      0.00806       0.0296       0.0254   
Overall R-sq        0.0362       0.0419       0.0227       0.0142   
--------------------------------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01
r; t=0.15 20:42:01

. 
. di as txt ""

r; t=0.00 20:42:01

. di as txt "===================================================================="
====================================================================
r; t=0.00 20:42:01

. di as txt "=== Individual Fixed Effects Complete                            ==="
=== Individual Fixed Effects Complete                            ===
r; t=0.00 20:42:01

. di as txt "===================================================================="
====================================================================
r; t=0.00 20:42:01

. 
. log off
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/randhrs1992_2022v1_STATA/reg_fixed_effects.log
  log type:  text
 paused on:  17 Oct 2025, 20:42:01
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
