---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/randhrs1992_2022v1_STATA/reg_shares_interacted.log
  log type:  text
 opened on:  17 Oct 2025, 20:41:53
r; t=0.00 20:41:53

. 
. set more off
r; t=0.00 20:41:53

. log on
(log already on)
r; t=0.00 20:41:53

. 
. * Install estout package if not already installed
. capture which estout
r; t=0.00 20:41:53

. if _rc {
.     ssc install estout, replace
r; t=0.00 20:41:53
. }
r; t=0.00 20:41:53

. 
. di as txt "===================================================================="
====================================================================
r; t=0.00 20:41:53

. di as txt "=== Regression Set 2: Asset Shares Ã— Year Interactions          ==="
=== Regression Set 2: Asset Shares Ã— Year Interactions          ===
r; t=0.00 20:41:53

. di as txt "===================================================================="
====================================================================
r; t=0.00 20:41:53

. di as txt ""

r; t=0.00 20:41:53

. 
. * ---------------------------------------------------------------------
. * Load panel dataset
. * ---------------------------------------------------------------------
. use "_randhrs1992_2022v1_panel.dta", clear
r; t=0.00 20:41:53

. 
. * Restrict to balanced panel: keep only individuals with non-missing returns in ALL waves
. di as txt "Initial sample size: " %9.0f _N
Initial sample size:    174416
r; t=0.00 20:41:53

. 
. * Check which years are in the dataset
. quietly summarize year
r; t=0.01 20:41:53

. local min_year = r(min)
r; t=0.00 20:41:53

. local max_year = r(max)
r; t=0.00 20:41:53

. di as txt "Years in dataset: `min_year' to `max_year'"
Years in dataset: 2002 to 2022
r; t=0.00 20:41:53

. 
. * Count how many years each individual has non-missing r_annual
. bysort hhidpn: egen n_nonmissing_returns = count(r_annual) if !missing(r_annual)
(102,698 missing values generated)
r; t=0.05 20:41:53

. 
. * Count total years per individual
. bysort hhidpn: gen n_total_years = _N
r; t=0.01 20:41:53

. 
. * Check if individual has returns in ALL years
. gen has_all_returns = (n_nonmissing_returns == n_total_years)
r; t=0.00 20:41:53

. 
. * Keep only individuals with returns in ALL years
. keep if has_all_returns == 1
(146,201 observations deleted)
r; t=0.00 20:41:53

. di as txt "After keeping only individuals with returns in ALL years: " %9.0f _N
After keeping only individuals with returns in ALL years:     28215
r; t=0.00 20:41:53

. 
. * Count unique individuals
. quietly bysort hhidpn: gen tag = _n == 1
r; t=0.00 20:41:53

. quietly count if tag == 1
r; t=0.00 20:41:53

. local n_individuals = r(N)
r; t=0.00 20:41:53

. di as txt "Number of unique individuals in balanced panel: " %9.0f `n_individuals'
Number of unique individuals in balanced panel:      2565
r; t=0.00 20:41:53

. drop tag n_nonmissing_returns n_total_years has_all_returns
r; t=0.00 20:41:53

. 
. * Set panel structure
. xtset hhidpn year

Panel variable: hhidpn (strongly balanced)
 Time variable: year, 2002 to 2022, but with gaps
         Delta: 1 unit
r; t=0.02 20:41:53

. 
. * Generate age squared
. gen age_sq = age^2
r; t=0.00 20:41:53

. label var age_sq "Age squared"
r; t=0.00 20:41:53

. 
. di as txt "Panel structure set: hhidpn (individual) x year (time)"
Panel structure set: hhidpn (individual) x year (time)
r; t=0.00 20:41:53

. di as txt "Observations: " _N
Observations: 28215
r; t=0.00 20:41:53

. di as txt ""

r; t=0.00 20:41:53

. 
. * ---------------------------------------------------------------------
. * Regression 2.1: r_annual (including residential)
. * ---------------------------------------------------------------------
. di as txt "===================================================================="
====================================================================
r; t=0.00 20:41:53

. di as txt "Regression 2.1: r_annual (including residential)"
Regression 2.1: r_annual (including residential)
r; t=0.00 20:41:53

. di as txt "===================================================================="
====================================================================
r; t=0.00 20:41:53

. 
. eststo clear
r; t=0.00 20:41:53

. eststo reg2_1: reg r_annual age age_sq raedyrs i.inlbrf i.married i.born_us ///
>     i.wealth_d2 i.wealth_d3 i.wealth_d4 i.wealth_d5 i.wealth_d6 ///
>     i.wealth_d7 i.wealth_d8 i.wealth_d9 i.wealth_d10 ///
>     c.share_stk##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year_10 year_11) ///
>     c.share_bond##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year_10 year_11) ///
>     c.share_re##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year_10 year_11) ///
>     c.share_ira##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year_10 year_11) ///
>     c.share_bus##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year_10 year_11) ///
>     liability_share, vce(cluster hhidpn)
note: 1.year_11 omitted because of collinearity.
note: 1.year_11#c.share_stk omitted because of collinearity.
note: 1.year_11#c.share_bond omitted because of collinearity.
note: 1.year_11#c.share_re omitted because of collinearity.
note: 1.year_11#c.share_ira omitted because of collinearity.
note: 1.year_11#c.share_bus omitted because of collinearity.

Linear regression                               Number of obs     =     28,132
                                                F(81, 2563)       =      22.45
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0739
                                                Root MSE          =     .34511

                                     (Std. err. adjusted for 2,564 clusters in hhidpn)
--------------------------------------------------------------------------------------
                     |               Robust
            r_annual | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 age |  -.0012695    .002859    -0.44   0.657    -.0068757    .0043367
              age_sq |  -5.58e-06   .0000206    -0.27   0.787     -.000046    .0000349
             raedyrs |   .0113721   .0008741    13.01   0.000     .0096581    .0130862
                     |
              inlbrf |
              1.yes  |   .0186237   .0048022     3.88   0.000      .009207    .0280404
                     |
             married |
                yes  |   .0105758   .0052101     2.03   0.042     .0003594    .0207923
                     |
             born_us |
                yes  |  -.0209495   .0077537    -2.70   0.007    -.0361537   -.0057453
         1.wealth_d2 |  -.0274132    .026337    -1.04   0.298    -.0790571    .0242307
         1.wealth_d3 |  -.0091069   .0286136    -0.32   0.750     -.065215    .0470012
         1.wealth_d4 |   -.053043   .0249691    -2.12   0.034    -.1020046   -.0040815
         1.wealth_d5 |  -.0652292   .0254145    -2.57   0.010    -.1150642   -.0153941
         1.wealth_d6 |  -.1167942   .0250337    -4.67   0.000    -.1658825   -.0677059
         1.wealth_d7 |  -.1543732    .025893    -5.96   0.000    -.2051465   -.1035999
         1.wealth_d8 |  -.2027881   .0266107    -7.62   0.000    -.2549686   -.1506075
         1.wealth_d9 |  -.2307932   .0275426    -8.38   0.000    -.2848013   -.1767851
        1.wealth_d10 |  -.2890192   .0292477    -9.88   0.000    -.3463707   -.2316677
           share_stk |    .020491   .0442976     0.46   0.644    -.0663718    .1073538
            1.year_1 |  -.0218695   .0203645    -1.07   0.283    -.0618019     .018063
            1.year_2 |  -.0763894   .0175288    -4.36   0.000    -.1107615   -.0420173
            1.year_3 |   .0138251   .0226075     0.61   0.541    -.0305059     .058156
            1.year_4 |  -.1194704   .0174886    -6.83   0.000    -.1537636   -.0851773
            1.year_5 |  -.1733327   .0167464   -10.35   0.000    -.2061706   -.1404949
            1.year_6 |   -.102905   .0162921    -6.32   0.000    -.1348521    -.070958
            1.year_7 |  -.0772512   .0215209    -3.59   0.000    -.1194513   -.0350512
            1.year_8 |  -.1283614   .0220418    -5.82   0.000     -.171583   -.0851399
            1.year_9 |  -.0706003   .0162877    -4.33   0.000    -.1025387   -.0386619
           1.year_10 |  -.0586844   .0211188    -2.78   0.005    -.1000961   -.0172727
           1.year_11 |          0  (omitted)
                     |
  year_1#c.share_stk |
                  1  |  -.1517046   .0559526    -2.71   0.007    -.2614215   -.0419878
                     |
  year_2#c.share_stk |
                  1  |   .0679575   .0568613     1.20   0.232    -.0435413    .1794564
                     |
  year_3#c.share_stk |
                  1  |    -.00608   .0666422    -0.09   0.927     -.136758     .124598
                     |
  year_4#c.share_stk |
                  1  |   .0562208   .0562149     1.00   0.317    -.0540104    .1664519
                     |
  year_5#c.share_stk |
                  1  |    .119484   .0557101     2.14   0.032     .0102427    .2287254
                     |
  year_6#c.share_stk |
                  1  |   .1203413   .0509358     2.36   0.018     .0204618    .2202207
                     |
  year_7#c.share_stk |
                  1  |   .0916424   .0490414     1.87   0.062    -.0045223    .1878072
                     |
  year_8#c.share_stk |
                  1  |   .1065053   .0635645     1.68   0.094    -.0181376    .2311482
                     |
  year_9#c.share_stk |
                  1  |   .0843225   .0552061     1.53   0.127    -.0239306    .1925756
                     |
 year_10#c.share_stk |
                  1  |   .1626748   .1112576     1.46   0.144    -.0554892    .3808388
                     |
 year_11#c.share_stk |
                  1  |          0  (omitted)
                     |
          share_bond |  -.1037087   .1016495    -1.02   0.308    -.3030321    .0956148
                     |
 year_1#c.share_bond |
                  1  |   .3809579   .1400494     2.72   0.007     .1063364    .6555795
                     |
 year_2#c.share_bond |
                  1  |   .3552241   .1524104     2.33   0.020     .0563642    .6540841
                     |
 year_3#c.share_bond |
                  1  |   .0187494   .1638129     0.11   0.909    -.3024696    .3399684
                     |
 year_4#c.share_bond |
                  1  |   .8863935   .3568134     2.48   0.013     .1867218    1.586065
                     |
 year_5#c.share_bond |
                  1  |   .5756786   .2054438     2.80   0.005     .1728259    .9785313
                     |
 year_6#c.share_bond |
                  1  |   .3235725    .125748     2.57   0.010     .0769946    .5701504
                     |
 year_7#c.share_bond |
                  1  |   .3160709   .1691502     1.87   0.062    -.0156139    .6477558
                     |
 year_8#c.share_bond |
                  1  |   .4688301   .1461897     3.21   0.001     .1821682    .7554921
                     |
 year_9#c.share_bond |
                  1  |   .2707519   .1520358     1.78   0.075    -.0273737    .5688774
                     |
year_10#c.share_bond |
                  1  |   .0109748   .1495449     0.07   0.942    -.2822663     .304216
                     |
year_11#c.share_bond |
                  1  |          0  (omitted)
                     |
            share_re |  -.0058707   .0721163    -0.08   0.935    -.1472829    .1355414
                     |
   year_1#c.share_re |
                  1  |   .0910874   .1134549     0.80   0.422    -.1313851      .31356
                     |
   year_2#c.share_re |
                  1  |   .1816401   .0814493     2.23   0.026      .021927    .3413532
                     |
   year_3#c.share_re |
                  1  |   .1346457   .0839619     1.60   0.109    -.0299944    .2992858
                     |
   year_4#c.share_re |
                  1  |   .0583027   .0778305     0.75   0.454    -.0943144    .2109198
                     |
   year_5#c.share_re |
                  1  |   .0535758   .0811755     0.66   0.509    -.1056004     .212752
                     |
   year_6#c.share_re |
                  1  |   .0364796   .0819727     0.45   0.656    -.1242599    .1972191
                     |
   year_7#c.share_re |
                  1  |   .1018083   .0813181     1.25   0.211    -.0576477    .2612642
                     |
   year_8#c.share_re |
                  1  |   .2597051   .0847043     3.07   0.002     .0936093    .4258008
                     |
   year_9#c.share_re |
                  1  |   .1807436   .1003516     1.80   0.072    -.0160349    .3775221
                     |
  year_10#c.share_re |
                  1  |   .1052238   .0899587     1.17   0.242    -.0711753    .2816229
                     |
  year_11#c.share_re |
                  1  |          0  (omitted)
                     |
           share_ira |   .0557146   .0378511     1.47   0.141    -.0185072    .1299364
                     |
  year_1#c.share_ira |
                  1  |  -.1808678   .0511707    -3.53   0.000     -.281208   -.0805276
                     |
  year_2#c.share_ira |
                  1  |  -.0135236   .0471225    -0.29   0.774    -.1059256    .0788784
                     |
  year_3#c.share_ira |
                  1  |  -.1184255   .0536928    -2.21   0.027    -.2237112   -.0131399
                     |
  year_4#c.share_ira |
                  1  |  -.0017094   .0590423    -0.03   0.977    -.1174849    .1140662
                     |
  year_5#c.share_ira |
                  1  |  -.0070386   .0453365    -0.16   0.877    -.0959386    .0818614
                     |
  year_6#c.share_ira |
                  1  |  -.0293218   .0444384    -0.66   0.509    -.1164607    .0578171
                     |
  year_7#c.share_ira |
                  1  |   .1038076   .0878283     1.18   0.237    -.0684139    .2760292
                     |
  year_8#c.share_ira |
                  1  |   .0791482   .0508411     1.56   0.120    -.0205456     .178842
                     |
  year_9#c.share_ira |
                  1  |   .0568261   .0452982     1.25   0.210    -.0319988     .145651
                     |
 year_10#c.share_ira |
                  1  |  -.1036941   .0481707    -2.15   0.031    -.1981515   -.0092366
                     |
 year_11#c.share_ira |
                  1  |          0  (omitted)
                     |
           share_bus |    .139673   .0720483     1.94   0.053    -.0016058    .2809518
                     |
  year_1#c.share_bus |
                  1  |  -.2595211    .086208    -3.01   0.003    -.4285654   -.0904767
                     |
  year_2#c.share_bus |
                  1  |  -.0259067   .0816666    -0.32   0.751    -.1860459    .1342325
                     |
  year_3#c.share_bus |
                  1  |  -.0343809   .0881548    -0.39   0.697    -.2072428     .138481
                     |
  year_4#c.share_bus |
                  1  |   .0144864   .0801487     0.18   0.857    -.1426764    .1716492
                     |
  year_5#c.share_bus |
                  1  |   .1053977   .0872032     1.21   0.227    -.0655982    .2763936
                     |
  year_6#c.share_bus |
                  1  |  -.0457632   .0796365    -0.57   0.566    -.2019216    .1103953
                     |
  year_7#c.share_bus |
                  1  |  -.0224414   .0814563    -0.28   0.783    -.1821682    .1372854
                     |
  year_8#c.share_bus |
                  1  |   .5157441   .2520483     2.05   0.041      .021505    1.009983
                     |
  year_9#c.share_bus |
                  1  |  -.0322828   .0960332    -0.34   0.737    -.2205933    .1560278
                     |
 year_10#c.share_bus |
                  1  |  -.0495802   .1170589    -0.42   0.672    -.2791199    .1799595
                     |
 year_11#c.share_bus |
                  1  |          0  (omitted)
                     |
     liability_share |   .1311545   .0581383     2.26   0.024     .0171516    .2451573
               _cons |   .2504953   .1046421     2.39   0.017     .0453036     .455687
--------------------------------------------------------------------------------------
r; t=0.86 20:41:54

. 
. * Joint F-tests for asset shares
. di as txt ""

r; t=0.00 20:41:54

. di as txt "--- Joint F-tests: Testing equality of coefficients across years ---"
--- Joint F-tests: Testing equality of coefficients across years ---
r; t=0.00 20:41:54

. di as txt ""

r; t=0.00 20:41:54

. 
. * Note: These tests check if the interaction coefficients are jointly different from zero
. * which tests whether asset share effects vary significantly across years
. 
. di as txt "Test 1: Stock share (main and interactions)"
Test 1: Stock share (main and interactions)
r; t=0.00 20:41:54

. quietly test c.share_stk
r; t=0.00 20:41:54

. local fstat_stk = r(F)
r; t=0.00 20:41:54

. local p_stk = r(p)
r; t=0.00 20:41:54

. di as txt "F-statistic: " %6.2f `fstat_stk' "  p-value: " %6.4f `p_stk'
F-statistic:   0.21  p-value: 0.6437
r; t=0.00 20:41:54

. 
. di as txt ""

r; t=0.00 20:41:54

. di as txt "Test 2: Bond share (main and interactions)"
Test 2: Bond share (main and interactions)
r; t=0.00 20:41:54

. quietly test c.share_bond
r; t=0.00 20:41:54

. local fstat_bond = r(F)
r; t=0.00 20:41:54

. local p_bond = r(p)
r; t=0.00 20:41:54

. di as txt "F-statistic: " %6.2f `fstat_bond' "  p-value: " %6.4f `p_bond'
F-statistic:   1.04  p-value: 0.3077
r; t=0.00 20:41:54

. 
. di as txt ""

r; t=0.00 20:41:54

. di as txt "Test 3: Real estate share (main and interactions)"
Test 3: Real estate share (main and interactions)
r; t=0.00 20:41:54

. quietly test c.share_re
r; t=0.00 20:41:54

. local fstat_re = r(F)
r; t=0.00 20:41:54

. local p_re = r(p)
r; t=0.00 20:41:54

. di as txt "F-statistic: " %6.2f `fstat_re' "  p-value: " %6.4f `p_re'
F-statistic:   0.01  p-value: 0.9351
r; t=0.00 20:41:54

. 
. di as txt ""

r; t=0.00 20:41:54

. di as txt "Test 4: IRA share (main and interactions)"
Test 4: IRA share (main and interactions)
r; t=0.00 20:41:54

. quietly test c.share_ira
r; t=0.00 20:41:54

. local fstat_ira = r(F)
r; t=0.00 20:41:54

. local p_ira = r(p)
r; t=0.00 20:41:54

. di as txt "F-statistic: " %6.2f `fstat_ira' "  p-value: " %6.4f `p_ira'
F-statistic:   2.17  p-value: 0.1412
r; t=0.00 20:41:54

. 
. di as txt ""

r; t=0.00 20:41:54

. di as txt "Test 5: Business share (main and interactions)"
Test 5: Business share (main and interactions)
r; t=0.00 20:41:54

. quietly test c.share_bus
r; t=0.00 20:41:54

. local fstat_bus = r(F)
r; t=0.00 20:41:54

. local p_bus = r(p)
r; t=0.00 20:41:54

. di as txt "F-statistic: " %6.2f `fstat_bus' "  p-value: " %6.4f `p_bus'
F-statistic:   3.76  p-value: 0.0527
r; t=0.00 20:41:54

. 
. di as txt ""

r; t=0.00 20:41:54

. 
. * ---------------------------------------------------------------------
. * Regression 2.2: r_annual_trim (including residential, trimmed)
. * ---------------------------------------------------------------------
. di as txt "===================================================================="
====================================================================
r; t=0.00 20:41:54

. di as txt "Regression 2.2: r_annual_trim (including residential, trimmed)"
Regression 2.2: r_annual_trim (including residential, trimmed)
r; t=0.00 20:41:54

. di as txt "===================================================================="
====================================================================
r; t=0.00 20:41:54

. 
. eststo reg2_2: reg r_annual_trim age age_sq raedyrs i.inlbrf i.married i.born_us ///
>     i.wealth_d2 i.wealth_d3 i.wealth_d4 i.wealth_d5 i.wealth_d6 ///
>     i.wealth_d7 i.wealth_d8 i.wealth_d9 i.wealth_d10 ///
>     c.share_stk##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year_10 year_11) ///
>     c.share_bond##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year_10 year_11) ///
>     c.share_re##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year_10 year_11) ///
>     c.share_ira##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year_10 year_11) ///
>     c.share_bus##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year_10 year_11) ///
>     liability_share, vce(cluster hhidpn)
note: 1.year_11 omitted because of collinearity.
note: 1.year_11#c.share_stk omitted because of collinearity.
note: 1.year_11#c.share_bond omitted because of collinearity.
note: 1.year_11#c.share_re omitted because of collinearity.
note: 1.year_11#c.share_ira omitted because of collinearity.
note: 1.year_11#c.share_bus omitted because of collinearity.

Linear regression                               Number of obs     =     26,756
                                                F(81, 2563)       =      30.98
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0803
                                                Root MSE          =     .21133

                                     (Std. err. adjusted for 2,564 clusters in hhidpn)
--------------------------------------------------------------------------------------
                     |               Robust
       r_annual_trim | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 age |  -.0001619   .0018072    -0.09   0.929    -.0037055    .0033817
              age_sq |  -9.31e-06    .000013    -0.72   0.475    -.0000348    .0000162
             raedyrs |   .0070192   .0005318    13.20   0.000     .0059764    .0080621
                     |
              inlbrf |
              1.yes  |   .0138741   .0028698     4.83   0.000     .0082467    .0195015
                     |
             married |
                yes  |   .0180298   .0029559     6.10   0.000     .0122335     .023826
                     |
             born_us |
                yes  |  -.0161505   .0039463    -4.09   0.000    -.0238888   -.0084122
         1.wealth_d2 |  -.0219786   .0139065    -1.58   0.114    -.0492477    .0052904
         1.wealth_d3 |   -.032017   .0129706    -2.47   0.014     -.057451    -.006583
         1.wealth_d4 |  -.0437515   .0129878    -3.37   0.001    -.0692191   -.0182838
         1.wealth_d5 |   -.055949   .0129549    -4.32   0.000     -.081352   -.0305459
         1.wealth_d6 |  -.0812085   .0125965    -6.45   0.000    -.1059089   -.0565082
         1.wealth_d7 |  -.1030474     .01287    -8.01   0.000    -.1282841   -.0778108
         1.wealth_d8 |  -.1195964    .013046    -9.17   0.000    -.1451782   -.0940146
         1.wealth_d9 |  -.1375147   .0132395   -10.39   0.000    -.1634759   -.1115535
        1.wealth_d10 |  -.1700834   .0137218   -12.40   0.000    -.1969903   -.1431765
           share_stk |  -.0258452   .0275056    -0.94   0.347    -.0797806    .0280902
            1.year_1 |  -.0489946   .0113719    -4.31   0.000    -.0712936   -.0266956
            1.year_2 |  -.0439391   .0105125    -4.18   0.000     -.064553   -.0233253
            1.year_3 |  -.0021286   .0113131    -0.19   0.851    -.0243124    .0200552
            1.year_4 |  -.0989596   .0101278    -9.77   0.000    -.1188191   -.0791002
            1.year_5 |  -.1614865   .0101938   -15.84   0.000    -.1814755   -.1414975
            1.year_6 |  -.1089045   .0101173   -10.76   0.000    -.1287434   -.0890656
            1.year_7 |  -.0514639    .009983    -5.16   0.000    -.0710394   -.0318883
            1.year_8 |  -.0623773   .0101398    -6.15   0.000    -.0822603   -.0424943
            1.year_9 |  -.0560401    .009912    -5.65   0.000    -.0754763   -.0366038
           1.year_10 |  -.0503538   .0109241    -4.61   0.000    -.0717748   -.0289327
           1.year_11 |          0  (omitted)
                     |
  year_1#c.share_stk |
                  1  |  -.0433578   .0369266    -1.17   0.240    -.1157668    .0290513
                     |
  year_2#c.share_stk |
                  1  |   .0045781   .0386719     0.12   0.906    -.0712533    .0804094
                     |
  year_3#c.share_stk |
                  1  |   .0061793   .0424612     0.15   0.884    -.0770824     .089441
                     |
  year_4#c.share_stk |
                  1  |   .0735556   .0377425     1.95   0.051    -.0004532    .1475644
                     |
  year_5#c.share_stk |
                  1  |   .0904013   .0359936     2.51   0.012     .0198217    .1609809
                     |
  year_6#c.share_stk |
                  1  |   .1062156   .0347133     3.06   0.002     .0381467    .1742845
                     |
  year_7#c.share_stk |
                  1  |     .08001   .0358827     2.23   0.026     .0096479    .1503721
                     |
  year_8#c.share_stk |
                  1  |   .0623793   .0373712     1.67   0.095    -.0109016    .1356602
                     |
  year_9#c.share_stk |
                  1  |   .0393834   .0388977     1.01   0.311    -.0368908    .1156575
                     |
 year_10#c.share_stk |
                  1  |   .0146748   .0375758     0.39   0.696    -.0590072    .0883568
                     |
 year_11#c.share_stk |
                  1  |          0  (omitted)
                     |
          share_bond |  -.1953955   .0647412    -3.02   0.003    -.3223459   -.0684452
                     |
 year_1#c.share_bond |
                  1  |   .4869429   .1116954     4.36   0.000     .2679206    .7059653
                     |
 year_2#c.share_bond |
                  1  |   .3209643   .1260121     2.55   0.011     .0738683    .5680602
                     |
 year_3#c.share_bond |
                  1  |   .1756713   .1214808     1.45   0.148    -.0625393    .4138818
                     |
 year_4#c.share_bond |
                  1  |   .4062149   .1313674     3.09   0.002     .1486178     .663812
                     |
 year_5#c.share_bond |
                  1  |   .5491908   .1012608     5.42   0.000     .3506295    .7477521
                     |
 year_6#c.share_bond |
                  1  |    .429723   .0906653     4.74   0.000     .2519383    .6075077
                     |
 year_7#c.share_bond |
                  1  |   .2803908   .1043263     2.69   0.007     .0758184    .4849633
                     |
 year_8#c.share_bond |
                  1  |   .3651953   .1068967     3.42   0.001     .1555826     .574808
                     |
 year_9#c.share_bond |
                  1  |   .2228132   .1249253     1.78   0.075    -.0221516    .4677779
                     |
year_10#c.share_bond |
                  1  |   .1190688   .1261338     0.94   0.345    -.1282658    .3664033
                     |
year_11#c.share_bond |
                  1  |          0  (omitted)
                     |
            share_re |  -.1068553   .0484803    -2.20   0.028    -.2019198   -.0117908
                     |
   year_1#c.share_re |
                  1  |   .1269317   .0611067     2.08   0.038     .0071082    .2467553
                     |
   year_2#c.share_re |
                  1  |   .1834651    .060986     3.01   0.003     .0638783    .3030519
                     |
   year_3#c.share_re |
                  1  |   .1852866   .0582784     3.18   0.001     .0710092    .2995641
                     |
   year_4#c.share_re |
                  1  |   .1443801   .0550149     2.62   0.009      .036502    .2522583
                     |
   year_5#c.share_re |
                  1  |   .1129868   .0574003     1.97   0.049     .0004311    .2255426
                     |
   year_6#c.share_re |
                  1  |    .114256     .05585     2.05   0.041     .0047402    .2237717
                     |
   year_7#c.share_re |
                  1  |   .1235179   .0604183     2.04   0.041     .0050444    .2419915
                     |
   year_8#c.share_re |
                  1  |   .1588688   .0586105     2.71   0.007       .04394    .2737976
                     |
   year_9#c.share_re |
                  1  |   .1303153   .0608034     2.14   0.032     .0110866     .249544
                     |
  year_10#c.share_re |
                  1  |   .1771488   .0686264     2.58   0.010     .0425799    .3117177
                     |
  year_11#c.share_re |
                  1  |          0  (omitted)
                     |
           share_ira |   .0193844   .0251464     0.77   0.441    -.0299249    .0686937
                     |
  year_1#c.share_ira |
                  1  |  -.1243887   .0314316    -3.96   0.000    -.1860226   -.0627547
                     |
  year_2#c.share_ira |
                  1  |   -.035319   .0331798    -1.06   0.287    -.1003809    .0297429
                     |
  year_3#c.share_ira |
                  1  |  -.0569609   .0322887    -1.76   0.078    -.1202756    .0063537
                     |
  year_4#c.share_ira |
                  1  |  -.0333308   .0312526    -1.07   0.286    -.0946137     .027952
                     |
  year_5#c.share_ira |
                  1  |   -.035302   .0303089    -1.16   0.244    -.0947344    .0241305
                     |
  year_6#c.share_ira |
                  1  |  -.0331669   .0312893    -1.06   0.289    -.0945218     .028188
                     |
  year_7#c.share_ira |
                  1  |  -.0293956   .0301722    -0.97   0.330    -.0885599    .0297686
                     |
  year_8#c.share_ira |
                  1  |  -.0684821   .0315519    -2.17   0.030    -.1303519   -.0066123
                     |
  year_9#c.share_ira |
                  1  |  -.0084724   .0310694    -0.27   0.785    -.0693961    .0524514
                     |
 year_10#c.share_ira |
                  1  |  -.0888868   .0331147    -2.68   0.007    -.1538211   -.0239524
                     |
 year_11#c.share_ira |
                  1  |          0  (omitted)
                     |
           share_bus |   .0584558   .0499007     1.17   0.242     -.039394    .1563055
                     |
  year_1#c.share_bus |
                  1  |  -.1405249   .0650303    -2.16   0.031     -.268042   -.0130077
                     |
  year_2#c.share_bus |
                  1  |  -.0320006    .061848    -0.52   0.605    -.1532778    .0892766
                     |
  year_3#c.share_bus |
                  1  |  -.0262017   .0611219    -0.43   0.668     -.146055    .0936517
                     |
  year_4#c.share_bus |
                  1  |   .0433365   .0589423     0.74   0.462    -.0722429     .158916
                     |
  year_5#c.share_bus |
                  1  |   .0895067    .059667     1.50   0.134    -.0274938    .2065071
                     |
  year_6#c.share_bus |
                  1  |  -.0259264   .0552221    -0.47   0.639    -.1342108    .0823581
                     |
  year_7#c.share_bus |
                  1  |  -.0006131   .0554189    -0.01   0.991    -.1092834    .1080572
                     |
  year_8#c.share_bus |
                  1  |  -.0437518   .0606435    -0.72   0.471    -.1626671    .0751634
                     |
  year_9#c.share_bus |
                  1  |  -.0460415    .067416    -0.68   0.495    -.1782367    .0861538
                     |
 year_10#c.share_bus |
                  1  |  -.0830944    .061351    -1.35   0.176     -.203397    .0372082
                     |
 year_11#c.share_bus |
                  1  |          0  (omitted)
                     |
     liability_share |   .0154089   .0242607     0.64   0.525    -.0321637    .0629816
               _cons |   .1758607   .0643451     2.73   0.006      .049687    .3020343
--------------------------------------------------------------------------------------
r; t=0.77 20:41:54

. 
. di as txt ""

r; t=0.00 20:41:54

. 
. * ---------------------------------------------------------------------
. * Regression 2.3: r_annual_excl (excluding residential)
. * ---------------------------------------------------------------------
. di as txt "===================================================================="
====================================================================
r; t=0.00 20:41:54

. di as txt "Regression 2.3: r_annual_excl (excluding residential)"
Regression 2.3: r_annual_excl (excluding residential)
r; t=0.00 20:41:54

. di as txt "===================================================================="
====================================================================
r; t=0.00 20:41:54

. 
. eststo reg2_3: reg r_annual_excl age age_sq raedyrs i.inlbrf i.married i.born_us ///
>     i.wealth_nonres_d2 i.wealth_nonres_d3 i.wealth_nonres_d4 i.wealth_nonres_d5 i.wealth_nonres_d6 ///
>     i.wealth_nonres_d7 i.wealth_nonres_d8 i.wealth_nonres_d9 i.wealth_nonres_d10 ///
>     c.share_stk##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year_10 year_11) ///
>     c.share_bond##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year_10 year_11) ///
>     c.share_re##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year_10 year_11) ///
>     c.share_ira##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year_10 year_11) ///
>     c.share_bus##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year_10 year_11) ///
>     liability_share, vce(cluster hhidpn)
note: 1.year_11 omitted because of collinearity.
note: 1.year_11#c.share_stk omitted because of collinearity.
note: 1.year_11#c.share_bond omitted because of collinearity.
note: 1.year_11#c.share_re omitted because of collinearity.
note: 1.year_11#c.share_ira omitted because of collinearity.
note: 1.year_11#c.share_bus omitted because of collinearity.

Linear regression                               Number of obs     =     28,111
                                                F(81, 2563)       =      13.64
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0503
                                                Root MSE          =     .27936

                                     (Std. err. adjusted for 2,564 clusters in hhidpn)
--------------------------------------------------------------------------------------
                     |               Robust
       r_annual_excl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 age |  -.0044615   .0023382    -1.91   0.056    -.0090464    .0001234
              age_sq |   .0000283   .0000168     1.68   0.093    -4.72e-06    .0000613
             raedyrs |   .0102823    .000755    13.62   0.000     .0088018    .0117629
                     |
              inlbrf |
              1.yes  |   .0215802   .0038732     5.57   0.000     .0139853    .0291751
                     |
             married |
                yes  |   .0067401    .004262     1.58   0.114    -.0016173    .0150975
                     |
             born_us |
                yes  |  -.0008575    .006298    -0.14   0.892    -.0132071    .0114922
  1.wealth_nonres_d2 |  -.0513246   .0189062    -2.71   0.007    -.0883976   -.0142516
  1.wealth_nonres_d3 |  -.0355254   .0191806    -1.85   0.064    -.0731363    .0020856
  1.wealth_nonres_d4 |  -.0534638   .0181431    -2.95   0.003    -.0890405   -.0178872
  1.wealth_nonres_d5 |   -.057497   .0184901    -3.11   0.002    -.0937541     -.02124
  1.wealth_nonres_d6 |  -.0980488   .0178441    -5.49   0.000    -.1330391   -.0630585
  1.wealth_nonres_d7 |  -.1155054   .0182009    -6.35   0.000    -.1511953   -.0798155
  1.wealth_nonres_d8 |  -.1401217   .0184499    -7.59   0.000    -.1762999   -.1039435
  1.wealth_nonres_d9 |  -.1572257   .0189585    -8.29   0.000    -.1944011   -.1200502
 1.wealth_nonres_d10 |  -.1926971   .0196726    -9.80   0.000     -.231273   -.1541213
           share_stk |  -.0066962   .0408389    -0.16   0.870    -.0867769    .0733845
            1.year_1 |   .0118317   .0155538     0.76   0.447    -.0186675    .0423309
            1.year_2 |  -.0248494   .0140888    -1.76   0.078    -.0524759    .0027772
            1.year_3 |   .0184778   .0157614     1.17   0.241    -.0124285    .0493842
            1.year_4 |  -.0260826   .0138246    -1.89   0.059    -.0531912    .0010259
            1.year_5 |   -.053479   .0123088    -4.34   0.000    -.0776152   -.0293428
            1.year_6 |  -.0194523    .012454    -1.56   0.118    -.0438732    .0049686
            1.year_7 |   -.021499   .0146502    -1.47   0.142    -.0502264    .0072284
            1.year_8 |  -.0657349   .0139291    -4.72   0.000    -.0930484   -.0384214
            1.year_9 |   -.033292   .0126185    -2.64   0.008    -.0580356   -.0085484
           1.year_10 |  -.0098455    .013944    -0.71   0.480    -.0371883    .0174972
           1.year_11 |          0  (omitted)
                     |
  year_1#c.share_stk |
                  1  |  -.1801966   .0513209    -3.51   0.000    -.2808313   -.0795619
                     |
  year_2#c.share_stk |
                  1  |  -.0030791   .0535565    -0.06   0.954    -.1080975    .1019393
                     |
  year_3#c.share_stk |
                  1  |  -.0495046   .0577597    -0.86   0.391    -.1627651    .0637559
                     |
  year_4#c.share_stk |
                  1  |  -.0459388   .0505195    -0.91   0.363     -.145002    .0531245
                     |
  year_5#c.share_stk |
                  1  |   .0118539    .049841     0.24   0.812    -.0858789    .1095867
                     |
  year_6#c.share_stk |
                  1  |   .0413657   .0469202     0.88   0.378    -.0506396     .133371
                     |
  year_7#c.share_stk |
                  1  |   .0451687   .0441801     1.02   0.307    -.0414636    .1318011
                     |
  year_8#c.share_stk |
                  1  |   .0374056   .0490036     0.76   0.445    -.0586851    .1334964
                     |
  year_9#c.share_stk |
                  1  |   .0339871   .0509168     0.67   0.505    -.0658551    .1338292
                     |
 year_10#c.share_stk |
                  1  |   .0328256   .0570349     0.58   0.565    -.0790136    .1446648
                     |
 year_11#c.share_stk |
                  1  |          0  (omitted)
                     |
          share_bond |  -.1208274   .0985563    -1.23   0.220    -.3140854    .0724306
                     |
 year_1#c.share_bond |
                  1  |   .3961806   .1350239     2.93   0.003     .1314135    .6609476
                     |
 year_2#c.share_bond |
                  1  |   .2705075   .1474496     1.83   0.067    -.0186249    .5596399
                     |
 year_3#c.share_bond |
                  1  |   .0292005   .1516986     0.19   0.847    -.2682638    .3266649
                     |
 year_4#c.share_bond |
                  1  |   .6837704    .271155     2.52   0.012     .1520654    1.215475
                     |
 year_5#c.share_bond |
                  1  |   .4155151   .1818692     2.28   0.022     .0588896    .7721406
                     |
 year_6#c.share_bond |
                  1  |   .2886585   .1171959     2.46   0.014     .0588503    .5184668
                     |
 year_7#c.share_bond |
                  1  |   .2395625   .1623316     1.48   0.140     -.078752    .5578769
                     |
 year_8#c.share_bond |
                  1  |   .3235155   .1366972     2.37   0.018     .0554674    .5915637
                     |
 year_9#c.share_bond |
                  1  |   .2323946    .149123     1.56   0.119    -.0600192    .5248085
                     |
year_10#c.share_bond |
                  1  |   -.018818   .1382121    -0.14   0.892    -.2898368    .2522008
                     |
year_11#c.share_bond |
                  1  |          0  (omitted)
                     |
            share_re |  -.1464689   .0622228    -2.35   0.019     -.268481   -.0244568
                     |
   year_1#c.share_re |
                  1  |    .195594   .1067106     1.83   0.067    -.0136536    .4048417
                     |
   year_2#c.share_re |
                  1  |   .2214728   .0726759     3.05   0.002     .0789633    .3639822
                     |
   year_3#c.share_re |
                  1  |   .2277355   .0729775     3.12   0.002     .0846347    .3708364
                     |
   year_4#c.share_re |
                  1  |   .0538478   .0691316     0.78   0.436    -.0817117    .1894073
                     |
   year_5#c.share_re |
                  1  |   .0364375   .0703656     0.52   0.605    -.1015417    .1744168
                     |
   year_6#c.share_re |
                  1  |    .044834   .0730506     0.61   0.539    -.0984103    .1880782
                     |
   year_7#c.share_re |
                  1  |   .1284323   .0721572     1.78   0.075      -.01306    .2699247
                     |
   year_8#c.share_re |
                  1  |   .2540649    .073003     3.48   0.001      .110914    .3972158
                     |
   year_9#c.share_re |
                  1  |   .1748904   .0861975     2.03   0.043     .0058665    .3439143
                     |
  year_10#c.share_re |
                  1  |   .0907251   .0803904     1.13   0.259    -.0669115    .2483618
                     |
  year_11#c.share_re |
                  1  |          0  (omitted)
                     |
           share_ira |   .0093598   .0313878     0.30   0.766    -.0521883    .0709078
                     |
  year_1#c.share_ira |
                  1  |   -.177083    .041513    -4.27   0.000    -.2584855   -.0956806
                     |
  year_2#c.share_ira |
                  1  |  -.0469689   .0397731    -1.18   0.238    -.1249595    .0310217
                     |
  year_3#c.share_ira |
                  1  |  -.0901931   .0417738    -2.16   0.031    -.1721069   -.0082794
                     |
  year_4#c.share_ira |
                  1  |  -.0501612   .0512993    -0.98   0.328    -.1507536    .0504311
                     |
  year_5#c.share_ira |
                  1  |  -.0734274   .0370925    -1.98   0.048    -.1461617   -.0006931
                     |
  year_6#c.share_ira |
                  1  |  -.0737898   .0385374    -1.91   0.056    -.1493574    .0017778
                     |
  year_7#c.share_ira |
                  1  |   .0583092   .0589893     0.99   0.323    -.0573622    .1739807
                     |
  year_8#c.share_ira |
                  1  |   .0325214   .0382989     0.85   0.396    -.0425784    .1076213
                     |
  year_9#c.share_ira |
                  1  |   .0475985   .0393253     1.21   0.226    -.0295141    .1247111
                     |
 year_10#c.share_ira |
                  1  |  -.1045655   .0395207    -2.65   0.008    -.1820613   -.0270696
                     |
 year_11#c.share_ira |
                  1  |          0  (omitted)
                     |
           share_bus |   .1208018   .0649768     1.86   0.063    -.0066106    .2482141
                     |
  year_1#c.share_bus |
                  1  |  -.2580575   .0812798    -3.17   0.002    -.4174383   -.0986767
                     |
  year_2#c.share_bus |
                  1  |  -.0667944    .077902    -0.86   0.391    -.2195516    .0859629
                     |
  year_3#c.share_bus |
                  1  |  -.0298723   .0795993    -0.38   0.707    -.1859579    .1262132
                     |
  year_4#c.share_bus |
                  1  |  -.0899649   .0728261    -1.24   0.217     -.232769    .0528391
                     |
  year_5#c.share_bus |
                  1  |  -.0318227    .078868    -0.40   0.687    -.1864741    .1228287
                     |
  year_6#c.share_bus |
                  1  |  -.1429275   .0726124    -1.97   0.049    -.2853124   -.0005426
                     |
  year_7#c.share_bus |
                  1  |  -.0855584   .0750658    -1.14   0.254    -.2327542    .0616375
                     |
  year_8#c.share_bus |
                  1  |   .1917151   .1319626     1.45   0.146     -.067049    .4504792
                     |
  year_9#c.share_bus |
                  1  |  -.0859693   .0896524    -0.96   0.338    -.2617679    .0898292
                     |
 year_10#c.share_bus |
                  1  |  -.2050485   .0840868    -2.44   0.015    -.3699334   -.0401635
                     |
 year_11#c.share_bus |
                  1  |          0  (omitted)
                     |
     liability_share |    .018481   .0327163     0.56   0.572     -.045672    .0826339
               _cons |   .2056936   .0842446     2.44   0.015     .0404991     .370888
--------------------------------------------------------------------------------------
r; t=0.78 20:41:55

. 
. di as txt ""

r; t=0.00 20:41:55

. 
. * ---------------------------------------------------------------------
. * Regression 2.4: r_annual_excl_trim (excluding residential, trimmed)
. * ---------------------------------------------------------------------
. di as txt "===================================================================="
====================================================================
r; t=0.00 20:41:55

. di as txt "Regression 2.4: r_annual_excl_trim (excluding residential, trimmed)"
Regression 2.4: r_annual_excl_trim (excluding residential, trimmed)
r; t=0.00 20:41:55

. di as txt "===================================================================="
====================================================================
r; t=0.00 20:41:55

. 
. eststo reg2_4: reg r_annual_excl_trim age age_sq raedyrs i.inlbrf i.married i.born_us ///
>     i.wealth_nonres_d2 i.wealth_nonres_d3 i.wealth_nonres_d4 i.wealth_nonres_d5 i.wealth_nonres_d6 ///
>     i.wealth_nonres_d7 i.wealth_nonres_d8 i.wealth_nonres_d9 i.wealth_nonres_d10 ///
>     c.share_stk##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year_10 year_11) ///
>     c.share_bond##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year_10 year_11) ///
>     c.share_re##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year_10 year_11) ///
>     c.share_ira##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year_10 year_11) ///
>     c.share_bus##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year_10 year_11) ///
>     liability_share, vce(cluster hhidpn)
note: 1.year_11 omitted because of collinearity.
note: 1.year_11#c.share_stk omitted because of collinearity.
note: 1.year_11#c.share_bond omitted because of collinearity.
note: 1.year_11#c.share_re omitted because of collinearity.
note: 1.year_11#c.share_ira omitted because of collinearity.
note: 1.year_11#c.share_bus omitted because of collinearity.

Linear regression                               Number of obs     =     26,205
                                                F(81, 2563)       =      15.20
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0461
                                                Root MSE          =     .15555

                                     (Std. err. adjusted for 2,564 clusters in hhidpn)
--------------------------------------------------------------------------------------
                     |               Robust
  r_annual_excl_trim | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 age |  -.0014889   .0013888    -1.07   0.284    -.0042121    .0012343
              age_sq |   7.13e-06   9.88e-06     0.72   0.470    -.0000122    .0000265
             raedyrs |    .005641   .0004026    14.01   0.000     .0048517    .0064304
                     |
              inlbrf |
              1.yes  |   .0131661   .0022404     5.88   0.000     .0087728    .0175593
                     |
             married |
                yes  |   .0111989   .0023349     4.80   0.000     .0066204    .0157775
                     |
             born_us |
                yes  |   -.000797   .0031438    -0.25   0.800    -.0069617    .0053677
  1.wealth_nonres_d2 |  -.0081221   .0074502    -1.09   0.276    -.0227312     .006487
  1.wealth_nonres_d3 |  -.0195626   .0067221    -2.91   0.004     -.032744   -.0063813
  1.wealth_nonres_d4 |  -.0235043   .0072536    -3.24   0.001    -.0377278   -.0092809
  1.wealth_nonres_d5 |  -.0321671   .0073954    -4.35   0.000    -.0466687   -.0176655
  1.wealth_nonres_d6 |  -.0465535   .0072056    -6.46   0.000    -.0606829   -.0324241
  1.wealth_nonres_d7 |  -.0528606   .0074736    -7.07   0.000    -.0675155   -.0382056
  1.wealth_nonres_d8 |  -.0595603   .0076333    -7.80   0.000    -.0745285   -.0445922
  1.wealth_nonres_d9 |  -.0610072   .0078519    -7.77   0.000    -.0764039   -.0456105
 1.wealth_nonres_d10 |  -.0812998   .0082981    -9.80   0.000    -.0975715   -.0650281
           share_stk |  -.0111532   .0223706    -0.50   0.618    -.0550194     .032713
            1.year_1 |  -.0021375   .0081795    -0.26   0.794    -.0181766    .0139015
            1.year_2 |  -.0013319    .007267    -0.18   0.855    -.0155817     .012918
            1.year_3 |   .0079374   .0072982     1.09   0.277    -.0063736    .0222485
            1.year_4 |  -.0166791   .0065921    -2.53   0.011    -.0296055   -.0037528
            1.year_5 |  -.0335413   .0061001    -5.50   0.000     -.045503   -.0215795
            1.year_6 |  -.0254899   .0061006    -4.18   0.000    -.0374526   -.0135272
            1.year_7 |  -.0055551   .0063836    -0.87   0.384    -.0180727    .0069624
            1.year_8 |  -.0179008   .0061773    -2.90   0.004    -.0300138   -.0057879
            1.year_9 |   -.015553   .0061957    -2.51   0.012    -.0277021   -.0034039
           1.year_10 |   -.017433   .0063399    -2.75   0.006    -.0298648   -.0050013
           1.year_11 |          0  (omitted)
                     |
  year_1#c.share_stk |
                  1  |  -.0758931    .031559    -2.40   0.016    -.1377768   -.0140094
                     |
  year_2#c.share_stk |
                  1  |  -.0071027    .031697    -0.22   0.823     -.069257    .0550517
                     |
  year_3#c.share_stk |
                  1  |  -.0084846   .0313142    -0.27   0.786    -.0698884    .0529191
                     |
  year_4#c.share_stk |
                  1  |   -.001701   .0295291    -0.06   0.954    -.0596044    .0562024
                     |
  year_5#c.share_stk |
                  1  |  -.0335064   .0288861    -1.16   0.246     -.090149    .0231361
                     |
  year_6#c.share_stk |
                  1  |   .0333904   .0282549     1.18   0.237    -.0220143     .088795
                     |
  year_7#c.share_stk |
                  1  |   .0625022   .0272453     2.29   0.022     .0090772    .1159271
                     |
  year_8#c.share_stk |
                  1  |   .0335178   .0283643     1.18   0.237    -.0221015    .0891371
                     |
  year_9#c.share_stk |
                  1  |   .0190567   .0301772     0.63   0.528    -.0401174    .0782309
                     |
 year_10#c.share_stk |
                  1  |   .0090782   .0291734     0.31   0.756    -.0481276     .066284
                     |
 year_11#c.share_stk |
                  1  |          0  (omitted)
                     |
          share_bond |   -.113304   .0616127    -1.84   0.066    -.2341199    .0075118
                     |
 year_1#c.share_bond |
                  1  |    .374593   .1092932     3.43   0.001     .1602812    .5889049
                     |
 year_2#c.share_bond |
                  1  |   .1639963   .1185056     1.38   0.167      -.06838    .3963727
                     |
 year_3#c.share_bond |
                  1  |   .0804089   .1092204     0.74   0.462    -.1337602     .294578
                     |
 year_4#c.share_bond |
                  1  |   .3327319   .1205561     2.76   0.006     .0963346    .5691292
                     |
 year_5#c.share_bond |
                  1  |   .3041752   .0892531     3.41   0.001     .1291597    .4791907
                     |
 year_6#c.share_bond |
                  1  |    .283666    .081931     3.46   0.001     .1230084    .4443236
                     |
 year_7#c.share_bond |
                  1  |   .0903117   .0929042     0.97   0.331    -.0918633    .2724867
                     |
 year_8#c.share_bond |
                  1  |    .159722   .1081658     1.48   0.140    -.0523792    .3718231
                     |
 year_9#c.share_bond |
                  1  |  -.0272314   .0995623    -0.27   0.784    -.2224621    .1679993
                     |
year_10#c.share_bond |
                  1  |   .0474763   .1102104     0.43   0.667    -.1686342    .2635869
                     |
year_11#c.share_bond |
                  1  |          0  (omitted)
                     |
            share_re |  -.0614235    .042254    -1.45   0.146    -.1442789    .0214319
                     |
   year_1#c.share_re |
                  1  |   .0201713   .0529471     0.38   0.703     -.083652    .1239947
                     |
   year_2#c.share_re |
                  1  |     .06808   .0517991     1.31   0.189    -.0334922    .1696523
                     |
   year_3#c.share_re |
                  1  |   .1010099   .0494446     2.04   0.041     .0040545    .1979653
                     |
   year_4#c.share_re |
                  1  |    .033771   .0482829     0.70   0.484    -.0609064    .1284483
                     |
   year_5#c.share_re |
                  1  |  -.0279993   .0467486    -0.60   0.549    -.1196682    .0636695
                     |
   year_6#c.share_re |
                  1  |   .0075539   .0492011     0.15   0.878     -.088924    .1040318
                     |
   year_7#c.share_re |
                  1  |   .0644183   .0507819     1.27   0.205    -.0351594     .163996
                     |
   year_8#c.share_re |
                  1  |   .0671083   .0487054     1.38   0.168    -.0283975    .1626141
                     |
   year_9#c.share_re |
                  1  |   .0380347   .0520992     0.73   0.465     -.064126    .1401954
                     |
  year_10#c.share_re |
                  1  |   .1034211   .0552894     1.87   0.062    -.0049953    .2118376
                     |
  year_11#c.share_re |
                  1  |          0  (omitted)
                     |
           share_ira |   .0235631   .0182607     1.29   0.197    -.0122441    .0593703
                     |
  year_1#c.share_ira |
                  1  |  -.1406272   .0250423    -5.62   0.000    -.1897324    -.091522
                     |
  year_2#c.share_ira |
                  1  |  -.0817427   .0248649    -3.29   0.001    -.1305001   -.0329853
                     |
  year_3#c.share_ira |
                  1  |  -.0534058   .0245875    -2.17   0.030    -.1016192   -.0051925
                     |
  year_4#c.share_ira |
                  1  |  -.0827629   .0237657    -3.48   0.001    -.1293648    -.036161
                     |
  year_5#c.share_ira |
                  1  |  -.1146537    .021368    -5.37   0.000    -.1565541   -.0727533
                     |
  year_6#c.share_ira |
                  1  |   -.072641    .022324    -3.25   0.001    -.1164159   -.0288662
                     |
  year_7#c.share_ira |
                  1  |   -.049383   .0229611    -2.15   0.032    -.0944071   -.0043588
                     |
  year_8#c.share_ira |
                  1  |  -.0742167   .0232441    -3.19   0.001    -.1197958   -.0286376
                     |
  year_9#c.share_ira |
                  1  |  -.0284408   .0231575    -1.23   0.220    -.0738501    .0169685
                     |
 year_10#c.share_ira |
                  1  |  -.0754701    .023718    -3.18   0.001    -.1219785   -.0289617
                     |
 year_11#c.share_ira |
                  1  |          0  (omitted)
                     |
           share_bus |   .0480304   .0371892     1.29   0.197    -.0248936    .1209543
                     |
  year_1#c.share_bus |
                  1  |  -.1130497   .0516748    -2.19   0.029    -.2143784    -.011721
                     |
  year_2#c.share_bus |
                  1  |  -.0035675   .0500699    -0.07   0.943    -.1017491    .0946141
                     |
  year_3#c.share_bus |
                  1  |   .0225572    .045805     0.49   0.622    -.0672613    .1123757
                     |
  year_4#c.share_bus |
                  1  |   -.002319   .0474852    -0.05   0.961    -.0954322    .0907942
                     |
  year_5#c.share_bus |
                  1  |  -.0119344   .0437233    -0.27   0.785     -.097671    .0738022
                     |
  year_6#c.share_bus |
                  1  |    -.07479   .0447086    -1.67   0.094    -.1624587    .0128787
                     |
  year_7#c.share_bus |
                  1  |  -.0339221   .0426732    -0.79   0.427    -.1175996    .0497555
                     |
  year_8#c.share_bus |
                  1  |  -.0582988   .0448465    -1.30   0.194    -.1462378    .0296402
                     |
  year_9#c.share_bus |
                  1  |  -.0479417   .0488384    -0.98   0.326    -.1437084     .047825
                     |
 year_10#c.share_bus |
                  1  |  -.0850541   .0479542    -1.77   0.076     -.179087    .0089789
                     |
 year_11#c.share_bus |
                  1  |          0  (omitted)
                     |
     liability_share |   -.004267   .0180415    -0.24   0.813    -.0396444    .0311104
               _cons |   .0743468   .0493901     1.51   0.132    -.0225017    .1711953
--------------------------------------------------------------------------------------
r; t=0.72 20:41:56

. 
. di as txt ""

r; t=0.00 20:41:56

. 
. * ---------------------------------------------------------------------
. * Export results
. * ---------------------------------------------------------------------
. di as txt "===================================================================="
====================================================================
r; t=0.00 20:41:56

. di as txt "Exporting results to shares_interacted.tex"
Exporting results to shares_interacted.tex
r; t=0.00 20:41:56

. di as txt "===================================================================="
====================================================================
r; t=0.00 20:41:56

. 
. esttab reg2_1 reg2_2 reg2_3 reg2_4 using "shares_interacted.tex", replace ///
>     se star(* 0.10 ** 0.05 *** 0.01) ///
>     label booktabs compress nogaps ///
>     stats(N r2 r2_a, labels("Observations" "R-squared" "Adjusted R-squared")) ///
>     title("Asset Shares Interacted with Year Dummies") ///
>     addnote("Clustered standard errors at individual level in parentheses" ///
>             "*** p<0.01, ** p<0.05, * p<0.10" ///
>             "Asset shares interacted with year dummies: share_stk, share_bond, share_re, share_ira, share_bus" ///
>             "Joint F-tests for coefficient equality across years reported in log file")
(output written to shares_interacted.tex)
r; t=0.98 20:41:57

. 
. * Display summary results in log
. di as txt ""

r; t=0.00 20:41:57

. di as txt "===================================================================="
====================================================================
r; t=0.00 20:41:57

. di as txt "=== Summary: Joint F-test Results (from Regression 2.1)         ==="
=== Summary: Joint F-test Results (from Regression 2.1)         ===
r; t=0.00 20:41:57

. di as txt "===================================================================="
====================================================================
r; t=0.00 20:41:57

. di as txt ""

r; t=0.00 20:41:57

. di as txt "Asset Share      F-statistic    p-value"
Asset Share      F-statistic    p-value
r; t=0.00 20:41:57

. di as txt "----------------------------------------------"
----------------------------------------------
r; t=0.00 20:41:57

. di as txt "Stock            " %6.2f `fstat_stk' "        " %6.4f `p_stk'
Stock              0.21        0.6437
r; t=0.00 20:41:57

. di as txt "Bond             " %6.2f `fstat_bond' "        " %6.4f `p_bond'
Bond               1.04        0.3077
r; t=0.00 20:41:57

. di as txt "Real Estate      " %6.2f `fstat_re' "        " %6.4f `p_re'
Real Estate        0.01        0.9351
r; t=0.00 20:41:57

. di as txt "IRA              " %6.2f `fstat_ira' "        " %6.4f `p_ira'
IRA                2.17        0.1412
r; t=0.00 20:41:57

. di as txt "Business         " %6.2f `fstat_bus' "        " %6.4f `p_bus'
Business           3.76        0.0527
r; t=0.00 20:41:57

. di as txt ""

r; t=0.00 20:41:57

. 
. di as txt ""

r; t=0.00 20:41:57

. di as txt "===================================================================="
====================================================================
r; t=0.00 20:41:57

. di as txt "=== Asset Shares Ã— Year Interactions Complete                   ==="
=== Asset Shares Ã— Year Interactions Complete                   ===
r; t=0.00 20:41:57

. di as txt "===================================================================="
====================================================================
r; t=0.00 20:41:57

. 
. log off
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/randhrs1992_2022v1_STATA/reg_shares_interacted.log
  log type:  text
 paused on:  17 Oct 2025, 20:41:57
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
