---------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/rand
> hrs1992_2022v1_STATA/reg_shares_interacted.log
  log type:  text
 opened on:  20 Oct 2025, 10:16:26

. 
. set more off

. log on
(log already on)

. 
. * Install estout package if not already installed
. capture which estout

. if _rc {
.     ssc install estout, replace
. }

. 
. di as txt "===================================================================="
====================================================================

. di as txt "=== Regression Set 2: Asset Shares Ã— Year Interactions          ==="
=== Regression Set 2: Asset Shares Ã— Year Interactions          ===

. di as txt "===================================================================="
====================================================================

. di as txt ""


. 
. * ---------------------------------------------------------------------
. * Regression 2.1: r_annual (including residential)
. * ---------------------------------------------------------------------
. di as txt "===================================================================="
====================================================================

. di as txt "Regression 2.1: r_annual (including residential)"
Regression 2.1: r_annual (including residential)

. di as txt "===================================================================="
====================================================================

. 
. * Load fresh data
. use "_randhrs1992_2022v1_panel.dta", clear

. 
. * Set panel structure
. xtset hhidpn year

Panel variable: hhidpn (strongly balanced)
 Time variable: year, 2002 to 2022, but with gaps
         Delta: 1 unit

. gen age_sq = age^2
(82,616 missing values generated)

. 
. eststo clear

. eststo reg2_1: reg r_annual age age_sq raedyrs i.inlbrf i.married i.born_us ///
>     i.wealth_d2 i.wealth_d3 i.wealth_d4 i.wealth_d5 i.wealth_d6 ///
>     i.wealth_d7 i.wealth_d8 i.wealth_d9 i.wealth_d10 ///
>     c.share_stk##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year
> _10 year_11) ///
>     c.share_bond##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 yea
> r_10 year_11) ///
>     c.share_re##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year_
> 10 year_11) ///
>     c.share_ira##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year
> _10 year_11) ///
>     c.share_bus##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year
> _10 year_11) ///
>     liability_share, vce(cluster hhidpn)
note: 1.year_11 omitted because of collinearity.
note: 1.year_11#c.share_stk omitted because of collinearity.
note: 1.year_11#c.share_bond omitted because of collinearity.
note: 1.year_11#c.share_re omitted because of collinearity.
note: 1.year_11#c.share_ira omitted because of collinearity.
note: 1.year_11#c.share_bus omitted because of collinearity.

Linear regression                               Number of obs     =     71,264
                                                F(81, 11318)      =      42.03
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0539
                                                Root MSE          =     .46427

                                    (Std. err. adjusted for 11,319 clusters in hhidpn)
--------------------------------------------------------------------------------------
                     |               Robust
            r_annual | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 age |    .004604   .0019402     2.37   0.018     .0008008    .0084071
              age_sq |   -.000049   .0000146    -3.36   0.001    -.0000775   -.0000204
             raedyrs |    .014101   .0007086    19.90   0.000     .0127121    .0154899
                     |
              inlbrf |
              1.yes  |   .0418203   .0039222    10.66   0.000     .0341322    .0495084
                     |
             married |
                yes  |   .0408363   .0040882     9.99   0.000     .0328226    .0488499
                     |
             born_us |
                yes  |  -.0055941   .0057092    -0.98   0.327    -.0167851    .0055969
         1.wealth_d2 |  -.0010081    .015862    -0.06   0.949    -.0321004    .0300842
         1.wealth_d3 |   .0035432   .0151489     0.23   0.815    -.0261513    .0332377
         1.wealth_d4 |   .0130709   .0151594     0.86   0.389     -.016644    .0427859
         1.wealth_d5 |  -.0124857    .014793    -0.84   0.399    -.0414825    .0165112
         1.wealth_d6 |  -.0675524   .0150102    -4.50   0.000     -.096975   -.0381298
         1.wealth_d7 |  -.1110328   .0159074    -6.98   0.000    -.1422142   -.0798515
         1.wealth_d8 |  -.1474341   .0170705    -8.64   0.000    -.1808953    -.113973
         1.wealth_d9 |  -.1871363   .0180863   -10.35   0.000    -.2225887    -.151684
        1.wealth_d10 |  -.2554135   .0201345   -12.69   0.000    -.2948807   -.2159464
           share_stk |  -.0237668   .0317968    -0.75   0.455     -.086094    .0385605
            1.year_1 |  -.0777554   .0171512    -4.53   0.000    -.1113746   -.0441361
            1.year_2 |  -.1268465   .0147954    -8.57   0.000     -.155848    -.097845
            1.year_3 |  -.0780167   .0174162    -4.48   0.000    -.1121554   -.0438781
            1.year_4 |  -.1767934   .0144095   -12.27   0.000    -.2050385   -.1485483
            1.year_5 |  -.2421539   .0132336   -18.30   0.000    -.2680941   -.2162136
            1.year_6 |  -.1981798   .0131799   -15.04   0.000    -.2240148   -.1723448
            1.year_7 |  -.1288546   .0137087    -9.40   0.000     -.155726   -.1019831
            1.year_8 |  -.1247396   .0143401    -8.70   0.000    -.1528487   -.0966306
            1.year_9 |  -.1076216   .0126496    -8.51   0.000     -.132417   -.0828262
           1.year_10 |  -.0931888   .0154272    -6.04   0.000    -.1234288   -.0629489
           1.year_11 |          0  (omitted)
                     |
  year_1#c.share_stk |
                  1  |  -.1049481   .0519064    -2.02   0.043    -.2066936   -.0032026
                     |
  year_2#c.share_stk |
                  1  |   .1363902   .0487393     2.80   0.005     .0408528    .2319277
                     |
  year_3#c.share_stk |
                  1  |   .1126189   .0506541     2.22   0.026      .013328    .2119098
                     |
  year_4#c.share_stk |
                  1  |   .1272785   .0519141     2.45   0.014     .0255179    .2290392
                     |
  year_5#c.share_stk |
                  1  |   .1947934   .0441601     4.41   0.000     .1082319    .2813549
                     |
  year_6#c.share_stk |
                  1  |   .1884505   .0390317     4.83   0.000     .1119416    .2649594
                     |
  year_7#c.share_stk |
                  1  |   .2313278   .0402969     5.74   0.000     .1523388    .3103167
                     |
  year_8#c.share_stk |
                  1  |   .1320347   .0464978     2.84   0.005      .040891    .2231783
                     |
  year_9#c.share_stk |
                  1  |    .167648   .0416209     4.03   0.000     .0860639    .2492321
                     |
 year_10#c.share_stk |
                  1  |   .1945701   .0724967     2.68   0.007     .0524641    .3366762
                     |
 year_11#c.share_stk |
                  1  |          0  (omitted)
                     |
          share_bond |  -.0766175   .0921698    -0.83   0.406    -.2572863    .1040513
                     |
 year_1#c.share_bond |
                  1  |   .4284501   .1390682     3.08   0.002     .1558522    .7010481
                     |
 year_2#c.share_bond |
                  1  |   .3735938   .1416586     2.64   0.008     .0959183    .6512693
                     |
 year_3#c.share_bond |
                  1  |   .1576988     .16092     0.98   0.327    -.1577323    .4731299
                     |
 year_4#c.share_bond |
                  1  |   .7957264    .292086     2.72   0.006     .2231871    1.368266
                     |
 year_5#c.share_bond |
                  1  |   .5899373   .1761822     3.35   0.001     .2445896     .935285
                     |
 year_6#c.share_bond |
                  1  |   .3296115   .1493054     2.21   0.027      .036947    .6222759
                     |
 year_7#c.share_bond |
                  1  |   .4150228   .1371357     3.03   0.002     .1462131    .6838326
                     |
 year_8#c.share_bond |
                  1  |   .3692653   .1501376     2.46   0.014     .0749696    .6635609
                     |
 year_9#c.share_bond |
                  1  |   .2666809   .1278548     2.09   0.037     .0160633    .5172985
                     |
year_10#c.share_bond |
                  1  |   .0908199   .1416154     0.64   0.521    -.1867708    .3684106
                     |
year_11#c.share_bond |
                  1  |          0  (omitted)
                     |
            share_re |  -.0845024   .0445639    -1.90   0.058    -.1718554    .0028506
                     |
   year_1#c.share_re |
                  1  |   .1183617   .0773343     1.53   0.126     -.033227    .2699505
                     |
   year_2#c.share_re |
                  1  |   .2440432   .0592123     4.12   0.000     .1279768    .3601096
                     |
   year_3#c.share_re |
                  1  |   .2492576   .0604084     4.13   0.000     .1308467    .3676686
                     |
   year_4#c.share_re |
                  1  |   .1619246   .0602042     2.69   0.007      .043914    .2799352
                     |
   year_5#c.share_re |
                  1  |   .1295666   .0536003     2.42   0.016     .0245007    .2346325
                     |
   year_6#c.share_re |
                  1  |   .1871973   .0776743     2.41   0.016     .0349422    .3394524
                     |
   year_7#c.share_re |
                  1  |   .2331579    .059713     3.90   0.000       .11611    .3502058
                     |
   year_8#c.share_re |
                  1  |   .2721033   .0555868     4.90   0.000     .1631435     .381063
                     |
   year_9#c.share_re |
                  1  |    .207721   .0574474     3.62   0.000     .0951141    .3203279
                     |
  year_10#c.share_re |
                  1  |   .3143612    .160554     1.96   0.050    -.0003526     .629075
                     |
  year_11#c.share_re |
                  1  |          0  (omitted)
                     |
           share_ira |   .0690861   .0577496     1.20   0.232    -.0441131    .1822854
                     |
  year_1#c.share_ira |
                  1  |  -.1916852   .0629678    -3.04   0.002     -.315113   -.0682574
                     |
  year_2#c.share_ira |
                  1  |  -.0292981    .063075    -0.46   0.642     -.152936    .0943397
                     |
  year_3#c.share_ira |
                  1  |   -.026951   .0920847    -0.29   0.770     -.207453    .1535511
                     |
  year_4#c.share_ira |
                  1  |   .0026179   .0736847     0.04   0.972    -.1418169    .1470527
                     |
  year_5#c.share_ira |
                  1  |   .0371993   .0604051     0.62   0.538    -.0812052    .1556038
                     |
  year_6#c.share_ira |
                  1  |   .0735843   .0638733     1.15   0.249    -.0516184     .198787
                     |
  year_7#c.share_ira |
                  1  |   .0579292    .065485     0.88   0.376    -.0704328    .1862912
                     |
  year_8#c.share_ira |
                  1  |  -.0058583   .0583431    -0.10   0.920    -.1202208    .1085043
                     |
  year_9#c.share_ira |
                  1  |   .0155664    .062669     0.25   0.804    -.1072757    .1384084
                     |
 year_10#c.share_ira |
                  1  |  -.0712962   .0590384    -1.21   0.227    -.1870217    .0444293
                     |
 year_11#c.share_ira |
                  1  |          0  (omitted)
                     |
           share_bus |   .0357042   .0555867     0.64   0.521    -.0732555    .1446639
                     |
  year_1#c.share_bus |
                  1  |  -.0823989   .0801637    -1.03   0.304    -.2395337    .0747359
                     |
  year_2#c.share_bus |
                  1  |   .0907877   .0727564     1.25   0.212    -.0518275    .2334029
                     |
  year_3#c.share_bus |
                  1  |   .0436534   .0688172     0.63   0.526    -.0912404    .1785471
                     |
  year_4#c.share_bus |
                  1  |   .0669807   .0671095     1.00   0.318    -.0645655    .1985269
                     |
  year_5#c.share_bus |
                  1  |   .2248904   .0752565     2.99   0.003     .0773746    .3724062
                     |
  year_6#c.share_bus |
                  1  |   .1668329   .0625142     2.67   0.008     .0442942    .2893716
                     |
  year_7#c.share_bus |
                  1  |   .1755834    .068814     2.55   0.011     .0406961    .3104707
                     |
  year_8#c.share_bus |
                  1  |   .2984352   .1681301     1.78   0.076    -.0311291    .6279995
                     |
  year_9#c.share_bus |
                  1  |   .0549992   .0659835     0.83   0.405    -.0743399    .1843384
                     |
 year_10#c.share_bus |
                  1  |  -.0194754    .070502    -0.28   0.782    -.1576716    .1187208
                     |
 year_11#c.share_bus |
                  1  |          0  (omitted)
                     |
     liability_share |   .1655164   .0337068     4.91   0.000     .0994453    .2315875
               _cons |  -.0429011   .0665689    -0.64   0.519    -.1733877    .0875856
--------------------------------------------------------------------------------------

. 
. * Joint F-tests for asset shares
. di as txt ""


. di as txt "--- Joint F-tests: Testing equality of coefficients across years ---"
--- Joint F-tests: Testing equality of coefficients across years ---

. di as txt ""


. 
. * Note: These tests check if the interaction coefficients are jointly different from 
> zero
. * which tests whether asset share effects vary significantly across years
. 
. di as txt "Test 1: Stock share (main and interactions)"
Test 1: Stock share (main and interactions)

. quietly test c.share_stk

. local fstat_stk = r(F)

. local p_stk = r(p)

. di as txt "F-statistic: " %6.2f `fstat_stk' "  p-value: " %6.4f `p_stk'
F-statistic:   0.56  p-value: 0.4548

. 
. di as txt ""


. di as txt "Test 2: Bond share (main and interactions)"
Test 2: Bond share (main and interactions)

. quietly test c.share_bond

. local fstat_bond = r(F)

. local p_bond = r(p)

. di as txt "F-statistic: " %6.2f `fstat_bond' "  p-value: " %6.4f `p_bond'
F-statistic:   0.69  p-value: 0.4058

. 
. di as txt ""


. di as txt "Test 3: Real estate share (main and interactions)"
Test 3: Real estate share (main and interactions)

. quietly test c.share_re

. local fstat_re = r(F)

. local p_re = r(p)

. di as txt "F-statistic: " %6.2f `fstat_re' "  p-value: " %6.4f `p_re'
F-statistic:   3.60  p-value: 0.0580

. 
. di as txt ""


. di as txt "Test 4: IRA share (main and interactions)"
Test 4: IRA share (main and interactions)

. quietly test c.share_ira

. local fstat_ira = r(F)

. local p_ira = r(p)

. di as txt "F-statistic: " %6.2f `fstat_ira' "  p-value: " %6.4f `p_ira'
F-statistic:   1.43  p-value: 0.2316

. 
. di as txt ""


. di as txt "Test 5: Business share (main and interactions)"
Test 5: Business share (main and interactions)

. quietly test c.share_bus

. local fstat_bus = r(F)

. local p_bus = r(p)

. di as txt "F-statistic: " %6.2f `fstat_bus' "  p-value: " %6.4f `p_bus'
F-statistic:   0.41  p-value: 0.5207

. 
. di as txt ""


. 
. * ---------------------------------------------------------------------
. * Regression 2.2: r_annual_trim (including residential, trimmed)
. * ---------------------------------------------------------------------
. di as txt "===================================================================="
====================================================================

. di as txt "Regression 2.2: r_annual_trim (including residential, trimmed)"
Regression 2.2: r_annual_trim (including residential, trimmed)

. di as txt "===================================================================="
====================================================================

. 
. * Load fresh data and restrict to balanced panel for r_annual_trim
. use "_randhrs1992_2022v1_panel.dta", clear

. 
. * Count non-missing r_annual_trim per individual
. bysort hhidpn: egen n_nonmiss = count(r_annual_trim) if !missing(r_annual_trim)
(109,869 missing values generated)

. bysort hhidpn: egen total_obs = count(r_annual_trim)

. bysort hhidpn: egen max_nonmiss = max(n_nonmiss)
(55,088 missing values generated)

. 
. * Keep only individuals with non-missing r_annual_trim in ALL years (11 years total)
. keep if max_nonmiss == 11 & total_obs == 11
(155,650 observations deleted)

. drop n_nonmiss total_obs max_nonmiss

. 
. * Verify balanced panel
. bysort hhidpn: gen n_obs = _N

. summarize n_obs

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       n_obs |     18,766          11           0         11         11

. di as txt "Sample restricted to individuals with r_annual_trim in all 11 years: " _N 
> " observations"
Sample restricted to individuals with r_annual_trim in all 11 years: 18766 observations

. di as txt "Min obs per individual: " r(min) ", Max obs per individual: " r(max)
Min obs per individual: 11, Max obs per individual: 11

. drop n_obs

. 
. * Set panel structure
. xtset hhidpn year

Panel variable: hhidpn (strongly balanced)
 Time variable: year, 2002 to 2022, but with gaps
         Delta: 1 unit

. gen age_sq = age^2

. 
. eststo reg2_2: reg r_annual_trim age age_sq raedyrs i.inlbrf i.married i.born_us ///
>     i.wealth_d2 i.wealth_d3 i.wealth_d4 i.wealth_d5 i.wealth_d6 ///
>     i.wealth_d7 i.wealth_d8 i.wealth_d9 i.wealth_d10 ///
>     c.share_stk##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year
> _10 year_11) ///
>     c.share_bond##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 yea
> r_10 year_11) ///
>     c.share_re##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year_
> 10 year_11) ///
>     c.share_ira##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year
> _10 year_11) ///
>     c.share_bus##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year
> _10 year_11) ///
>     liability_share, vce(cluster hhidpn)
note: 1.year_11 omitted because of collinearity.
note: 1.year_11#c.share_stk omitted because of collinearity.
note: 1.year_11#c.share_bond omitted because of collinearity.
note: 1.year_11#c.share_re omitted because of collinearity.
note: 1.year_11#c.share_ira omitted because of collinearity.
note: 1.year_11#c.share_bus omitted because of collinearity.

Linear regression                               Number of obs     =     18,724
                                                F(81, 1704)       =      27.73
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0873
                                                Root MSE          =     .19756

                                     (Std. err. adjusted for 1,705 clusters in hhidpn)
--------------------------------------------------------------------------------------
                     |               Robust
       r_annual_trim | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 age |   .0005361   .0021542     0.25   0.803    -.0036891    .0047613
              age_sq |  -.0000149   .0000155    -0.96   0.338    -.0000453    .0000156
             raedyrs |   .0077656   .0005596    13.88   0.000      .006668    .0088632
                     |
              inlbrf |
              1.yes  |   .0118933   .0030831     3.86   0.000     .0058463    .0179404
                     |
             married |
                yes  |   .0158908   .0033247     4.78   0.000     .0093698    .0224118
                     |
             born_us |
                yes  |  -.0133058   .0040771    -3.26   0.001    -.0213025    -.005309
         1.wealth_d2 |  -.0362021   .0168022    -2.15   0.031    -.0691571   -.0032471
         1.wealth_d3 |  -.0452819   .0163123    -2.78   0.006    -.0772763   -.0132876
         1.wealth_d4 |  -.0512672   .0157929    -3.25   0.001    -.0822428   -.0202916
         1.wealth_d5 |  -.0664984   .0156115    -4.26   0.000    -.0971181   -.0358786
         1.wealth_d6 |  -.0844848   .0152447    -5.54   0.000    -.1143851   -.0545846
         1.wealth_d7 |  -.1060639   .0156154    -6.79   0.000    -.1366913   -.0754365
         1.wealth_d8 |  -.1211065   .0156956    -7.72   0.000    -.1518912   -.0903217
         1.wealth_d9 |  -.1410802   .0158727    -8.89   0.000    -.1722122   -.1099481
        1.wealth_d10 |  -.1732183   .0163902   -10.57   0.000    -.2053653   -.1410713
           share_stk |  -.0173021   .0324095    -0.53   0.594    -.0808686    .0462644
            1.year_1 |  -.0510038   .0132961    -3.84   0.000    -.0770823   -.0249253
            1.year_2 |  -.0339474   .0120065    -2.83   0.005    -.0574964   -.0103983
            1.year_3 |  -.0190912   .0131257    -1.45   0.146    -.0448353    .0066529
            1.year_4 |  -.1071341   .0116138    -9.22   0.000    -.1299129   -.0843553
            1.year_5 |  -.1597705   .0118413   -13.49   0.000    -.1829956   -.1365455
            1.year_6 |  -.1203426   .0113686   -10.59   0.000    -.1426404   -.0980448
            1.year_7 |  -.0589774   .0115678    -5.10   0.000    -.0816659   -.0362888
            1.year_8 |  -.0696024   .0116534    -5.97   0.000     -.092459   -.0467459
            1.year_9 |  -.0632021   .0112311    -5.63   0.000    -.0852303   -.0411738
           1.year_10 |  -.0605102   .0125859    -4.81   0.000    -.0851958   -.0358247
           1.year_11 |          0  (omitted)
                     |
  year_1#c.share_stk |
                  1  |  -.0743288   .0424542    -1.75   0.080    -.1575967    .0089391
                     |
  year_2#c.share_stk |
                  1  |  -.0060348   .0451597    -0.13   0.894     -.094609    .0825394
                     |
  year_3#c.share_stk |
                  1  |   .0088247   .0489251     0.18   0.857    -.0871349    .1047842
                     |
  year_4#c.share_stk |
                  1  |   .0401959   .0430651     0.93   0.351    -.0442702     .124662
                     |
  year_5#c.share_stk |
                  1  |   .0677221   .0421045     1.61   0.108    -.0148599    .1503041
                     |
  year_6#c.share_stk |
                  1  |   .1041475   .0401836     2.59   0.010     .0253331     .182962
                     |
  year_7#c.share_stk |
                  1  |   .1092052   .0430077     2.54   0.011     .0248518    .1935587
                     |
  year_8#c.share_stk |
                  1  |   .0507714    .043641     1.16   0.245    -.0348242     .136367
                     |
  year_9#c.share_stk |
                  1  |   .0371397   .0426712     0.87   0.384    -.0465538    .1208331
                     |
 year_10#c.share_stk |
                  1  |  -.0164686   .0429623    -0.38   0.702     -.100733    .0677957
                     |
 year_11#c.share_stk |
                  1  |          0  (omitted)
                     |
          share_bond |  -.2529986    .068488    -3.69   0.000    -.3873281   -.1186691
                     |
 year_1#c.share_bond |
                  1  |   .5568394   .1316487     4.23   0.000     .2986294    .8150495
                     |
 year_2#c.share_bond |
                  1  |   .1635644     .13094     1.25   0.212    -.0932557    .4203846
                     |
 year_3#c.share_bond |
                  1  |   .2605745   .1426557     1.83   0.068    -.0192243    .5403732
                     |
 year_4#c.share_bond |
                  1  |   .7665072   .1897097     4.04   0.000     .3944187    1.138596
                     |
 year_5#c.share_bond |
                  1  |   .5589891   .1129641     4.95   0.000     .3374262     .780552
                     |
 year_6#c.share_bond |
                  1  |   .5065713   .0996543     5.08   0.000     .3111136     .702029
                     |
 year_7#c.share_bond |
                  1  |   .3672766    .106071     3.46   0.001     .1592334    .5753198
                     |
 year_8#c.share_bond |
                  1  |    .494256   .1138891     4.34   0.000     .2708788    .7176333
                     |
 year_9#c.share_bond |
                  1  |   .3896449   .1120171     3.48   0.001     .1699394    .6093504
                     |
year_10#c.share_bond |
                  1  |   .3093347   .1535501     2.01   0.044     .0081681    .6105013
                     |
year_11#c.share_bond |
                  1  |          0  (omitted)
                     |
            share_re |  -.1348096   .0590274    -2.28   0.023    -.2505834   -.0190358
                     |
   year_1#c.share_re |
                  1  |   .1287824   .0718675     1.79   0.073    -.0121755    .2697403
                     |
   year_2#c.share_re |
                  1  |   .1737802   .0707427     2.46   0.014     .0350285     .312532
                     |
   year_3#c.share_re |
                  1  |    .243846   .0722466     3.38   0.001     .1021447    .3855473
                     |
   year_4#c.share_re |
                  1  |   .2149736   .0636317     3.38   0.001     .0901692     .339778
                     |
   year_5#c.share_re |
                  1  |   .1222596   .0711418     1.72   0.086    -.0172749    .2617942
                     |
   year_6#c.share_re |
                  1  |   .2094995   .0651136     3.22   0.001     .0817884    .3372106
                     |
   year_7#c.share_re |
                  1  |   .0849008   .0756921     1.12   0.262    -.0635585      .23336
                     |
   year_8#c.share_re |
                  1  |   .1935908   .0708407     2.73   0.006     .0546469    .3325347
                     |
   year_9#c.share_re |
                  1  |   .1504501    .073129     2.06   0.040     .0070181    .2938822
                     |
  year_10#c.share_re |
                  1  |   .1867375   .0856179     2.18   0.029     .0188102    .3546648
                     |
  year_11#c.share_re |
                  1  |          0  (omitted)
                     |
           share_ira |  -.0141015   .0284251    -0.50   0.620    -.0698533    .0416504
                     |
  year_1#c.share_ira |
                  1  |  -.0915978   .0363869    -2.52   0.012    -.1629656     -.02023
                     |
  year_2#c.share_ira |
                  1  |  -.0278724   .0370347    -0.75   0.452    -.1005106    .0447659
                     |
  year_3#c.share_ira |
                  1  |   -.001412   .0361285    -0.04   0.969    -.0722729    .0694488
                     |
  year_4#c.share_ira |
                  1  |   -.009367   .0358829    -0.26   0.794    -.0797462    .0610122
                     |
  year_5#c.share_ira |
                  1  |  -.0006242   .0331355    -0.02   0.985    -.0656147    .0643664
                     |
  year_6#c.share_ira |
                  1  |   .0128778   .0338149     0.38   0.703    -.0534453    .0792009
                     |
  year_7#c.share_ira |
                  1  |  -.0118705   .0344859    -0.34   0.731    -.0795097    .0557687
                     |
  year_8#c.share_ira |
                  1  |  -.0420183   .0340159    -1.24   0.217    -.1087357    .0246991
                     |
  year_9#c.share_ira |
                  1  |   .0111253   .0348116     0.32   0.749    -.0571527    .0794033
                     |
 year_10#c.share_ira |
                  1  |  -.0678199    .038457    -1.76   0.078    -.1432478     .007608
                     |
 year_11#c.share_ira |
                  1  |          0  (omitted)
                     |
           share_bus |   .0528827   .0610682     0.87   0.387    -.0668939    .1726593
                     |
  year_1#c.share_bus |
                  1  |   -.200085   .0762132    -2.63   0.009    -.3495662   -.0506037
                     |
  year_2#c.share_bus |
                  1  |  -.0030936   .0757283    -0.04   0.967    -.1516238    .1454366
                     |
  year_3#c.share_bus |
                  1  |   .0095496   .0733811     0.13   0.896     -.134377    .1534761
                     |
  year_4#c.share_bus |
                  1  |   .0866125   .0719267     1.20   0.229    -.0544615    .2276865
                     |
  year_5#c.share_bus |
                  1  |   .1510747   .0690751     2.19   0.029     .0155939    .2865556
                     |
  year_6#c.share_bus |
                  1  |   .0252169   .0643991     0.39   0.695    -.1010928    .1515265
                     |
  year_7#c.share_bus |
                  1  |   .0426414   .0651978     0.65   0.513    -.0852347    .1705175
                     |
  year_8#c.share_bus |
                  1  |  -.0814167   .0686328    -1.19   0.236    -.2160302    .0531968
                     |
  year_9#c.share_bus |
                  1  |   -.005024   .0825875    -0.06   0.951    -.1670076    .1569595
                     |
 year_10#c.share_bus |
                  1  |  -.0071929   .0789251    -0.09   0.927    -.1619933    .1476075
                     |
 year_11#c.share_bus |
                  1  |          0  (omitted)
                     |
     liability_share |   .0125956   .0273819     0.46   0.646    -.0411102    .0663013
               _cons |   .1589737   .0758608     2.10   0.036     .0101835    .3077639
--------------------------------------------------------------------------------------

. 
. di as txt ""


. 
. * ---------------------------------------------------------------------
. * Regression 2.3: r_annual_excl (excluding residential)
. * ---------------------------------------------------------------------
. di as txt "===================================================================="
====================================================================

. di as txt "Regression 2.3: r_annual_excl (excluding residential)"
Regression 2.3: r_annual_excl (excluding residential)

. di as txt "===================================================================="
====================================================================

. 
. * Load fresh data and restrict to balanced panel for r_annual_excl
. use "_randhrs1992_2022v1_panel.dta", clear

. 
. * Count non-missing r_annual_excl per individual
. bysort hhidpn: egen n_nonmiss = count(r_annual_excl) if !missing(r_annual_excl)
(101,997 missing values generated)

. bysort hhidpn: egen total_obs = count(r_annual_excl)

. bysort hhidpn: egen max_nonmiss = max(n_nonmiss)
(48,719 missing values generated)

. 
. * Keep only individuals with non-missing r_annual_excl in ALL years (11 years total)
. keep if max_nonmiss == 11 & total_obs == 11
(145,860 observations deleted)

. drop n_nonmiss total_obs max_nonmiss

. 
. * Verify balanced panel
. bysort hhidpn: gen n_obs = _N

. summarize n_obs

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       n_obs |     28,556          11           0         11         11

. di as txt "Sample restricted to individuals with r_annual_excl in all 11 years: " _N 
> " observations"
Sample restricted to individuals with r_annual_excl in all 11 years: 28556 observations

. di as txt "Min obs per individual: " r(min) ", Max obs per individual: " r(max)
Min obs per individual: 11, Max obs per individual: 11

. drop n_obs

. 
. * Set panel structure
. xtset hhidpn year

Panel variable: hhidpn (strongly balanced)
 Time variable: year, 2002 to 2022, but with gaps
         Delta: 1 unit

. gen age_sq = age^2

. 
. eststo reg2_3: reg r_annual_excl age age_sq raedyrs i.inlbrf i.married i.born_us ///
>     i.wealth_nonres_d2 i.wealth_nonres_d3 i.wealth_nonres_d4 i.wealth_nonres_d5 i.wea
> lth_nonres_d6 ///
>     i.wealth_nonres_d7 i.wealth_nonres_d8 i.wealth_nonres_d9 i.wealth_nonres_d10 ///
>     c.share_stk##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year
> _10 year_11) ///
>     c.share_bond##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 yea
> r_10 year_11) ///
>     c.share_re##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year_
> 10 year_11) ///
>     c.share_ira##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year
> _10 year_11) ///
>     c.share_bus##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year
> _10 year_11) ///
>     liability_share, vce(cluster hhidpn)
note: 1.year_11 omitted because of collinearity.
note: 1.year_11#c.share_stk omitted because of collinearity.
note: 1.year_11#c.share_bond omitted because of collinearity.
note: 1.year_11#c.share_re omitted because of collinearity.
note: 1.year_11#c.share_ira omitted because of collinearity.
note: 1.year_11#c.share_bus omitted because of collinearity.

Linear regression                               Number of obs     =     28,471
                                                F(81, 2594)       =      13.71
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0462
                                                Root MSE          =     .28268

                                     (Std. err. adjusted for 2,595 clusters in hhidpn)
--------------------------------------------------------------------------------------
                     |               Robust
       r_annual_excl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 age |  -.0042234   .0023417    -1.80   0.071    -.0088152    .0003685
              age_sq |    .000026   .0000169     1.54   0.123    -7.07e-06    .0000591
             raedyrs |    .010058   .0007483    13.44   0.000     .0085906    .0115253
                     |
              inlbrf |
              1.yes  |   .0224767   .0039227     5.73   0.000     .0147848    .0301687
                     |
             married |
                yes  |   .0051205   .0043237     1.18   0.236    -.0033577    .0135988
                     |
             born_us |
                yes  |   .0014179   .0062129     0.23   0.819    -.0107647    .0136006
  1.wealth_nonres_d2 |  -.0488864   .0194336    -2.52   0.012    -.0869932   -.0107795
  1.wealth_nonres_d3 |  -.0377166   .0192657    -1.96   0.050    -.0754944    .0000612
  1.wealth_nonres_d4 |  -.0557141   .0183889    -3.03   0.002    -.0917725   -.0196558
  1.wealth_nonres_d5 |  -.0577309   .0187119    -3.09   0.002    -.0944227   -.0210391
  1.wealth_nonres_d6 |  -.0985589   .0180235    -5.47   0.000    -.1339008   -.0632171
  1.wealth_nonres_d7 |  -.1176815   .0184456    -6.38   0.000    -.1538511   -.0815119
  1.wealth_nonres_d8 |  -.1376468   .0189323    -7.27   0.000    -.1747707   -.1005229
  1.wealth_nonres_d9 |   -.153906   .0195464    -7.87   0.000    -.1922341   -.1155778
 1.wealth_nonres_d10 |  -.1851918   .0200984    -9.21   0.000    -.2246024   -.1457813
           share_stk |    -.01227   .0401793    -0.31   0.760    -.0910567    .0665166
            1.year_1 |   .0134332   .0155442     0.86   0.388    -.0170471    .0439135
            1.year_2 |  -.0259408   .0141196    -1.84   0.066    -.0536277    .0017461
            1.year_3 |   .0205813   .0157672     1.31   0.192    -.0103363     .051499
            1.year_4 |  -.0237922   .0138954    -1.71   0.087    -.0510394    .0034549
            1.year_5 |  -.0505291   .0124394    -4.06   0.000    -.0749213   -.0261368
            1.year_6 |  -.0232277   .0122747    -1.89   0.059    -.0472969    .0008415
            1.year_7 |  -.0080089   .0139932    -0.57   0.567    -.0354479    .0194302
            1.year_8 |  -.0440848    .012654    -3.48   0.001    -.0688977   -.0192719
            1.year_9 |  -.0320868   .0126745    -2.53   0.011      -.05694   -.0072336
           1.year_10 |  -.0058328   .0141931    -0.41   0.681    -.0336638    .0219983
           1.year_11 |          0  (omitted)
                     |
  year_1#c.share_stk |
                  1  |  -.1820163   .0509216    -3.57   0.000    -.2818674   -.0821651
                     |
  year_2#c.share_stk |
                  1  |    .000758   .0532746     0.01   0.989    -.1037071     .105223
                     |
  year_3#c.share_stk |
                  1  |  -.0525857   .0574041    -0.92   0.360    -.1651483    .0599769
                     |
  year_4#c.share_stk |
                  1  |  -.0559819   .0504068    -1.11   0.267    -.1548236    .0428597
                     |
  year_5#c.share_stk |
                  1  |   .0122097   .0497293     0.25   0.806    -.0853033    .1097228
                     |
  year_6#c.share_stk |
                  1  |   .0451321   .0465556     0.97   0.332    -.0461577     .136422
                     |
  year_7#c.share_stk |
                  1  |   .0353534   .0443485     0.80   0.425    -.0516088    .1223155
                     |
  year_8#c.share_stk |
                  1  |   .0128473   .0477731     0.27   0.788    -.0808299    .1065244
                     |
  year_9#c.share_stk |
                  1  |   .0368268   .0505825     0.73   0.467    -.0623593    .1360129
                     |
 year_10#c.share_stk |
                  1  |   .0291005   .0579044     0.50   0.615     -.084443    .1426439
                     |
 year_11#c.share_stk |
                  1  |          0  (omitted)
                     |
          share_bond |   -.124612   .0983036    -1.27   0.205    -.3173735    .0681494
                     |
 year_1#c.share_bond |
                  1  |    .394618   .1345151     2.93   0.003     .1308503    .6583858
                     |
 year_2#c.share_bond |
                  1  |   .2684556   .1471661     1.82   0.068    -.0201192    .5570305
                     |
 year_3#c.share_bond |
                  1  |   .0192998     .15111     0.13   0.898    -.2770085    .3156082
                     |
 year_4#c.share_bond |
                  1  |   .6896416   .2707921     2.55   0.011     .1586511    1.220632
                     |
 year_5#c.share_bond |
                  1  |   .4159336   .1816477     2.29   0.022     .0597444    .7721227
                     |
 year_6#c.share_bond |
                  1  |   .2725131   .1174589     2.32   0.020     .0421905    .5028357
                     |
 year_7#c.share_bond |
                  1  |   .2269178   .1619331     1.40   0.161    -.0906134    .5444491
                     |
 year_8#c.share_bond |
                  1  |   .3066093   .1376634     2.23   0.026     .0366681    .5765506
                     |
 year_9#c.share_bond |
                  1  |   .2376232   .1501695     1.58   0.114    -.0568409    .5320873
                     |
year_10#c.share_bond |
                  1  |  -.0479135   .1408557    -0.34   0.734    -.3241144    .2282875
                     |
year_11#c.share_bond |
                  1  |          0  (omitted)
                     |
            share_re |  -.1526344   .0620458    -2.46   0.014    -.2742988   -.0309701
                     |
   year_1#c.share_re |
                  1  |   .1982677   .1059159     1.87   0.061    -.0094204    .4059559
                     |
   year_2#c.share_re |
                  1  |   .2135137   .0720042     2.97   0.003     .0723221    .3547053
                     |
   year_3#c.share_re |
                  1  |   .2197007   .0725984     3.03   0.003     .0773441    .3620574
                     |
   year_4#c.share_re |
                  1  |   .0603047   .0692744     0.87   0.384    -.0755339    .1961433
                     |
   year_5#c.share_re |
                  1  |    .032186   .0701677     0.46   0.646    -.1054044    .1697764
                     |
   year_6#c.share_re |
                  1  |    .051422   .0726947     0.71   0.479    -.0911236    .1939676
                     |
   year_7#c.share_re |
                  1  |   .1049398   .0719481     1.46   0.145    -.0361416    .2460212
                     |
   year_8#c.share_re |
                  1  |   .2422848   .0726801     3.33   0.001     .0997679    .3848018
                     |
   year_9#c.share_re |
                  1  |   .1830046   .0861396     2.12   0.034     .0140954    .3519138
                     |
  year_10#c.share_re |
                  1  |   .0792939   .0801038     0.99   0.322    -.0777799    .2363677
                     |
  year_11#c.share_re |
                  1  |          0  (omitted)
                     |
           share_ira |   .0220296   .0467239     0.47   0.637    -.0695903    .1136495
                     |
  year_1#c.share_ira |
                  1  |  -.1976982   .0511208    -3.87   0.000    -.2979399   -.0974566
                     |
  year_2#c.share_ira |
                  1  |  -.0554375   .0508864    -1.09   0.276    -.1552195    .0443445
                     |
  year_3#c.share_ira |
                  1  |  -.1061893   .0516573    -2.06   0.040     -.207483   -.0048956
                     |
  year_4#c.share_ira |
                  1  |  -.0716336   .0595763    -1.20   0.229    -.1884555    .0451882
                     |
  year_5#c.share_ira |
                  1  |  -.0923751    .047788    -1.93   0.053    -.1860816    .0013314
                     |
  year_6#c.share_ira |
                  1  |   -.072036   .0427403    -1.69   0.092    -.1558446    .0117727
                     |
  year_7#c.share_ira |
                  1  |   .0002367   .0421678     0.01   0.996    -.0824492    .0829226
                     |
  year_8#c.share_ira |
                  1  |  -.0123769   .0499499    -0.25   0.804    -.1103226    .0855688
                     |
  year_9#c.share_ira |
                  1  |   .0285873    .047011     0.61   0.543    -.0635955    .1207702
                     |
 year_10#c.share_ira |
                  1  |  -.1242445   .0503745    -2.47   0.014    -.2230227   -.0254663
                     |
 year_11#c.share_ira |
                  1  |          0  (omitted)
                     |
           share_bus |   .1099442   .0656025     1.68   0.094    -.0186944    .2385829
                     |
  year_1#c.share_bus |
                  1  |  -.2467735   .0819879    -3.01   0.003    -.4075419   -.0860051
                     |
  year_2#c.share_bus |
                  1  |  -.0510197   .0784277    -0.65   0.515    -.2048068    .1027675
                     |
  year_3#c.share_bus |
                  1  |  -.0283041   .0801073    -0.35   0.724    -.1853849    .1287767
                     |
  year_4#c.share_bus |
                  1  |  -.0897078   .0734063    -1.22   0.222    -.2336487    .0542331
                     |
  year_5#c.share_bus |
                  1  |  -.0231159    .079686    -0.29   0.772    -.1793705    .1331387
                     |
  year_6#c.share_bus |
                  1  |  -.1485969   .0732397    -2.03   0.043    -.2922111   -.0049827
                     |
  year_7#c.share_bus |
                  1  |  -.1109971   .0753049    -1.47   0.141    -.2586608    .0366667
                     |
  year_8#c.share_bus |
                  1  |  -.0756848   .0764044    -0.99   0.322    -.2255046     .074135
                     |
  year_9#c.share_bus |
                  1  |  -.0756066   .0906259    -0.83   0.404    -.2533129    .1020997
                     |
 year_10#c.share_bus |
                  1  |  -.2038728   .0847352    -2.41   0.016    -.3700281   -.0377174
                     |
 year_11#c.share_bus |
                  1  |          0  (omitted)
                     |
     liability_share |   .0150646   .0311656     0.48   0.629    -.0460474    .0761767
               _cons |   .1998978   .0841398     2.38   0.018     .0349099    .3648857
--------------------------------------------------------------------------------------

. 
. di as txt ""


. 
. * ---------------------------------------------------------------------
. * Regression 2.4: r_annual_excl_trim (excluding residential, trimmed)
. * ---------------------------------------------------------------------
. di as txt "===================================================================="
====================================================================

. di as txt "Regression 2.4: r_annual_excl_trim (excluding residential, trimmed)"
Regression 2.4: r_annual_excl_trim (excluding residential, trimmed)

. di as txt "===================================================================="
====================================================================

. 
. * Load fresh data and restrict to balanced panel for r_annual_excl_trim
. use "_randhrs1992_2022v1_panel.dta", clear

. 
. * Count non-missing r_annual_excl_trim per individual
. bysort hhidpn: egen n_nonmiss = count(r_annual_excl_trim) if !missing(r_annual_excl_t
> rim)
(109,245 missing values generated)

. bysort hhidpn: egen total_obs = count(r_annual_excl_trim)

. bysort hhidpn: egen max_nonmiss = max(n_nonmiss)
(53,416 missing values generated)

. 
. * Keep only individuals with non-missing r_annual_excl_trim in ALL years (11 years to
> tal)
. keep if max_nonmiss == 11 & total_obs == 11
(157,828 observations deleted)

. drop n_nonmiss total_obs max_nonmiss

. 
. * Verify balanced panel
. bysort hhidpn: gen n_obs = _N

. summarize n_obs

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       n_obs |     16,588          11           0         11         11

. di as txt "Sample restricted to individuals with r_annual_excl_trim in all 11 years: 
> " _N " observations"
Sample restricted to individuals with r_annual_excl_trim in all 11 years: 16588 observa
> tions

. di as txt "Min obs per individual: " r(min) ", Max obs per individual: " r(max)
Min obs per individual: 11, Max obs per individual: 11

. drop n_obs

. 
. * Set panel structure
. xtset hhidpn year

Panel variable: hhidpn (strongly balanced)
 Time variable: year, 2002 to 2022, but with gaps
         Delta: 1 unit

. gen age_sq = age^2

. 
. eststo reg2_4: reg r_annual_excl_trim age age_sq raedyrs i.inlbrf i.married i.born_us
>  ///
>     i.wealth_nonres_d2 i.wealth_nonres_d3 i.wealth_nonres_d4 i.wealth_nonres_d5 i.wea
> lth_nonres_d6 ///
>     i.wealth_nonres_d7 i.wealth_nonres_d8 i.wealth_nonres_d9 i.wealth_nonres_d10 ///
>     c.share_stk##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year
> _10 year_11) ///
>     c.share_bond##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 yea
> r_10 year_11) ///
>     c.share_re##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year_
> 10 year_11) ///
>     c.share_ira##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year
> _10 year_11) ///
>     c.share_bus##(year_1 year_2 year_3 year_4 year_5 year_6 year_7 year_8 year_9 year
> _10 year_11) ///
>     liability_share, vce(cluster hhidpn)
note: 1.year_11 omitted because of collinearity.
note: 1.year_11#c.share_stk omitted because of collinearity.
note: 1.year_11#c.share_bond omitted because of collinearity.
note: 1.year_11#c.share_re omitted because of collinearity.
note: 1.year_11#c.share_ira omitted because of collinearity.
note: 1.year_11#c.share_bus omitted because of collinearity.

Linear regression                               Number of obs     =     16,547
                                                F(81, 1506)       =      11.19
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0489
                                                Root MSE          =     .14154

                                     (Std. err. adjusted for 1,507 clusters in hhidpn)
--------------------------------------------------------------------------------------
                     |               Robust
  r_annual_excl_trim | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 age |  -.0019359   .0016107    -1.20   0.230    -.0050954    .0012236
              age_sq |   8.82e-06   .0000114     0.77   0.439    -.0000135    .0000312
             raedyrs |   .0058393   .0004136    14.12   0.000      .005028    .0066506
                     |
              inlbrf |
              1.yes  |   .0147912    .002498     5.92   0.000     .0098914     .019691
                     |
             married |
                yes  |   .0150564   .0025719     5.85   0.000     .0100115    .0201013
                     |
             born_us |
                yes  |  -.0035647   .0032058    -1.11   0.266    -.0098531    .0027236
  1.wealth_nonres_d2 |  -.0082757   .0073451    -1.13   0.260    -.0226834     .006132
  1.wealth_nonres_d3 |  -.0226361   .0070901    -3.19   0.001    -.0365436   -.0087285
  1.wealth_nonres_d4 |  -.0233406    .007512    -3.11   0.002    -.0380758   -.0086055
  1.wealth_nonres_d5 |  -.0378883   .0078292    -4.84   0.000    -.0532456   -.0225309
  1.wealth_nonres_d6 |  -.0467784   .0075553    -6.19   0.000    -.0615984   -.0319585
  1.wealth_nonres_d7 |  -.0499805   .0081369    -6.14   0.000    -.0659413   -.0340197
  1.wealth_nonres_d8 |   -.054138   .0082795    -6.54   0.000    -.0703785   -.0378975
  1.wealth_nonres_d9 |  -.0570281   .0085597    -6.66   0.000    -.0738183    -.040238
 1.wealth_nonres_d10 |  -.0737799   .0091644    -8.05   0.000    -.0917562   -.0558036
           share_stk |   .0365263   .0309054     1.18   0.237    -.0240958    .0971484
            1.year_1 |  -.0072784   .0090764    -0.80   0.423     -.025082    .0105252
            1.year_2 |  -.0031053    .008171    -0.38   0.704     -.019133    .0129224
            1.year_3 |  -.0023824   .0081873    -0.29   0.771    -.0184422    .0136774
            1.year_4 |  -.0242756   .0073172    -3.32   0.001    -.0386285   -.0099226
            1.year_5 |  -.0303432   .0067323    -4.51   0.000    -.0435489   -.0171375
            1.year_6 |  -.0295909   .0067966    -4.35   0.000    -.0429227   -.0162591
            1.year_7 |  -.0082156   .0068823    -1.19   0.233    -.0217155    .0052842
            1.year_8 |  -.0148295    .006775    -2.19   0.029     -.028119     -.00154
            1.year_9 |  -.0102345   .0068332    -1.50   0.134     -.023638    .0031691
           1.year_10 |  -.0136889   .0074383    -1.84   0.066    -.0282795    .0009017
           1.year_11 |          0  (omitted)
                     |
  year_1#c.share_stk |
                  1  |  -.1417055   .0410599    -3.45   0.001    -.2222461   -.0611649
                     |
  year_2#c.share_stk |
                  1  |  -.0687884   .0434823    -1.58   0.114    -.1540807     .016504
                     |
  year_3#c.share_stk |
                  1  |  -.0339619   .0423651    -0.80   0.423    -.1170627     .049139
                     |
  year_4#c.share_stk |
                  1  |  -.0784317   .0387394    -2.02   0.043    -.1544206   -.0024427
                     |
  year_5#c.share_stk |
                  1  |  -.0522386   .0387364    -1.35   0.178    -.1282217    .0237444
                     |
  year_6#c.share_stk |
                  1  |  -.0197933   .0362736    -0.55   0.585    -.0909455    .0513588
                     |
  year_7#c.share_stk |
                  1  |   .0259389   .0380388     0.68   0.495    -.0486757    .1005535
                     |
  year_8#c.share_stk |
                  1  |   .0063188   .0372362     0.17   0.865    -.0667216    .0793592
                     |
  year_9#c.share_stk |
                  1  |  -.0291936   .0403656    -0.72   0.470    -.1083723    .0499852
                     |
 year_10#c.share_stk |
                  1  |  -.0459843   .0400335    -1.15   0.251    -.1245116    .0325431
                     |
 year_11#c.share_stk |
                  1  |          0  (omitted)
                     |
          share_bond |  -.1407188   .0727684    -1.93   0.053     -.283457    .0020195
                     |
 year_1#c.share_bond |
                  1  |     .49996   .1463929     3.42   0.001     .2128043    .7871157
                     |
 year_2#c.share_bond |
                  1  |   .1170257    .144547     0.81   0.418    -.1665092    .4005606
                     |
 year_3#c.share_bond |
                  1  |   .0902797    .151453     0.60   0.551    -.2068015     .387361
                     |
 year_4#c.share_bond |
                  1  |    .601102   .2045271     2.94   0.003     .1999138     1.00229
                     |
 year_5#c.share_bond |
                  1  |   .3636407   .1204944     3.02   0.003      .127286    .5999953
                     |
 year_6#c.share_bond |
                  1  |   .3023237   .1088474     2.78   0.006     .0888151    .5158323
                     |
 year_7#c.share_bond |
                  1  |   .1335557    .108682     1.23   0.219    -.0796285    .3467399
                     |
 year_8#c.share_bond |
                  1  |   .1770928   .1183453     1.50   0.135    -.0550463    .4092318
                     |
 year_9#c.share_bond |
                  1  |   .1619309   .1150242     1.41   0.159    -.0636938    .3875556
                     |
year_10#c.share_bond |
                  1  |   .1643605    .142814     1.15   0.250     -.115775     .444496
                     |
year_11#c.share_bond |
                  1  |          0  (omitted)
                     |
            share_re |  -.0587043   .0514734    -1.14   0.254    -.1596714    .0422628
                     |
   year_1#c.share_re |
                  1  |  -.0141824   .0637494    -0.22   0.824    -.1392294    .1108646
                     |
   year_2#c.share_re |
                  1  |   .0231022   .0604892     0.38   0.703    -.0955498    .1417542
                     |
   year_3#c.share_re |
                  1  |   .0698658   .0636095     1.10   0.272    -.0549068    .1946385
                     |
   year_4#c.share_re |
                  1  |    .081255   .0601164     1.35   0.177    -.0366657    .1991757
                     |
   year_5#c.share_re |
                  1  |  -.0349265   .0605009    -0.58   0.564    -.1536015    .0837486
                     |
   year_6#c.share_re |
                  1  |   .0439829   .0644402     0.68   0.495    -.0824191    .1703848
                     |
   year_7#c.share_re |
                  1  |    .048789   .0660909     0.74   0.461    -.0808509     .178429
                     |
   year_8#c.share_re |
                  1  |   .0503935   .0582522     0.87   0.387    -.0638706    .1646576
                     |
   year_9#c.share_re |
                  1  |    .013149   .0668405     0.20   0.844    -.1179613    .1442593
                     |
  year_10#c.share_re |
                  1  |    .086449   .0777497     1.11   0.266    -.0660603    .2389583
                     |
  year_11#c.share_re |
                  1  |          0  (omitted)
                     |
           share_ira |   .0115604   .0227967     0.51   0.612    -.0331562     .056277
                     |
  year_1#c.share_ira |
                  1  |  -.1354199   .0293463    -4.61   0.000     -.192984   -.0778559
                     |
  year_2#c.share_ira |
                  1  |  -.0604921   .0299899    -2.02   0.044    -.1193184   -.0016658
                     |
  year_3#c.share_ira |
                  1  |  -.0126318   .0292569    -0.43   0.666    -.0700204    .0447568
                     |
  year_4#c.share_ira |
                  1  |  -.0477854   .0299587    -1.60   0.111    -.1065506    .0109798
                     |
  year_5#c.share_ira |
                  1  |  -.1077472   .0252974    -4.26   0.000     -.157369   -.0581254
                     |
  year_6#c.share_ira |
                  1  |   -.034041   .0275878    -1.23   0.217    -.0881556    .0200736
                     |
  year_7#c.share_ira |
                  1  |  -.0597915   .0266007    -2.25   0.025    -.1119698   -.0076132
                     |
  year_8#c.share_ira |
                  1  |  -.0841843   .0262009    -3.21   0.001    -.1355784   -.0327902
                     |
  year_9#c.share_ira |
                  1  |  -.0469447   .0283312    -1.66   0.098    -.1025175    .0086281
                     |
 year_10#c.share_ira |
                  1  |  -.0765439   .0292801    -2.61   0.009    -.1339781   -.0191098
                     |
 year_11#c.share_ira |
                  1  |          0  (omitted)
                     |
           share_bus |   .0255395   .0436818     0.58   0.559     -.060144    .1112231
                     |
  year_1#c.share_bus |
                  1  |  -.0931781   .0618371    -1.51   0.132    -.2144741    .0281179
                     |
  year_2#c.share_bus |
                  1  |   .0429158   .0626239     0.69   0.493    -.0799235     .165755
                     |
  year_3#c.share_bus |
                  1  |   .0574649   .0566014     1.02   0.310     -.053561    .1684908
                     |
  year_4#c.share_bus |
                  1  |   .0434496   .0587956     0.74   0.460    -.0718803    .1587795
                     |
  year_5#c.share_bus |
                  1  |   .0668935   .0557599     1.20   0.230    -.0424818    .1762688
                     |
  year_6#c.share_bus |
                  1  |  -.0575691    .053944    -1.07   0.286    -.1633825    .0482442
                     |
  year_7#c.share_bus |
                  1  |   .0468911   .0481737     0.97   0.331    -.0476035    .1413858
                     |
  year_8#c.share_bus |
                  1  |  -.0489294   .0546067    -0.90   0.370    -.1560426    .0581838
                     |
  year_9#c.share_bus |
                  1  |  -.0527012   .0611451    -0.86   0.389    -.1726398    .0672374
                     |
 year_10#c.share_bus |
                  1  |   .0249598   .0598171     0.42   0.677    -.0923738    .1422935
                     |
 year_11#c.share_bus |
                  1  |          0  (omitted)
                     |
     liability_share |  -.0192542   .0299357    -0.64   0.520    -.0779743     .039466
               _cons |   .0894159   .0573837     1.56   0.119    -.0231446    .2019764
--------------------------------------------------------------------------------------

. 
. di as txt ""


. 
. * ---------------------------------------------------------------------
. * Export results
. * ---------------------------------------------------------------------
. di as txt "===================================================================="
====================================================================

. di as txt "=== Exporting Results                                            ==="
=== Exporting Results                                            ===

. di as txt "===================================================================="
====================================================================

. 
. * Export to LaTeX table
. esttab reg2_1 reg2_2 reg2_3 reg2_4 using "/Volumes/SSD PRO/Github-forks/Chp2-Beliefsa
> ndTrust/Paper/Tables/shares_interacted.tex", ///
>     replace booktabs ///
>     se star(* 0.10 ** 0.05 *** 0.01) ///
>     label compress ///
>     drop(_cons) ///
>     stats(N r2 r2_a, labels("Observations" "R-squared" "Adjusted R-squared")) ///
>     title("Asset Shares Ã— Year Interactions") ///
>     addnote("Clustered standard errors at individual level in parentheses" ///
>             "*** p<0.01, ** p<0.05, * p<0.10" ///
>             "Interaction terms between asset shares and year dummies included but not
>  shown" ///
>             "Joint F-tests for coefficient equality across years reported in log file
> ")
(file /Volumes/SSD
    PRO/Github-forks/Chp2-BeliefsandTrust/Paper/Tables/shares_interacted.tex not
    found)
(output written to /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Paper/Tables/shar
> es_interacted.tex)

. 
. * Display summary results in log
. di as txt ""


. di as txt "===================================================================="
====================================================================

. di as txt "=== Summary: Joint F-test Results (from Regression 2.1)         ==="
=== Summary: Joint F-test Results (from Regression 2.1)         ===

. di as txt "===================================================================="
====================================================================

. di as txt ""


. di as txt "Asset Share      F-statistic    p-value"
Asset Share      F-statistic    p-value

. di as txt "----------------------------------------------"
----------------------------------------------

. di as txt "Stock            " %6.2f `fstat_stk' "        " %6.4f `p_stk'
Stock              0.56        0.4548

. di as txt "Bond             " %6.2f `fstat_bond' "        " %6.4f `p_bond'
Bond               0.69        0.4058

. di as txt "Real Estate      " %6.2f `fstat_re' "        " %6.4f `p_re'
Real Estate        3.60        0.0580

. di as txt "IRA              " %6.2f `fstat_ira' "        " %6.4f `p_ira'
IRA                1.43        0.2316

. di as txt "Business         " %6.2f `fstat_bus' "        " %6.4f `p_bus'
Business           0.41        0.5207

. di as txt ""


. 
. di as txt ""


. 
. di as txt "===================================================================="
====================================================================

. di as txt "=== Asset Shares Ã— Year Interactions Complete                   ==="
=== Asset Shares Ã— Year Interactions Complete                   ===

. di as txt "===================================================================="
====================================================================

. 
. log off
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/rand
> hrs1992_2022v1_STATA/reg_shares_interacted.log
  log type:  text
 paused on:  20 Oct 2025, 10:16:33
---------------------------------------------------------------------------------------
