------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/randhrs
> 1992_2022v1_STATA/reg_ret_trust_2020.log
  log type:  text
 opened on:   3 Oct 2025, 10:44:31

. 
. set more off

. 
. * Master dataset with all computed variables
. local master "/Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/rand
> hrs1992_2022v1_STATA/_randhrs1992_2022v1_analysis.dta"

. capture confirm file "`master'"

. if _rc {
.     di as error "ERROR: master file not found -> `master'"
.     exit 198
. }

. use "`master'", clear

. di as txt "Using master file: `master'"
Using master file: /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/r
> andhrs1992_2022v1_STATA/_randhrs1992_2022v1_analysis.dta

. 
. * Trust variables (2020)
. local trust_vars "rv557 rv558 rv559 rv560 rv561 rv562 rv563 rv564"

. 
. * Return variables: annual and trimmed (with and without residential)
. local ret_vars "r_annual_2022 r_annual_2022_trim r_annual_2022_excl_res r_annual_2022_ex
> cl_res_trim"

. 
. * Quick overlap diagnostics for sample sizes
. quietly count

. local N_all = r(N)

. di as txt "=== Quick overlap check: r_annual_2022 and rv557 ==="
=== Quick overlap check: r_annual_2022 and rv557 ===

. quietly count if !missing(r_annual_2022)

. di as txt "  Non-missing r_annual_2022: " r(N) " of " `N_all'
  Non-missing r_annual_2022: 9456 of 15856

. quietly count if !missing(rv557)

. di as txt "  Non-missing rv557:          " r(N) " of " `N_all'
  Non-missing rv557:          1059 of 15856

. quietly count if !missing(r_annual_2022) & !missing(rv557)

. di as txt "  Non-missing both:           " r(N) " of " `N_all'
  Non-missing both:           814 of 15856

. di as txt ""


. 
. * Controls
. local ctrl_core "r15agey_b raedyrs r15inlbrf married_2020 born_us"

. local ctrl_deciles ""

. forvalues d = 2/10 {
  2.     capture confirm variable wealth_d`d'
  3.     if !_rc local ctrl_deciles "`ctrl_deciles' wealth_d`d'"
  4. }

. local ctrl_vars "`ctrl_core' `ctrl_deciles'"

. 
. * Report which controls are available
. di as txt "Controls to include (if present):"
Controls to include (if present):

. di as txt "  `ctrl_vars'"
  r15agey_b raedyrs r15inlbrf married_2020 born_us  wealth_d2 wealth_d3 wealth_d4 wealth_d
> 5 wealth_d6 wealth_d7 wealth_d8 wealth_d9 wealth_d10

. 
. * No helper program; rely on Stata's regression output
. 
. * Loop over trust variables and returns
. di as txt "=== BEGIN REGRESSIONS: RETURNS on TRUST (no controls) ==="
=== BEGIN REGRESSIONS: RETURNS on TRUST (no controls) ===

. foreach t of local trust_vars {
  2.     capture confirm variable `t'
  3.     if _rc {
  4.         di as warn "Skipping trust var (not found): `t'"
  5.         continue
  6.     }
  7.     foreach y of local ret_vars {
  8.         capture confirm variable `y'
  9.         if _rc continue
 10.         quietly count if !missing(`y') & !missing(`t')
 11.         if r(N)==0 continue
 12.         di as txt "[RAW] `y' on `t' + `t'^2 (robust)"
 13.         regress `y' c.`t' c.`t'#c.`t' if !missing(`y') & !missing(`t'), vce(robust)
 14.     }
 15. }
[RAW] r_annual_2022 on rv557 + rv557^2 (robust)

Linear regression                               Number of obs     =        814
                                                F(2, 811)         =       3.75
                                                Prob > F          =     0.0240
                                                R-squared         =     0.0098
                                                Root MSE          =     .53165

---------------------------------------------------------------------------------
                |               Robust
  r_annual_2022 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
          rv557 |   .0710496   .0279029     2.55   0.011     .0162792    .1258199
                |
c.rv557#c.rv557 |   -.007091   .0025987    -2.73   0.006     -.012192     -.00199
                |
          _cons |   .0805049   .0757381     1.06   0.288    -.0681609    .2291707
---------------------------------------------------------------------------------
[RAW] r_annual_2022_trim on rv557 + rv557^2 (robust)

Linear regression                               Number of obs     =        737
                                                F(2, 734)         =       1.21
                                                Prob > F          =     0.3002
                                                R-squared         =     0.0032
                                                Root MSE          =     .27226

---------------------------------------------------------------------------------
                |               Robust
r_annual_2022~d | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
          rv557 |   .0125336   .0188351     0.67   0.506    -.0244434    .0495106
                |
c.rv557#c.rv557 |  -.0015758   .0015586    -1.01   0.312    -.0046357    .0014841
                |
          _cons |   .1440312   .0573064     2.51   0.012     .0315273    .2565352
---------------------------------------------------------------------------------
[RAW] r_annual_2022_excl_res on rv557 + rv557^2 (robust)

Linear regression                               Number of obs     =        824
                                                F(2, 821)         =       5.70
                                                Prob > F          =     0.0035
                                                R-squared         =     0.0094
                                                Root MSE          =     .40531

---------------------------------------------------------------------------------
                |               Robust
r_annual_2022~s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
          rv557 |   .0567576   .0168993     3.36   0.001     .0235867    .0899285
                |
c.rv557#c.rv557 |  -.0053959   .0017315    -3.12   0.002    -.0087946   -.0019972
                |
          _cons |   .0002618   .0402594     0.01   0.995    -.0787617    .0792853
---------------------------------------------------------------------------------
[RAW] r_annual_2022_excl_res_trim on rv557 + rv557^2 (robust)

Linear regression                               Number of obs     =        750
                                                F(2, 747)         =       6.09
                                                Prob > F          =     0.0024
                                                R-squared         =     0.0095
                                                Root MSE          =     .17839

---------------------------------------------------------------------------------
                |               Robust
r_annual_2022~m | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
          rv557 |   .0223906   .0083819     2.67   0.008     .0059357    .0388454
                |
c.rv557#c.rv557 |  -.0014714    .000804    -1.83   0.068    -.0030498     .000107
                |
          _cons |  -.0136841   .0225465    -0.61   0.544    -.0579461    .0305779
---------------------------------------------------------------------------------
[RAW] r_annual_2022 on rv558 + rv558^2 (robust)

Linear regression                               Number of obs     =        805
                                                F(2, 802)         =       1.16
                                                Prob > F          =     0.3125
                                                R-squared         =     0.0032
                                                Root MSE          =     .53541

---------------------------------------------------------------------------------
                |               Robust
  r_annual_2022 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
          rv558 |   .0364863   .0288221     1.27   0.206    -.0200894    .0930619
                |
c.rv558#c.rv558 |  -.0035594   .0024531    -1.45   0.147    -.0083746    .0012558
                |
          _cons |   .1418884   .0825994     1.72   0.086     -.020248    .3040249
---------------------------------------------------------------------------------
[RAW] r_annual_2022_trim on rv558 + rv558^2 (robust)

Linear regression                               Number of obs     =        728
                                                F(2, 725)         =       0.73
                                                Prob > F          =     0.4826
                                                R-squared         =     0.0020
                                                Root MSE          =     .27236

---------------------------------------------------------------------------------
                |               Robust
r_annual_2022~d | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
          rv558 |    .014555   .0162826     0.89   0.372    -.0174118    .0465217
                |
c.rv558#c.rv558 |  -.0014298   .0013339    -1.07   0.284    -.0040486     .001189
                |
          _cons |   .1257873   .0480798     2.62   0.009      .031395    .2201796
---------------------------------------------------------------------------------
[RAW] r_annual_2022_excl_res on rv558 + rv558^2 (robust)

Linear regression                               Number of obs     =        815
                                                F(2, 812)         =       0.11
                                                Prob > F          =     0.8943
                                                R-squared         =     0.0003
                                                Root MSE          =     .40915

---------------------------------------------------------------------------------
                |               Robust
r_annual_2022~s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
          rv558 |   .0007761    .021996     0.04   0.972    -.0423997     .043952
                |
c.rv558#c.rv558 |  -.0002851   .0017833    -0.16   0.873    -.0037855    .0032153
                |
          _cons |   .1218507    .066217     1.84   0.066     -.008126    .2518274
---------------------------------------------------------------------------------
[RAW] r_annual_2022_excl_res_trim on rv558 + rv558^2 (robust)

Linear regression                               Number of obs     =        741
                                                F(2, 738)         =       0.36
                                                Prob > F          =     0.6980
                                                R-squared         =     0.0007
                                                Root MSE          =     .17977

---------------------------------------------------------------------------------
                |               Robust
r_annual_2022~m | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
          rv558 |   .0072982   .0087971     0.83   0.407    -.0099722    .0245685
                |
c.rv558#c.rv558 |  -.0005633   .0007583    -0.74   0.458     -.002052    .0009254
                |
          _cons |   .0428936   .0252168     1.70   0.089    -.0066116    .0923989
---------------------------------------------------------------------------------
[RAW] r_annual_2022 on rv559 + rv559^2 (robust)

Linear regression                               Number of obs     =        805
                                                F(2, 802)         =       0.26
                                                Prob > F          =     0.7705
                                                R-squared         =     0.0008
                                                Root MSE          =     .53598

---------------------------------------------------------------------------------
                |               Robust
  r_annual_2022 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
          rv559 |  -.0237539   .0333168    -0.71   0.476    -.0891523    .0416445
                |
c.rv559#c.rv559 |   .0020612   .0028742     0.72   0.474    -.0035807     .007703
                |
          _cons |   .2631713   .0975864     2.70   0.007     .0716164    .4547262
---------------------------------------------------------------------------------
[RAW] r_annual_2022_trim on rv559 + rv559^2 (robust)

Linear regression                               Number of obs     =        728
                                                F(2, 725)         =       0.71
                                                Prob > F          =     0.4902
                                                R-squared         =     0.0019
                                                Root MSE          =     .27214

---------------------------------------------------------------------------------
                |               Robust
r_annual_2022~d | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
          rv559 |  -.0025607   .0176904    -0.14   0.885    -.0372912    .0321697
                |
c.rv559#c.rv559 |  -.0002238   .0014438    -0.16   0.877    -.0030584    .0026108
                |
          _cons |   .1782659   .0526004     3.39   0.001     .0749986    .2815333
---------------------------------------------------------------------------------
[RAW] r_annual_2022_excl_res on rv559 + rv559^2 (robust)

Linear regression                               Number of obs     =        815
                                                F(2, 812)         =       1.21
                                                Prob > F          =     0.2988
                                                R-squared         =     0.0040
                                                Root MSE          =     .40833

---------------------------------------------------------------------------------
                |               Robust
r_annual_2022~s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
          rv559 |  -.0335882   .0253232    -1.33   0.185    -.0832949    .0161185
                |
c.rv559#c.rv559 |   .0032145   .0021438     1.50   0.134    -.0009936    .0074225
                |
          _cons |   .1781616   .0755655     2.36   0.019     .0298348    .3264884
---------------------------------------------------------------------------------
[RAW] r_annual_2022_excl_res_trim on rv559 + rv559^2 (robust)

Linear regression                               Number of obs     =        741
                                                F(2, 738)         =       0.75
                                                Prob > F          =     0.4728
                                                R-squared         =     0.0017
                                                Root MSE          =     .17946

---------------------------------------------------------------------------------
                |               Robust
r_annual_2022~m | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
          rv559 |   .0053559   .0098031     0.55   0.585    -.0138895    .0246012
                |
c.rv559#c.rv559 |  -.0001867   .0008249    -0.23   0.821    -.0018061    .0014327
                |
          _cons |   .0371549   .0285427     1.30   0.193    -.0188798    .0931895
---------------------------------------------------------------------------------
[RAW] r_annual_2022 on rv560 + rv560^2 (robust)

Linear regression                               Number of obs     =        806
                                                F(2, 803)         =       2.62
                                                Prob > F          =     0.0737
                                                R-squared         =     0.0074
                                                Root MSE          =     .53442

---------------------------------------------------------------------------------
                |               Robust
  r_annual_2022 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
          rv560 |  -.0267883   .0258503    -1.04   0.300    -.0775305    .0239539
                |
c.rv560#c.rv560 |   .0007987   .0022012     0.36   0.717    -.0035222    .0051196
                |
          _cons |   .3390769   .0779074     4.35   0.000     .1861506    .4920032
---------------------------------------------------------------------------------
[RAW] r_annual_2022_trim on rv560 + rv560^2 (robust)

Linear regression                               Number of obs     =        729
                                                F(2, 726)         =       1.03
                                                Prob > F          =     0.3573
                                                R-squared         =     0.0030
                                                Root MSE          =     .27258

---------------------------------------------------------------------------------
                |               Robust
r_annual_2022~d | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
          rv560 |   .0013048   .0154151     0.08   0.933    -.0289587    .0315682
                |
c.rv560#c.rv560 |  -.0006097    .001304    -0.47   0.640    -.0031698    .0019504
                |
          _cons |   .1704706   .0443497     3.84   0.000     .0834016    .2575397
---------------------------------------------------------------------------------
[RAW] r_annual_2022_excl_res on rv560 + rv560^2 (robust)

Linear regression                               Number of obs     =        816
                                                F(2, 813)         =       0.56
                                                Prob > F          =     0.5706
                                                R-squared         =     0.0017
                                                Root MSE          =      .4084

---------------------------------------------------------------------------------
                |               Robust
r_annual_2022~s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
          rv560 |  -.0144516   .0212039    -0.68   0.496    -.0560725    .0271693
                |
c.rv560#c.rv560 |   .0007467   .0017441     0.43   0.669    -.0026768    .0041703
                |
          _cons |   .1694493   .0641365     2.64   0.008     .0435567    .2953419
---------------------------------------------------------------------------------
[RAW] r_annual_2022_excl_res_trim on rv560 + rv560^2 (robust)

Linear regression                               Number of obs     =        742
                                                F(2, 739)         =       3.59
                                                Prob > F          =     0.0282
                                                R-squared         =     0.0077
                                                Root MSE          =     .17829

---------------------------------------------------------------------------------
                |               Robust
r_annual_2022~m | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
          rv560 |   .0137544   .0079342     1.73   0.083    -.0018219    .0293306
                |
c.rv560#c.rv560 |  -.0007292   .0007052    -1.03   0.301    -.0021137    .0006552
                |
          _cons |   .0088463   .0219833     0.40   0.687    -.0343108    .0520034
---------------------------------------------------------------------------------
[RAW] r_annual_2022 on rv561 + rv561^2 (robust)

Linear regression                               Number of obs     =        794
                                                F(2, 791)         =       2.41
                                                Prob > F          =     0.0901
                                                R-squared         =     0.0061
                                                Root MSE          =     .53792

---------------------------------------------------------------------------------
                |               Robust
  r_annual_2022 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
          rv561 |   -.006479   .0245945    -0.26   0.792    -.0547572    .0417993
                |
c.rv561#c.rv561 |  -.0008285   .0022353    -0.37   0.711    -.0052164    .0035594
                |
          _cons |   .2725819   .0646949     4.21   0.000     .1455879    .3995759
---------------------------------------------------------------------------------
[RAW] r_annual_2022_trim on rv561 + rv561^2 (robust)

Linear regression                               Number of obs     =        717
                                                F(2, 714)         =       2.16
                                                Prob > F          =     0.1158
                                                R-squared         =     0.0050
                                                Root MSE          =     .27284

---------------------------------------------------------------------------------
                |               Robust
r_annual_2022~d | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
          rv561 |    .000932   .0122508     0.08   0.939    -.0231198    .0249839
                |
c.rv561#c.rv561 |  -.0007436   .0011357    -0.65   0.513    -.0029734    .0014861
                |
          _cons |   .1731902   .0304589     5.69   0.000     .1133904      .23299
---------------------------------------------------------------------------------
[RAW] r_annual_2022_excl_res on rv561 + rv561^2 (robust)

Linear regression                               Number of obs     =        804
                                                F(2, 801)         =       1.50
                                                Prob > F          =     0.2239
                                                R-squared         =     0.0039
                                                Root MSE          =     .41045

---------------------------------------------------------------------------------
                |               Robust
r_annual_2022~s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
          rv561 |  -.0116972   .0182268    -0.64   0.521    -.0474751    .0240806
                |
c.rv561#c.rv561 |   .0002694   .0016294     0.17   0.869     -.002929    .0034678
                |
          _cons |    .165336   .0484305     3.41   0.001     .0702703    .2604017
---------------------------------------------------------------------------------
[RAW] r_annual_2022_excl_res_trim on rv561 + rv561^2 (robust)

Linear regression                               Number of obs     =        730
                                                F(2, 727)         =       1.57
                                                Prob > F          =     0.2091
                                                R-squared         =     0.0039
                                                Root MSE          =     .17854

---------------------------------------------------------------------------------
                |               Robust
r_annual_2022~m | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
          rv561 |    .010227   .0073886     1.38   0.167    -.0042786    .0247325
                |
c.rv561#c.rv561 |  -.0007104    .000716    -0.99   0.321    -.0021161    .0006953
                |
          _cons |   .0322918   .0176154     1.83   0.067    -.0022912    .0668749
---------------------------------------------------------------------------------
[RAW] r_annual_2022 on rv562 + rv562^2 (robust)

Linear regression                               Number of obs     =        770
                                                F(2, 767)         =       0.55
                                                Prob > F          =     0.5796
                                                R-squared         =     0.0016
                                                Root MSE          =      .5141

---------------------------------------------------------------------------------
                |               Robust
  r_annual_2022 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
          rv562 |   .0219062   .0255386     0.86   0.391    -.0282277    .0720401
                |
c.rv562#c.rv562 |  -.0024302   .0024351    -1.00   0.319    -.0072104    .0023501
                |
          _cons |   .1642331   .0662649     2.48   0.013      .034151    .2943153
---------------------------------------------------------------------------------
[RAW] r_annual_2022_trim on rv562 + rv562^2 (robust)

Linear regression                               Number of obs     =        700
                                                F(2, 697)         =       0.59
                                                Prob > F          =     0.5564
                                                R-squared         =     0.0016
                                                Root MSE          =     .27135

---------------------------------------------------------------------------------
                |               Robust
r_annual_2022~d | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
          rv562 |   .0011705   .0127882     0.09   0.927    -.0239374    .0262784
                |
c.rv562#c.rv562 |  -.0005155   .0012317    -0.42   0.676    -.0029337    .0019028
                |
          _cons |   .1604041   .0323013     4.97   0.000     .0969845    .2238237
---------------------------------------------------------------------------------
[RAW] r_annual_2022_excl_res on rv562 + rv562^2 (robust)

Linear regression                               Number of obs     =        780
                                                F(2, 777)         =       0.02
                                                Prob > F          =     0.9820
                                                R-squared         =     0.0001
                                                Root MSE          =     .38152

---------------------------------------------------------------------------------
                |               Robust
r_annual_2022~s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
          rv562 |   .0038277   .0200629     0.19   0.849    -.0355561    .0432116
                |
c.rv562#c.rv562 |  -.0003319   .0018047    -0.18   0.854    -.0038747    .0032108
                |
          _cons |   .0960165   .0540896     1.78   0.076    -.0101625    .2021955
---------------------------------------------------------------------------------
[RAW] r_annual_2022_excl_res_trim on rv562 + rv562^2 (robust)

Linear regression                               Number of obs     =        713
                                                F(2, 710)         =       5.85
                                                Prob > F          =     0.0030
                                                R-squared         =     0.0107
                                                Root MSE          =     .17846

---------------------------------------------------------------------------------
                |               Robust
r_annual_2022~m | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
          rv562 |   .0119632   .0066829     1.79   0.074    -.0011573    .0250838
                |
c.rv562#c.rv562 |  -.0005443   .0007238    -0.75   0.452    -.0019654    .0008767
                |
          _cons |   .0181444   .0142079     1.28   0.202    -.0097502     .046039
---------------------------------------------------------------------------------
[RAW] r_annual_2022 on rv563 + rv563^2 (robust)

Linear regression                               Number of obs     =        801
                                                F(2, 798)         =       0.67
                                                Prob > F          =     0.5124
                                                R-squared         =     0.0021
                                                Root MSE          =     .53704

---------------------------------------------------------------------------------
                |               Robust
  r_annual_2022 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
          rv563 |  -.0271291   .0260425    -1.04   0.298     -.078249    .0239909
                |
c.rv563#c.rv563 |   .0021545   .0026108     0.83   0.409    -.0029703    .0072792
                |
          _cons |   .2738566   .0631378     4.34   0.000     .1499209    .3977923
---------------------------------------------------------------------------------
[RAW] r_annual_2022_trim on rv563 + rv563^2 (robust)

Linear regression                               Number of obs     =        724
                                                F(2, 721)         =       0.38
                                                Prob > F          =     0.6861
                                                R-squared         =     0.0011
                                                Root MSE          =     .27302

---------------------------------------------------------------------------------
                |               Robust
r_annual_2022~d | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
          rv563 |  -.0088182   .0124258    -0.71   0.478    -.0332133    .0155769
                |
c.rv563#c.rv563 |   .0006283   .0012191     0.52   0.606    -.0017652    .0030218
                |
          _cons |   .1747503   .0301182     5.80   0.000     .1156205    .2338801
---------------------------------------------------------------------------------
[RAW] r_annual_2022_excl_res on rv563 + rv563^2 (robust)

Linear regression                               Number of obs     =        811
                                                F(2, 808)         =       0.17
                                                Prob > F          =     0.8475
                                                R-squared         =     0.0004
                                                Root MSE          =     .41017

---------------------------------------------------------------------------------
                |               Robust
r_annual_2022~s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
          rv563 |  -.0100089   .0178852    -0.56   0.576    -.0451158     .025098
                |
c.rv563#c.rv563 |   .0010084     .00176     0.57   0.567    -.0024462     .004463
                |
          _cons |   .1314542   .0433357     3.03   0.002     .0463904     .216518
---------------------------------------------------------------------------------
[RAW] r_annual_2022_excl_res_trim on rv563 + rv563^2 (robust)

Linear regression                               Number of obs     =        737
                                                F(2, 734)         =       2.64
                                                Prob > F          =     0.0721
                                                R-squared         =     0.0065
                                                Root MSE          =     .17988

---------------------------------------------------------------------------------
                |               Robust
r_annual_2022~m | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
          rv563 |    .003784   .0073999     0.51   0.609    -.0107436    .0183115
                |
c.rv563#c.rv563 |   .0001787   .0007433     0.24   0.810    -.0012806     .001638
                |
          _cons |   .0388459   .0174039     2.23   0.026     .0046785    .0730132
---------------------------------------------------------------------------------
[RAW] r_annual_2022 on rv564 + rv564^2 (robust)

Linear regression                               Number of obs     =        798
                                                F(2, 795)         =       0.49
                                                Prob > F          =     0.6138
                                                R-squared         =     0.0016
                                                Root MSE          =     .51654

---------------------------------------------------------------------------------
                |               Robust
  r_annual_2022 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
          rv564 |   .0190153   .0214775     0.89   0.376     -.023144    .0611745
                |
c.rv564#c.rv564 |  -.0027041   .0027645    -0.98   0.328    -.0081307    .0027224
                |
          _cons |    .186961   .0330992     5.65   0.000     .1219888    .2519332
---------------------------------------------------------------------------------
[RAW] r_annual_2022_trim on rv564 + rv564^2 (robust)

Linear regression                               Number of obs     =        723
                                                F(2, 720)         =       0.49
                                                Prob > F          =     0.6107
                                                R-squared         =     0.0014
                                                Root MSE          =     .27258

---------------------------------------------------------------------------------
                |               Robust
r_annual_2022~d | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
          rv564 |  -.0002994   .0115167    -0.03   0.979    -.0229097    .0223109
                |
c.rv564#c.rv564 |   .0005184   .0014589     0.36   0.722    -.0023459    .0033827
                |
          _cons |   .1438622   .0188198     7.64   0.000     .1069139    .1808104
---------------------------------------------------------------------------------
[RAW] r_annual_2022_excl_res on rv564 + rv564^2 (robust)

Linear regression                               Number of obs     =        808
                                                F(2, 805)         =       2.26
                                                Prob > F          =     0.1051
                                                R-squared         =     0.0040
                                                Root MSE          =     .38505

---------------------------------------------------------------------------------
                |               Robust
r_annual_2022~s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
          rv564 |   .0245084   .0142097     1.72   0.085     -.003384    .0524008
                |
c.rv564#c.rv564 |   -.003208   .0015896    -2.02   0.044    -.0063281   -.0000878
                |
          _cons |   .0849213   .0245013     3.47   0.001     .0368273    .1330152
---------------------------------------------------------------------------------
[RAW] r_annual_2022_excl_res_trim on rv564 + rv564^2 (robust)

Linear regression                               Number of obs     =        736
                                                F(2, 733)         =       2.36
                                                Prob > F          =     0.0954
                                                R-squared         =     0.0060
                                                Root MSE          =     .17919

---------------------------------------------------------------------------------
                |               Robust
r_annual_2022~m | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
          rv564 |   .0041823   .0067002     0.62   0.533    -.0089715    .0173362
                |
c.rv564#c.rv564 |   .0001247   .0008158     0.15   0.879    -.0014769    .0017262
                |
          _cons |   .0479806   .0118784     4.04   0.000     .0246608    .0713003
---------------------------------------------------------------------------------

. 
. di as txt "=== BEGIN REGRESSIONS: RETURNS on TRUST (+ controls) ==="
=== BEGIN REGRESSIONS: RETURNS on TRUST (+ controls) ===

. * Build controls actually present; exclude age from ctrl_in and add age as quadratic sep
> arately
. local ctrl_in ""

. local age_quad ""

. foreach c of local ctrl_vars {
  2.     capture confirm variable `c'
  3.     if !_rc {
  4.         if "`c'" == "r15agey_b" {
  5.             local age_quad "c.r15agey_b c.r15agey_b#c.r15agey_b"
  6.         }
  7.         else {
  8.             local ctrl_in "`ctrl_in' `c'"
  9.         }
 10.     }
 11. }

. di as txt "Controls included: `ctrl_in' with age quadratic if available"
Controls included:  raedyrs r15inlbrf married_2020 born_us wealth_d2 wealth_d3 wealth_d4 w
> ealth_d5 wealth_d6 wealth_d7 wealth_d8 wealth_d9 wealth_d10 with age quadratic if availa
> ble

. 
. foreach t of local trust_vars {
  2.     capture confirm variable `t'
  3.     if _rc continue
  4.     foreach y of local ret_vars {
  5.         capture confirm variable `y'
  6.         if _rc continue
  7.         quietly count if !missing(`y') & !missing(`t')
  8.         if r(N)==0 continue
  9.         di as txt "[RAW+C] `y' on `t' + `t'^2 + age quad + controls (robust)"
 10.         regress `y' c.`t' c.`t'#c.`t' `age_quad' `ctrl_in' if !missing(`y') & !missin
> g(`t'), vce(robust)
 11.     }
 12. }
[RAW+C] r_annual_2022 on rv557 + rv557^2 + age quad + controls (robust)
note: wealth_d2 omitted because of collinearity.
note: wealth_d10 omitted because of collinearity.

Linear regression                               Number of obs     =        808
                                                F(15, 792)        =       5.13
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1122
                                                Root MSE          =     .50591

-----------------------------------------------------------------------------------------
                        |               Robust
          r_annual_2022 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
                  rv557 |   .0760594   .0295611     2.57   0.010     .0180321    .1340868
                        |
        c.rv557#c.rv557 |  -.0067547   .0026178    -2.58   0.010    -.0118934   -.0016161
                        |
              r15agey_b |  -.0530976   .0268398    -1.98   0.048    -.1057832   -.0004121
                        |
c.r15agey_b#c.r15agey_b |   .0003625   .0001932     1.88   0.061    -.0000166    .0007417
                        |
                raedyrs |   .0232976    .007358     3.17   0.002     .0088541    .0377412
              r15inlbrf |   .0609045   .0409441     1.49   0.137    -.0194674    .1412764
           married_2020 |   .0688726   .0367703     1.87   0.061    -.0033062    .1410514
                born_us |  -.0134848   .0504982    -0.27   0.790     -.112611    .0856415
              wealth_d2 |          0  (omitted)
              wealth_d3 |   .5258183   .1146918     4.58   0.000     .3006824    .7509541
              wealth_d4 |   .3179018   .0680091     4.67   0.000     .1844024    .4514013
              wealth_d5 |   .3176249   .0589582     5.39   0.000     .2018921    .4333578
              wealth_d6 |   .1547461   .0529391     2.92   0.004     .0508285    .2586637
              wealth_d7 |    .148823    .043042     3.46   0.001     .0643331    .2333129
              wealth_d8 |   .0683962   .0403926     1.69   0.091     -.010893    .1476853
              wealth_d9 |   .0550647   .0368863     1.49   0.136    -.0173417    .1274711
             wealth_d10 |          0  (omitted)
                  _cons |   1.363788   .9315848     1.46   0.144    -.4648795    3.192455
-----------------------------------------------------------------------------------------
[RAW+C] r_annual_2022_trim on rv557 + rv557^2 + age quad + controls (robust)
note: wealth_d2 omitted because of collinearity.
note: wealth_d10 omitted because of collinearity.

Linear regression                               Number of obs     =        733
                                                F(15, 717)        =       4.52
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0831
                                                Root MSE          =     .26311

-----------------------------------------------------------------------------------------
                        |               Robust
  r_annual_2022_trimmed | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
                  rv557 |   .0035292   .0187337     0.19   0.851    -.0332502    .0403085
                        |
        c.rv557#c.rv557 |  -.0007226   .0015217    -0.47   0.635    -.0037101    .0022649
                        |
              r15agey_b |   .0106976    .013611     0.79   0.432    -.0160247    .0374199
                        |
c.r15agey_b#c.r15agey_b |  -.0000806   .0000978    -0.82   0.410    -.0002726    .0001114
                        |
                raedyrs |   .0154383   .0036377     4.24   0.000     .0082964    .0225802
              r15inlbrf |   .0511412   .0222189     2.30   0.022     .0075194     .094763
           married_2020 |   .0524209     .02207     2.38   0.018     .0090915    .0957504
                born_us |  -.0178471   .0269141    -0.66   0.507     -.070687    .0349928
              wealth_d2 |          0  (omitted)
              wealth_d3 |   .1331606   .0553313     2.41   0.016     .0245299    .2417913
              wealth_d4 |   .2168183   .0429908     5.04   0.000     .1324153    .3012213
              wealth_d5 |   .2310914   .0357551     6.46   0.000     .1608942    .3012886
              wealth_d6 |   .1165112   .0338449     3.44   0.001     .0500643    .1829581
              wealth_d7 |   .1392352    .032976     4.22   0.000     .0744941    .2039763
              wealth_d8 |   .0778482   .0320912     2.43   0.016     .0148443     .140852
              wealth_d9 |    .069169   .0314342     2.20   0.028     .0074548    .1308831
             wealth_d10 |          0  (omitted)
                  _cons |  -.5551716   .4743807    -1.17   0.242    -1.486513    .3761696
-----------------------------------------------------------------------------------------
[RAW+C] r_annual_2022_excl_res on rv557 + rv557^2 + age quad + controls (robust)
note: wealth_d2 omitted because of collinearity.

Linear regression                               Number of obs     =        817
                                                F(15, 800)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0669
                                                Root MSE          =     .39777

-----------------------------------------------------------------------------------------
                        |               Robust
 r_annual_2022_excl_res | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
                  rv557 |   .0534092   .0184318     2.90   0.004     .0172288    .0895897
                        |
        c.rv557#c.rv557 |  -.0048234   .0017822    -2.71   0.007    -.0083218    -.001325
                        |
              r15agey_b |  -.0130181   .0259228    -0.50   0.616    -.0639029    .0378667
                        |
c.r15agey_b#c.r15agey_b |   .0000823   .0001862     0.44   0.659    -.0002833    .0004478
                        |
                raedyrs |   .0140073   .0051655     2.71   0.007     .0038677    .0241469
              r15inlbrf |   .0607601   .0327163     1.86   0.064    -.0034597      .12498
           married_2020 |   .0565355   .0285823     1.98   0.048     .0004303    .1126406
                born_us |   .0192599   .0384717     0.50   0.617    -.0562574    .0947772
              wealth_d2 |          0  (omitted)
              wealth_d3 |   .3790494    .083581     4.54   0.000     .2149855    .5431133
              wealth_d4 |   .2412624   .0532822     4.53   0.000     .1366729    .3458519
              wealth_d5 |   .2257093   .0554176     4.07   0.000     .1169283    .3344903
              wealth_d6 |    .191464   .0469287     4.08   0.000      .099346    .2835819
              wealth_d7 |   .1564052   .0371472     4.21   0.000     .0834878    .2293227
              wealth_d8 |   .1222625   .0353333     3.46   0.001     .0529055    .1916194
              wealth_d9 |   .1117074   .0355857     3.14   0.002     .0418551    .1815597
             wealth_d10 |    .058098   .0243325     2.39   0.017      .010335    .1058611
                  _cons |   .0403001   .8905214     0.05   0.964    -1.707734    1.788335
-----------------------------------------------------------------------------------------
[RAW+C] r_annual_2022_excl_res_trim on rv557 + rv557^2 + age quad + controls (robust)
note: wealth_d2 omitted because of collinearity.

Linear regression                               Number of obs     =        743
                                                F(15, 726)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0509
                                                Root MSE          =     .17579

-----------------------------------------------------------------------------------------
                        |               Robust
r_annual_2022_excl_re~m | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
                  rv557 |   .0188578   .0093531     2.02   0.044     .0004956    .0372201
                        |
        c.rv557#c.rv557 |  -.0010852   .0008442    -1.29   0.199    -.0027425    .0005722
                        |
              r15agey_b |  -.0071623   .0089048    -0.80   0.421    -.0246445    .0103199
                        |
c.r15agey_b#c.r15agey_b |   .0000493    .000064     0.77   0.441    -.0000764     .000175
                        |
                raedyrs |   .0050634   .0021176     2.39   0.017     .0009061    .0092207
              r15inlbrf |   .0318323   .0140191     2.27   0.023     .0043095     .059355
           married_2020 |   .0401201   .0140968     2.85   0.005     .0124447    .0677954
                born_us |  -.0011782   .0176428    -0.07   0.947    -.0358152    .0334588
              wealth_d2 |          0  (omitted)
              wealth_d3 |    .142641   .0275111     5.18   0.000     .0886302    .1966519
              wealth_d4 |   .1473348   .0236022     6.24   0.000      .100998    .1936716
              wealth_d5 |   .1422517   .0224112     6.35   0.000     .0982531    .1862503
              wealth_d6 |   .0965078   .0197602     4.88   0.000     .0577138    .1353017
              wealth_d7 |    .112954   .0199112     5.67   0.000     .0738636    .1520444
              wealth_d8 |   .0971822   .0227947     4.26   0.000     .0524309    .1419336
              wealth_d9 |   .1254517   .0240045     5.23   0.000     .0783252    .1725782
             wealth_d10 |   .0685815   .0180085     3.81   0.000     .0332265    .1039365
                  _cons |   .0259155   .3102774     0.08   0.933    -.5832325    .6350634
-----------------------------------------------------------------------------------------
[RAW+C] r_annual_2022 on rv558 + rv558^2 + age quad + controls (robust)
note: wealth_d2 omitted because of collinearity.
note: wealth_d10 omitted because of collinearity.

Linear regression                               Number of obs     =        799
                                                F(15, 783)        =       5.14
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1111
                                                Root MSE          =     .50816

-----------------------------------------------------------------------------------------
                        |               Robust
          r_annual_2022 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
                  rv558 |    .049775   .0300096     1.66   0.098    -.0091338    .1086838
                        |
        c.rv558#c.rv558 |  -.0041275   .0024842    -1.66   0.097    -.0090039     .000749
                        |
              r15agey_b |  -.0519812   .0271206    -1.92   0.056     -.105219    .0012565
                        |
c.r15agey_b#c.r15agey_b |   .0003492   .0001959     1.78   0.075    -.0000354    .0007338
                        |
                raedyrs |   .0245418   .0075813     3.24   0.001     .0096598    .0394239
              r15inlbrf |   .0538891   .0404154     1.33   0.183    -.0254464    .1332245
           married_2020 |   .0648984    .037268     1.74   0.082    -.0082586    .1380555
                born_us |  -.0100507   .0507604    -0.20   0.843    -.1096934    .0895919
              wealth_d2 |          0  (omitted)
              wealth_d3 |   .5402272    .117006     4.62   0.000     .3105446    .7699097
              wealth_d4 |   .3216058    .068089     4.72   0.000     .1879473    .4552644
              wealth_d5 |   .3265403   .0605373     5.39   0.000     .2077056    .4453749
              wealth_d6 |    .150326   .0531103     2.83   0.005     .0460706    .2545815
              wealth_d7 |   .1470248   .0435356     3.38   0.001     .0615644    .2324852
              wealth_d8 |   .0716358   .0404649     1.77   0.077    -.0077968    .1510683
              wealth_d9 |   .0531712   .0377421     1.41   0.159    -.0209164    .1272588
             wealth_d10 |          0  (omitted)
                  _cons |   1.386052   .9454007     1.47   0.143    -.4697682    3.241872
-----------------------------------------------------------------------------------------
[RAW+C] r_annual_2022_trim on rv558 + rv558^2 + age quad + controls (robust)
note: wealth_d2 omitted because of collinearity.
note: wealth_d10 omitted because of collinearity.

Linear regression                               Number of obs     =        724
                                                F(15, 708)        =       4.28
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0809
                                                Root MSE          =     .26338

-----------------------------------------------------------------------------------------
                        |               Robust
  r_annual_2022_trimmed | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
                  rv558 |   .0196822   .0166284     1.18   0.237    -.0129646     .052329
                        |
        c.rv558#c.rv558 |  -.0015991   .0013622    -1.17   0.241    -.0042735    .0010754
                        |
              r15agey_b |   .0080916   .0138019     0.59   0.558     -.019006    .0351892
                        |
c.r15agey_b#c.r15agey_b |  -.0000663   .0000992    -0.67   0.504    -.0002612    .0001285
                        |
                raedyrs |   .0138711   .0035824     3.87   0.000     .0068376    .0209046
              r15inlbrf |   .0434855   .0224141     1.94   0.053    -.0005206    .0874915
           married_2020 |   .0498236   .0226525     2.20   0.028     .0053495    .0942976
                born_us |  -.0139658   .0270246    -0.52   0.605    -.0670237    .0390921
              wealth_d2 |          0  (omitted)
              wealth_d3 |   .1474713   .0556432     2.65   0.008      .038226    .2567167
              wealth_d4 |   .2235512   .0434171     5.15   0.000     .1383096    .3087928
              wealth_d5 |    .229838   .0359671     6.39   0.000     .1592232    .3004529
              wealth_d6 |   .1164562   .0337931     3.45   0.001     .0501096    .1828028
              wealth_d7 |   .1323187     .03373     3.92   0.000      .066096    .1985414
              wealth_d8 |     .07942    .032083     2.48   0.014     .0164307    .1424093
              wealth_d9 |   .0681022   .0319488     2.13   0.033     .0053765    .1308279
             wealth_d10 |          0  (omitted)
                  _cons |  -.4845676   .4826201    -1.00   0.316    -1.432105    .4629703
-----------------------------------------------------------------------------------------
[RAW+C] r_annual_2022_excl_res on rv558 + rv558^2 + age quad + controls (robust)
note: wealth_d2 omitted because of collinearity.

Linear regression                               Number of obs     =        808
                                                F(15, 791)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0618
                                                Root MSE          =     .40087

-----------------------------------------------------------------------------------------
                        |               Robust
 r_annual_2022_excl_res | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
                  rv558 |   .0031827   .0232675     0.14   0.891    -.0424907    .0488562
                        |
        c.rv558#c.rv558 |   -.000067   .0018723    -0.04   0.971    -.0037423    .0036083
                        |
              r15agey_b |  -.0107462   .0256253    -0.42   0.675    -.0610479    .0395555
                        |
c.r15agey_b#c.r15agey_b |   .0000617   .0001844     0.33   0.738    -.0003002    .0004236
                        |
                raedyrs |   .0156536   .0052841     2.96   0.003      .005281    .0260262
              r15inlbrf |   .0607832     .03199     1.90   0.058     -.002012    .1235785
           married_2020 |   .0605142   .0291666     2.07   0.038     .0032611    .1177672
                born_us |   .0216718   .0388434     0.56   0.577    -.0545767    .0979202
              wealth_d2 |          0  (omitted)
              wealth_d3 |    .367591   .0858095     4.28   0.000     .1991497    .5360322
              wealth_d4 |   .2211294   .0538085     4.11   0.000     .1155051    .3267537
              wealth_d5 |   .2135719    .056469     3.78   0.000     .1027251    .3244187
              wealth_d6 |   .1749218   .0450727     3.88   0.000     .0864455    .2633981
              wealth_d7 |   .1383665   .0369561     3.74   0.000     .0658229    .2109101
              wealth_d8 |   .1074652   .0335162     3.21   0.001      .041674    .1732563
              wealth_d9 |   .0923439   .0357562     2.58   0.010     .0221555    .1625322
             wealth_d10 |   .0439677   .0246817     1.78   0.075    -.0044817    .0924171
                  _cons |   .0727624   .8842825     0.08   0.934    -1.663055     1.80858
-----------------------------------------------------------------------------------------
[RAW+C] r_annual_2022_excl_res_trim on rv558 + rv558^2 + age quad + controls (robust)
note: wealth_d2 omitted because of collinearity.

Linear regression                               Number of obs     =        734
                                                F(15, 717)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0441
                                                Root MSE          =     .17701

-----------------------------------------------------------------------------------------
                        |               Robust
r_annual_2022_excl_re~m | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
                  rv558 |   .0071135   .0093726     0.76   0.448    -.0112875    .0255145
                        |
        c.rv558#c.rv558 |  -.0003467   .0008028    -0.43   0.666    -.0019228    .0012295
                        |
              r15agey_b |  -.0070687   .0090774    -0.78   0.436    -.0248902    .0107528
                        |
c.r15agey_b#c.r15agey_b |   .0000481   .0000653     0.74   0.461    -.0000801    .0001764
                        |
                raedyrs |   .0058815   .0021634     2.72   0.007     .0016342    .0101288
              r15inlbrf |   .0325822   .0141907     2.30   0.022     .0047219    .0604424
           married_2020 |   .0442398   .0146151     3.03   0.003     .0155463    .0729332
                born_us |   .0029313   .0178896     0.16   0.870    -.0321909    .0380535
              wealth_d2 |          0  (omitted)
              wealth_d3 |   .1411232   .0281114     5.02   0.000     .0859327    .1963137
              wealth_d4 |   .1383357   .0242237     5.71   0.000     .0907779    .1858935
              wealth_d5 |   .1412052   .0232086     6.08   0.000     .0956402    .1867702
              wealth_d6 |   .0975555   .0203053     4.80   0.000     .0576906    .1374204
              wealth_d7 |    .107924   .0209431     5.15   0.000     .0668069    .1490411
              wealth_d8 |   .0955241   .0235789     4.05   0.000     .0492321     .141816
              wealth_d9 |   .1245789   .0246514     5.05   0.000     .0761812    .1729765
             wealth_d10 |   .0663532   .0188457     3.52   0.000     .0293538    .1033526
                  _cons |   .0528165   .3197451     0.17   0.869    -.5749322    .6805651
-----------------------------------------------------------------------------------------
[RAW+C] r_annual_2022 on rv559 + rv559^2 + age quad + controls (robust)
note: wealth_d2 omitted because of collinearity.
note: wealth_d10 omitted because of collinearity.

Linear regression                               Number of obs     =        799
                                                F(15, 783)        =       5.14
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1087
                                                Root MSE          =     .50878

-----------------------------------------------------------------------------------------
                        |               Robust
          r_annual_2022 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
                  rv559 |  -.0114997   .0342497    -0.34   0.737    -.0787318    .0557324
                        |
        c.rv559#c.rv559 |   .0016289   .0028738     0.57   0.571    -.0040125    .0072702
                        |
              r15agey_b |  -.0492795   .0275019    -1.79   0.074    -.1032656    .0047066
                        |
c.r15agey_b#c.r15agey_b |   .0003264    .000198     1.65   0.100    -.0000623     .000715
                        |
                raedyrs |   .0252668    .007602     3.32   0.001      .010344    .0401896
              r15inlbrf |   .0578838   .0410413     1.41   0.159    -.0226802    .1384479
           married_2020 |   .0752949   .0371567     2.03   0.043     .0023564    .1482334
                born_us |  -.0018091   .0517001    -0.03   0.972    -.1032963    .0996781
              wealth_d2 |          0  (omitted)
              wealth_d3 |   .5295742   .1159311     4.57   0.000     .3020016    .7571467
              wealth_d4 |   .3103762   .0670446     4.63   0.000     .1787678    .4419846
              wealth_d5 |   .3180833   .0592002     5.37   0.000     .2018733    .4342932
              wealth_d6 |   .1514518   .0530418     2.86   0.004     .0473308    .2555728
              wealth_d7 |   .1502102   .0436893     3.44   0.001     .0644481    .2359723
              wealth_d8 |   .0671566   .0399542     1.68   0.093    -.0112734    .1455866
              wealth_d9 |   .0449015    .037275     1.20   0.229    -.0282692    .1180722
             wealth_d10 |          0  (omitted)
                  _cons |   1.410311   .9652703     1.46   0.144    -.4845128    3.305135
-----------------------------------------------------------------------------------------
[RAW+C] r_annual_2022_trim on rv559 + rv559^2 + age quad + controls (robust)
note: wealth_d2 omitted because of collinearity.
note: wealth_d10 omitted because of collinearity.

Linear regression                               Number of obs     =        724
                                                F(15, 708)        =       4.28
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0794
                                                Root MSE          =     .26337

-----------------------------------------------------------------------------------------
                        |               Robust
  r_annual_2022_trimmed | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
                  rv559 |     .00299   .0185475     0.16   0.872    -.0334246    .0394046
                        |
        c.rv559#c.rv559 |  -.0004497    .001507    -0.30   0.765    -.0034085     .002509
                        |
              r15agey_b |   .0101692   .0140251     0.73   0.469    -.0173666    .0377051
                        |
c.r15agey_b#c.r15agey_b |  -.0000798   .0001008    -0.79   0.429    -.0002777     .000118
                        |
                raedyrs |   .0140416   .0035747     3.93   0.000     .0070233      .02106
              r15inlbrf |   .0424984   .0225022     1.89   0.059    -.0016807    .0866774
           married_2020 |   .0488241   .0228596     2.14   0.033     .0039435    .0937048
                born_us |  -.0141503   .0270892    -0.52   0.602     -.067335    .0390343
              wealth_d2 |          0  (omitted)
              wealth_d3 |   .1475382   .0555747     2.65   0.008     .0384272    .2566492
              wealth_d4 |   .2221792   .0427658     5.20   0.000     .1382162    .3061421
              wealth_d5 |   .2319705    .036311     6.39   0.000     .1606803    .3032606
              wealth_d6 |   .1191022   .0337748     3.53   0.000     .0527914     .185413
              wealth_d7 |   .1341777   .0337543     3.98   0.000     .0679071    .2004483
              wealth_d8 |   .0814764   .0322874     2.52   0.012     .0180859    .1448669
              wealth_d9 |   .0709369   .0320067     2.22   0.027     .0080975    .1337763
             wealth_d10 |          0  (omitted)
                  _cons |  -.5126716   .4909822    -1.04   0.297    -1.476627    .4512838
-----------------------------------------------------------------------------------------
[RAW+C] r_annual_2022_excl_res on rv559 + rv559^2 + age quad + controls (robust)
note: wealth_d2 omitted because of collinearity.

Linear regression                               Number of obs     =        808
                                                F(15, 791)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0684
                                                Root MSE          =     .39938

-----------------------------------------------------------------------------------------
                        |               Robust
 r_annual_2022_excl_res | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
                  rv559 |  -.0323668   .0265402    -1.22   0.223    -.0844643    .0197307
                        |
        c.rv559#c.rv559 |   .0036044   .0022189     1.62   0.105    -.0007513    .0079601
                        |
              r15agey_b |  -.0099236    .025476    -0.39   0.697    -.0599321     .040085
                        |
c.r15agey_b#c.r15agey_b |   .0000527   .0001829     0.29   0.773    -.0003064    .0004118
                        |
                raedyrs |   .0161583   .0052716     3.07   0.002     .0058103    .0265063
              r15inlbrf |   .0638881   .0324076     1.97   0.049      .000273    .1275033
           married_2020 |    .069753   .0288867     2.41   0.016     .0130493    .1264566
                born_us |   .0285231   .0390963     0.73   0.466    -.0482217    .1052679
              wealth_d2 |          0  (omitted)
              wealth_d3 |   .3401483   .0817056     4.16   0.000     .1797629    .5005337
              wealth_d4 |   .1980386   .0530879     3.73   0.000     .0938288    .3022485
              wealth_d5 |   .1849721   .0520807     3.55   0.000     .0827393    .2872049
              wealth_d6 |   .1578753   .0434533     3.63   0.000      .072578    .2431727
              wealth_d7 |   .1205764    .037373     3.23   0.001     .0472143    .1939384
              wealth_d8 |   .0838854    .033554     2.50   0.013     .0180199    .1497509
              wealth_d9 |   .0653166   .0362759     1.80   0.072    -.0058919     .136525
             wealth_d10 |   .0226707   .0254283     0.89   0.373    -.0272442    .0725856
                  _cons |   .1181372   .8877294     0.13   0.894    -1.624447    1.860721
-----------------------------------------------------------------------------------------
[RAW+C] r_annual_2022_excl_res_trim on rv559 + rv559^2 + age quad + controls (robust)
note: wealth_d2 omitted because of collinearity.

Linear regression                               Number of obs     =        734
                                                F(15, 717)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0469
                                                Root MSE          =     .17654

-----------------------------------------------------------------------------------------
                        |               Robust
r_annual_2022_excl_re~m | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
                  rv559 |   .0051465     .01028     0.50   0.617     -.015036     .025329
                        |
        c.rv559#c.rv559 |   .0000397   .0008704     0.05   0.964     -.001669    .0017485
                        |
              r15agey_b |  -.0063665   .0091783    -0.69   0.488    -.0243859     .011653
                        |
c.r15agey_b#c.r15agey_b |    .000043    .000066     0.65   0.515    -.0000866    .0001726
                        |
                raedyrs |   .0059196   .0021733     2.72   0.007     .0016528    .0101863
              r15inlbrf |    .033631   .0141937     2.37   0.018     .0057648    .0614971
           married_2020 |   .0456487   .0146806     3.11   0.002     .0168265    .0744708
                born_us |   .0035967   .0178877     0.20   0.841    -.0315218    .0387152
              wealth_d2 |          0  (omitted)
              wealth_d3 |   .1371226    .027986     4.90   0.000     .0821782     .192067
              wealth_d4 |   .1368811   .0237987     5.75   0.000     .0901577    .1836046
              wealth_d5 |   .1378149   .0233673     5.90   0.000     .0919385    .1836914
              wealth_d6 |   .0967601   .0198878     4.87   0.000     .0577148    .1358054
              wealth_d7 |   .1057093    .020647     5.12   0.000     .0651735    .1462452
              wealth_d8 |   .0919391   .0234422     3.92   0.000     .0459156    .1379627
              wealth_d9 |   .1202618   .0243434     4.94   0.000      .072469    .1680547
             wealth_d10 |   .0608634   .0190477     3.20   0.001     .0234676    .0982593
                  _cons |   .0242428   .3230929     0.08   0.940    -.6100784    .6585641
-----------------------------------------------------------------------------------------
[RAW+C] r_annual_2022 on rv560 + rv560^2 + age quad + controls (robust)
note: wealth_d2 omitted because of collinearity.
note: wealth_d10 omitted because of collinearity.

Linear regression                               Number of obs     =        800
                                                F(15, 784)        =       5.11
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1097
                                                Root MSE          =     .50871

-----------------------------------------------------------------------------------------
                        |               Robust
          r_annual_2022 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
                  rv560 |  -.0153467   .0266629    -0.58   0.565    -.0676858    .0369923
                        |
        c.rv560#c.rv560 |   .0004186    .002228     0.19   0.851    -.0039549    .0047921
                        |
              r15agey_b |  -.0510109   .0278262    -1.83   0.067    -.1056336    .0036118
                        |
c.r15agey_b#c.r15agey_b |   .0003482   .0002007     1.73   0.083    -.0000458    .0007421
                        |
                raedyrs |   .0263241   .0075517     3.49   0.001     .0115002    .0411479
              r15inlbrf |   .0664778    .041041     1.62   0.106    -.0140854     .147041
           married_2020 |   .0706919   .0375149     1.88   0.060    -.0029496    .1443334
                born_us |  -.0050988   .0508199    -0.10   0.920     -.104858    .0946605
              wealth_d2 |          0  (omitted)
              wealth_d3 |   .5211839   .1166779     4.47   0.000     .2921459     .750222
              wealth_d4 |   .3071951   .0668474     4.60   0.000      .175974    .4384161
              wealth_d5 |   .3223103    .060439     5.33   0.000     .2036689    .4409518
              wealth_d6 |   .1477012   .0528219     2.80   0.005     .0440121    .2513903
              wealth_d7 |   .1441895   .0434593     3.32   0.001     .0588791    .2294999
              wealth_d8 |   .0610686   .0407169     1.50   0.134    -.0188584    .1409956
              wealth_d9 |    .052693   .0379572     1.39   0.165    -.0218168    .1272029
             wealth_d10 |          0  (omitted)
                  _cons |   1.493805   .9813966     1.52   0.128    -.4326715    3.420281
-----------------------------------------------------------------------------------------
[RAW+C] r_annual_2022_trim on rv560 + rv560^2 + age quad + controls (robust)
note: wealth_d2 omitted because of collinearity.
note: wealth_d10 omitted because of collinearity.

Linear regression                               Number of obs     =        725
                                                F(15, 709)        =       4.46
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0835
                                                Root MSE          =     .26337

-----------------------------------------------------------------------------------------
                        |               Robust
  r_annual_2022_trimmed | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
                  rv560 |   .0003633   .0152331     0.02   0.981    -.0295441    .0302707
                        |
        c.rv560#c.rv560 |  -.0003651   .0012748    -0.29   0.775    -.0028679    .0021378
                        |
              r15agey_b |   .0083985   .0139754     0.60   0.548    -.0190396    .0358366
                        |
c.r15agey_b#c.r15agey_b |  -.0000649   .0001006    -0.65   0.519    -.0002623    .0001325
                        |
                raedyrs |   .0149943   .0035935     4.17   0.000     .0079392    .0220495
              r15inlbrf |   .0505355   .0225099     2.25   0.025     .0063415    .0947296
           married_2020 |   .0528318   .0225245     2.35   0.019     .0086091    .0970545
                born_us |  -.0150836   .0270131    -0.56   0.577    -.0681188    .0379516
              wealth_d2 |          0  (omitted)
              wealth_d3 |   .1419839   .0559035     2.54   0.011     .0322277      .25174
              wealth_d4 |   .2216637   .0430087     5.15   0.000     .1372241    .3061033
              wealth_d5 |   .2320376   .0362294     6.40   0.000     .1609079    .3031672
              wealth_d6 |   .1212089    .033806     3.59   0.000      .054837    .1875808
              wealth_d7 |   .1352541   .0335486     4.03   0.000     .0693877    .2011206
              wealth_d8 |   .0758901   .0320679     2.37   0.018     .0129307    .1388495
              wealth_d9 |   .0715942   .0320071     2.24   0.026     .0087541    .1344344
             wealth_d10 |          0  (omitted)
                  _cons |  -.4684015   .4947983    -0.95   0.344    -1.439847    .5030438
-----------------------------------------------------------------------------------------
[RAW+C] r_annual_2022_excl_res on rv560 + rv560^2 + age quad + controls (robust)
note: wealth_d2 omitted because of collinearity.

Linear regression                               Number of obs     =        809
                                                F(15, 792)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0620
                                                Root MSE          =     .40037

-----------------------------------------------------------------------------------------
                        |               Robust
 r_annual_2022_excl_res | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
                  rv560 |  -.0149133   .0220689    -0.68   0.499    -.0582337    .0284071
                        |
        c.rv560#c.rv560 |   .0011197   .0018139     0.62   0.537    -.0024409    .0046803
                        |
              r15agey_b |  -.0106791   .0252053    -0.42   0.672    -.0601562    .0387981
                        |
c.r15agey_b#c.r15agey_b |   .0000639   .0001813     0.35   0.725     -.000292    .0004197
                        |
                raedyrs |   .0161852   .0052795     3.07   0.002     .0058217    .0265488
              r15inlbrf |   .0651267   .0328406     1.98   0.048     .0006619    .1295916
           married_2020 |   .0597533   .0293894     2.03   0.042      .002063    .1174436
                born_us |   .0197869   .0392541     0.50   0.614    -.0572674    .0968412
              wealth_d2 |          0  (omitted)
              wealth_d3 |   .3796472   .0869293     4.37   0.000      .209008    .5502863
              wealth_d4 |   .2385693   .0597423     3.99   0.000     .1212974    .3558412
              wealth_d5 |   .2329759   .0597633     3.90   0.000     .1156627    .3502891
              wealth_d6 |   .1934874    .052598     3.68   0.000     .0902395    .2967353
              wealth_d7 |   .1554844   .0465483     3.34   0.001     .0641117    .2468571
              wealth_d8 |   .1212041   .0450983     2.69   0.007     .0326777    .2097305
              wealth_d9 |   .1103203   .0459015     2.40   0.016     .0202173    .2004233
             wealth_d10 |   .0655136   .0385259     1.70   0.089    -.0101114    .1411386
                  _cons |   .0920411   .8768454     0.10   0.916    -1.629175    1.813257
-----------------------------------------------------------------------------------------
[RAW+C] r_annual_2022_excl_res_trim on rv560 + rv560^2 + age quad + controls (robust)
note: wealth_d2 omitted because of collinearity.

Linear regression                               Number of obs     =        735
                                                F(15, 718)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0513
                                                Root MSE          =      .1755

-----------------------------------------------------------------------------------------
                        |               Robust
r_annual_2022_excl_re~m | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
                  rv560 |   .0101654   .0083629     1.22   0.225    -.0062533    .0265841
                        |
        c.rv560#c.rv560 |  -.0003325   .0007404    -0.45   0.654    -.0017861    .0011211
                        |
              r15agey_b |  -.0054259   .0088391    -0.61   0.540    -.0227796    .0119277
                        |
c.r15agey_b#c.r15agey_b |   .0000366   .0000637     0.57   0.566    -.0000884    .0001617
                        |
                raedyrs |   .0058429   .0021514     2.72   0.007     .0016192    .0100666
              r15inlbrf |   .0343603   .0141565     2.43   0.015     .0065672    .0621533
           married_2020 |   .0427131   .0144587     2.95   0.003     .0143267    .0710994
                born_us |  -.0036941   .0178998    -0.21   0.837    -.0388364    .0314481
              wealth_d2 |          0  (omitted)
              wealth_d3 |   .1084062   .0289019     3.75   0.000     .0516638    .1651486
              wealth_d4 |    .108895   .0250772     4.34   0.000     .0596617    .1581284
              wealth_d5 |   .1103943   .0242209     4.56   0.000      .062842    .1579465
              wealth_d6 |   .0664419   .0219146     3.03   0.003     .0234176    .1094661
              wealth_d7 |   .0736972   .0230947     3.19   0.001     .0283559    .1190385
              wealth_d8 |   .0567237    .024161     2.35   0.019     .0092891    .1041583
              wealth_d9 |   .0872399   .0257622     3.39   0.001     .0366616    .1378182
             wealth_d10 |   .0334083   .0216603     1.54   0.123    -.0091169    .0759335
                  _cons |    .014289   .3113771     0.05   0.963    -.5970293    .6256074
-----------------------------------------------------------------------------------------
[RAW+C] r_annual_2022 on rv561 + rv561^2 + age quad + controls (robust)
note: wealth_d2 omitted because of collinearity.
note: wealth_d10 omitted because of collinearity.

Linear regression                               Number of obs     =        788
                                                F(15, 772)        =       5.00
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1105
                                                Root MSE          =     .51153

-----------------------------------------------------------------------------------------
                        |               Robust
          r_annual_2022 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
                  rv561 |  -.0062792   .0238685    -0.26   0.793     -.053134    .0405756
                        |
        c.rv561#c.rv561 |   .0001332    .002159     0.06   0.951     -.004105    .0043714
                        |
              r15agey_b |  -.0547463   .0287536    -1.90   0.057    -.1111908    .0016983
                        |
c.r15agey_b#c.r15agey_b |   .0003692   .0002071     1.78   0.075    -.0000373    .0007757
                        |
                raedyrs |   .0260767   .0077418     3.37   0.001     .0108793    .0412741
              r15inlbrf |   .0601711   .0406896     1.48   0.140    -.0197042    .1400464
           married_2020 |   .0654196   .0382867     1.71   0.088    -.0097388     .140578
                born_us |  -.0133477   .0511283    -0.26   0.794    -.1137146    .0870192
              wealth_d2 |          0  (omitted)
              wealth_d3 |   .5367349   .1201135     4.47   0.000     .3009471    .7725226
              wealth_d4 |   .3004737   .0703988     4.27   0.000      .162278    .4386694
              wealth_d5 |   .3163227   .0627218     5.04   0.000     .1931972    .4394481
              wealth_d6 |   .1415883   .0528026     2.68   0.007     .0379346     .245242
              wealth_d7 |   .1410052    .044437     3.17   0.002     .0537735    .2282369
              wealth_d8 |   .0650709   .0414576     1.57   0.117     -.016312    .1464538
              wealth_d9 |   .0447399   .0368806     1.21   0.225    -.0276583     .117138
             wealth_d10 |          0  (omitted)
                  _cons |   1.619666   1.017551     1.59   0.112    -.3778287    3.617161
-----------------------------------------------------------------------------------------
[RAW+C] r_annual_2022_trim on rv561 + rv561^2 + age quad + controls (robust)
note: wealth_d2 omitted because of collinearity.
note: wealth_d10 omitted because of collinearity.

Linear regression                               Number of obs     =        713
                                                F(15, 697)        =       4.11
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0781
                                                Root MSE          =     .26469

-----------------------------------------------------------------------------------------
                        |               Robust
  r_annual_2022_trimmed | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
                  rv561 |  -.0024246   .0125216    -0.19   0.847    -.0270092      .02216
                        |
        c.rv561#c.rv561 |  -.0001248   .0011387    -0.11   0.913    -.0023605    .0021109
                        |
              r15agey_b |    .011578   .0148605     0.78   0.436    -.0175987    .0407547
                        |
c.r15agey_b#c.r15agey_b |  -.0000908   .0001066    -0.85   0.394    -.0003001    .0001184
                        |
                raedyrs |   .0142637   .0035807     3.98   0.000     .0072336    .0212939
              r15inlbrf |   .0451788    .022694     1.99   0.047     .0006219    .0897356
           married_2020 |   .0466739   .0229832     2.03   0.043     .0015493    .0917985
                born_us |  -.0137769   .0274861    -0.50   0.616    -.0677424    .0401886
              wealth_d2 |          0  (omitted)
              wealth_d3 |   .1352707   .0586071     2.31   0.021     .0202031    .2503383
              wealth_d4 |   .2101711   .0442574     4.75   0.000     .1232773    .2970648
              wealth_d5 |   .2216511   .0366137     6.05   0.000     .1497647    .2935374
              wealth_d6 |   .1137161   .0340971     3.34   0.001     .0467708    .1806614
              wealth_d7 |   .1314935   .0340689     3.86   0.000     .0646036    .1983834
              wealth_d8 |   .0782043   .0326312     2.40   0.017     .0141371    .1422715
              wealth_d9 |   .0646138   .0315554     2.05   0.041     .0026588    .1265689
             wealth_d10 |          0  (omitted)
                  _cons |   -.538915   .5220161    -1.03   0.302    -1.563828    .4859975
-----------------------------------------------------------------------------------------
[RAW+C] r_annual_2022_excl_res on rv561 + rv561^2 + age quad + controls (robust)
note: wealth_d2 omitted because of collinearity.

Linear regression                               Number of obs     =        797
                                                F(15, 780)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0656
                                                Root MSE          =     .40214

-----------------------------------------------------------------------------------------
                        |               Robust
 r_annual_2022_excl_res | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
                  rv561 |  -.0181071   .0179908    -1.01   0.315    -.0534233     .017209
                        |
        c.rv561#c.rv561 |   .0013434    .001585     0.85   0.397     -.001768    .0044549
                        |
              r15agey_b |  -.0148678   .0271142    -0.55   0.584    -.0680933    .0383576
                        |
c.r15agey_b#c.r15agey_b |   .0000916   .0001949     0.47   0.639     -.000291    .0004742
                        |
                raedyrs |   .0167417   .0052955     3.16   0.002     .0063465    .0271369
              r15inlbrf |   .0645932   .0323027     2.00   0.046     .0011827    .1280037
           married_2020 |   .0583365   .0299338     1.95   0.052    -.0004238    .1170968
                born_us |   .0171655   .0392843     0.44   0.662    -.0599499    .0942809
              wealth_d2 |          0  (omitted)
              wealth_d3 |   .3846298   .0880461     4.37   0.000     .2117944    .5574652
              wealth_d4 |   .2284562    .053887     4.24   0.000     .1226755    .3342369
              wealth_d5 |   .2236846   .0577552     3.87   0.000     .1103106    .3370586
              wealth_d6 |   .1863151   .0494342     3.77   0.000     .0892753    .2833549
              wealth_d7 |   .1531431   .0429865     3.56   0.000     .0687602    .2375261
              wealth_d8 |    .123547   .0403375     3.06   0.002      .044364      .20273
              wealth_d9 |   .1065321   .0419086     2.54   0.011     .0242652    .1887991
             wealth_d10 |    .064535     .03302     1.95   0.051    -.0002837    .1293537
                  _cons |   .2510284   .9444833     0.27   0.790    -1.603002    2.105059
-----------------------------------------------------------------------------------------
[RAW+C] r_annual_2022_excl_res_trim on rv561 + rv561^2 + age quad + controls (robust)
note: wealth_d2 omitted because of collinearity.

Linear regression                               Number of obs     =        723
                                                F(15, 706)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0450
                                                Root MSE          =       .176

-----------------------------------------------------------------------------------------
                        |               Robust
r_annual_2022_excl_re~m | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
                  rv561 |   .0049809   .0075784     0.66   0.511     -.009898    .0198598
                        |
        c.rv561#c.rv561 |  -.0001382   .0007244    -0.19   0.849    -.0015605    .0012841
                        |
              r15agey_b |  -.0083589   .0094939    -0.88   0.379    -.0269985    .0102807
                        |
c.r15agey_b#c.r15agey_b |    .000058   .0000681     0.85   0.394    -.0000756    .0001917
                        |
                raedyrs |   .0059928   .0021591     2.78   0.006     .0017537    .0102318
              r15inlbrf |   .0348058   .0143803     2.42   0.016     .0065725    .0630392
           married_2020 |   .0413417   .0144905     2.85   0.004      .012892    .0697914
                born_us |  -.0015968   .0180087    -0.09   0.929    -.0369538    .0337601
              wealth_d2 |          0  (omitted)
              wealth_d3 |    .130527   .0283508     4.60   0.000      .074865     .186189
              wealth_d4 |   .1238422    .022648     5.47   0.000     .0793768    .1683076
              wealth_d5 |   .1164836   .0234719     4.96   0.000     .0704005    .1625668
              wealth_d6 |   .0798769   .0211637     3.77   0.000     .0383256    .1214282
              wealth_d7 |   .0890722   .0223697     3.98   0.000      .045153    .1329914
              wealth_d8 |   .0779416   .0238395     3.27   0.001     .0311368    .1247464
              wealth_d9 |    .102477   .0260347     3.94   0.000     .0513622    .1535918
             wealth_d10 |   .0498948   .0203477     2.45   0.014     .0099457     .089844
                  _cons |   .1204797   .3359742     0.36   0.720    -.5391484    .7801078
-----------------------------------------------------------------------------------------
[RAW+C] r_annual_2022 on rv562 + rv562^2 + age quad + controls (robust)
note: wealth_d2 omitted because of collinearity.
note: wealth_d10 omitted because of collinearity.

Linear regression                               Number of obs     =        764
                                                F(15, 748)        =       5.40
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1065
                                                Root MSE          =     .48864

-----------------------------------------------------------------------------------------
                        |               Robust
          r_annual_2022 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
                  rv562 |   .0201916   .0255036     0.79   0.429    -.0298756    .0702587
                        |
        c.rv562#c.rv562 |   -.001235   .0023968    -0.52   0.607    -.0059402    .0034703
                        |
              r15agey_b |  -.0351373    .026422    -1.33   0.184    -.0870073    .0167328
                        |
c.r15agey_b#c.r15agey_b |   .0002145   .0001878     1.14   0.254    -.0001542    .0005833
                        |
                raedyrs |   .0232328   .0074275     3.13   0.002     .0086515    .0378141
              r15inlbrf |   .0475829    .042503     1.12   0.263    -.0358565    .1310224
           married_2020 |   .0693364   .0369838     1.87   0.061    -.0032681    .1419409
                born_us |  -.0178642   .0491516    -0.36   0.716    -.1143557    .0786274
              wealth_d2 |          0  (omitted)
              wealth_d3 |   .4949796   .1222544     4.05   0.000     .2549771    .7349821
              wealth_d4 |    .317817   .0699322     4.54   0.000     .1805302    .4551037
              wealth_d5 |   .2991416   .0486538     6.15   0.000     .2036274    .3946558
              wealth_d6 |   .1585633   .0540564     2.93   0.003      .052443    .2646837
              wealth_d7 |     .13451   .0444542     3.03   0.003     .0472402    .2217798
              wealth_d8 |   .0602916    .040743     1.48   0.139    -.0196927     .140276
              wealth_d9 |   .0419904   .0377764     1.11   0.267      -.03217    .1161509
             wealth_d10 |          0  (omitted)
                  _cons |   .9589402    .936934     1.02   0.306    -.8803928    2.798273
-----------------------------------------------------------------------------------------
[RAW+C] r_annual_2022_trim on rv562 + rv562^2 + age quad + controls (robust)
note: wealth_d2 omitted because of collinearity.
note: wealth_d10 omitted because of collinearity.

Linear regression                               Number of obs     =        696
                                                F(15, 680)        =       3.96
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0783
                                                Root MSE          =     .26282

-----------------------------------------------------------------------------------------
                        |               Robust
  r_annual_2022_trimmed | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
                  rv562 |  -.0012088   .0134238    -0.09   0.928    -.0275658    .0251483
                        |
        c.rv562#c.rv562 |   .0000781   .0012662     0.06   0.951     -.002408    .0025642
                        |
              r15agey_b |   .0117192    .013955     0.84   0.401    -.0156808    .0391192
                        |
c.r15agey_b#c.r15agey_b |  -.0000942   .0001005    -0.94   0.349    -.0002916    .0001032
                        |
                raedyrs |   .0144138   .0037533     3.84   0.000     .0070444    .0217832
              r15inlbrf |   .0431738   .0228148     1.89   0.059    -.0016221    .0879696
           married_2020 |   .0513466   .0231699     2.22   0.027     .0058534    .0968398
                born_us |  -.0152231     .02787    -0.55   0.585    -.0699447    .0394985
              wealth_d2 |          0  (omitted)
              wealth_d3 |     .12898   .0584628     2.21   0.028     .0141906    .2437693
              wealth_d4 |   .2120623   .0445988     4.75   0.000     .1244944    .2996301
              wealth_d5 |    .223271   .0369794     6.04   0.000     .1506634    .2958786
              wealth_d6 |   .1247335   .0342381     3.64   0.000     .0575084    .1919585
              wealth_d7 |   .1149318   .0340637     3.37   0.001     .0480491    .1818145
              wealth_d8 |   .0699609    .032376     2.16   0.031     .0063919    .1335299
              wealth_d9 |   .0635793   .0322369     1.97   0.049     .0002834    .1268751
             wealth_d10 |          0  (omitted)
                  _cons |  -.5507662   .4900103    -1.12   0.261    -1.512881    .4113487
-----------------------------------------------------------------------------------------
[RAW+C] r_annual_2022_excl_res on rv562 + rv562^2 + age quad + controls (robust)
note: wealth_d2 omitted because of collinearity.

Linear regression                               Number of obs     =        773
                                                F(15, 756)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0670
                                                Root MSE          =     .37285

-----------------------------------------------------------------------------------------
                        |               Robust
 r_annual_2022_excl_res | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
                  rv562 |  -.0027278   .0205179    -0.13   0.894    -.0430067    .0375511
                        |
        c.rv562#c.rv562 |   .0008398   .0018363     0.46   0.648    -.0027649    .0044446
                        |
              r15agey_b |   .0052671   .0220655     0.24   0.811    -.0380498    .0485839
                        |
c.r15agey_b#c.r15agey_b |   -.000067   .0001556    -0.43   0.667    -.0003724    .0002385
                        |
                raedyrs |   .0155014    .004823     3.21   0.001     .0060333    .0249694
              r15inlbrf |   .0469824   .0337443     1.39   0.164    -.0192613     .113226
           married_2020 |   .0602758   .0281319     2.14   0.032     .0050498    .1155018
                born_us |   .0004504   .0379949     0.01   0.991    -.0741377    .0750385
              wealth_d2 |          0  (omitted)
              wealth_d3 |   .3199036   .0908508     3.52   0.000     .1415537    .4982534
              wealth_d4 |   .2034233   .0512148     3.97   0.000     .1028831    .3039634
              wealth_d5 |   .1617904   .0371406     4.36   0.000     .0888794    .2347014
              wealth_d6 |   .1663578   .0465971     3.57   0.000     .0748827    .2578329
              wealth_d7 |   .1174873   .0417305     2.82   0.005     .0355658    .1994087
              wealth_d8 |   .0849462   .0403626     2.10   0.036     .0057101    .1641823
              wealth_d9 |   .0660431    .041748     1.58   0.114    -.0159127    .1479989
             wealth_d10 |   .0250016    .032553     0.77   0.443    -.0389035    .0889067
                  _cons |  -.3649042   .7863347    -0.46   0.643    -1.908563    1.178755
-----------------------------------------------------------------------------------------
[RAW+C] r_annual_2022_excl_res_trim on rv562 + rv562^2 + age quad + controls (robust)
note: wealth_d2 omitted because of collinearity.

Linear regression                               Number of obs     =        706
                                                F(15, 689)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0525
                                                Root MSE          =     .17587

-----------------------------------------------------------------------------------------
                        |               Robust
r_annual_2022_excl_re~m | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
                  rv562 |   .0069136   .0071962     0.96   0.337    -.0072154    .0210426
                        |
        c.rv562#c.rv562 |   .0000578    .000752     0.08   0.939    -.0014187    .0015343
                        |
              r15agey_b |  -.0045056   .0092326    -0.49   0.626     -.022633    .0136218
                        |
c.r15agey_b#c.r15agey_b |   .0000295   .0000663     0.45   0.656    -.0001006    .0001596
                        |
                raedyrs |   .0053865   .0021972     2.45   0.014     .0010725    .0097006
              r15inlbrf |    .033031   .0144817     2.28   0.023     .0045975    .0614644
           married_2020 |    .042627   .0148034     2.88   0.004     .0135617    .0716922
                born_us |   .0052437   .0182118     0.29   0.773    -.0305135    .0410009
              wealth_d2 |          0  (omitted)
              wealth_d3 |   .1213701   .0296606     4.09   0.000     .0631342     .179606
              wealth_d4 |   .1166976   .0225858     5.17   0.000     .0723524    .1610427
              wealth_d5 |   .1137434   .0231767     4.91   0.000     .0682379    .1592489
              wealth_d6 |    .074186   .0203685     3.64   0.000     .0341942    .1141777
              wealth_d7 |   .0706047    .022326     3.16   0.002     .0267696    .1144397
              wealth_d8 |   .0687274   .0239376     2.87   0.004      .021728    .1157267
              wealth_d9 |   .0897618   .0255887     3.51   0.000     .0395207     .140003
             wealth_d10 |   .0407556   .0213059     1.91   0.056    -.0010767    .0825879
                  _cons |  -.0114506    .327367    -0.03   0.972    -.6542073    .6313061
-----------------------------------------------------------------------------------------
[RAW+C] r_annual_2022 on rv563 + rv563^2 + age quad + controls (robust)
note: wealth_d2 omitted because of collinearity.
note: wealth_d10 omitted because of collinearity.

Linear regression                               Number of obs     =        795
                                                F(15, 779)        =       5.05
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1080
                                                Root MSE          =     .51036

-----------------------------------------------------------------------------------------
                        |               Robust
          r_annual_2022 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
                  rv563 |  -.0293449   .0256106    -1.15   0.252     -.079619    .0209291
                        |
        c.rv563#c.rv563 |    .002658   .0025976     1.02   0.307    -.0024411    .0077571
                        |
              r15agey_b |  -.0481285   .0276826    -1.74   0.083    -.1024698    .0062128
                        |
c.r15agey_b#c.r15agey_b |   .0003241      .0002     1.62   0.105    -.0000685    .0007167
                        |
                raedyrs |    .027439   .0078535     3.49   0.001     .0120224    .0428556
              r15inlbrf |   .0672868   .0408672     1.65   0.100    -.0129361    .1475097
           married_2020 |    .076995    .038023     2.02   0.043     .0023553    .1516347
                born_us |  -.0094577   .0512645    -0.18   0.854    -.1100906    .0911752
              wealth_d2 |          0  (omitted)
              wealth_d3 |    .525681   .1155157     4.55   0.000      .298922      .75244
              wealth_d4 |    .309577   .0675682     4.58   0.000     .1769397    .4422143
              wealth_d5 |   .3204936   .0593234     5.40   0.000     .2040409    .4369463
              wealth_d6 |    .148682   .0527116     2.82   0.005     .0452083    .2521556
              wealth_d7 |   .1500678   .0439284     3.42   0.001     .0638359    .2362998
              wealth_d8 |   .0670139   .0411026     1.63   0.103     -.013671    .1476988
              wealth_d9 |   .0452489   .0376233     1.20   0.229    -.0286062    .1191041
             wealth_d10 |          0  (omitted)
                  _cons |   1.378498   .9734334     1.42   0.157    -.5323656    3.289361
-----------------------------------------------------------------------------------------
[RAW+C] r_annual_2022_trim on rv563 + rv563^2 + age quad + controls (robust)
note: wealth_d2 omitted because of collinearity.
note: wealth_d10 omitted because of collinearity.

Linear regression                               Number of obs     =        720
                                                F(15, 704)        =       4.42
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0828
                                                Root MSE          =     .26365

-----------------------------------------------------------------------------------------
                        |               Robust
  r_annual_2022_trimmed | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
                  rv563 |  -.0140576   .0125153    -1.12   0.262    -.0386295    .0105143
                        |
        c.rv563#c.rv563 |   .0011189   .0012381     0.90   0.366    -.0013119    .0035496
                        |
              r15agey_b |   .0108097   .0140958     0.77   0.443    -.0168652    .0384847
                        |
c.r15agey_b#c.r15agey_b |  -.0000834   .0001014    -0.82   0.411    -.0002825    .0001156
                        |
                raedyrs |   .0153644   .0036491     4.21   0.000        .0082    .0225287
              r15inlbrf |   .0508354   .0225901     2.25   0.025     .0064833    .0951876
           married_2020 |   .0562444   .0226984     2.48   0.013     .0116797     .100809
                born_us |  -.0157583   .0273608    -0.58   0.565    -.0694769    .0379603
              wealth_d2 |          0  (omitted)
              wealth_d3 |   .1394246   .0550336     2.53   0.012     .0313749    .2474742
              wealth_d4 |   .2192024   .0428295     5.12   0.000     .1351135    .3032913
              wealth_d5 |   .2290754   .0362499     6.32   0.000     .1579045    .3002462
              wealth_d6 |   .1202187   .0336722     3.57   0.000     .0541087    .1863287
              wealth_d7 |   .1364277   .0336843     4.05   0.000      .070294    .2025615
              wealth_d8 |   .0797511   .0325626     2.45   0.015     .0158196    .1436825
              wealth_d9 |    .066757   .0320983     2.08   0.038     .0037372    .1297769
             wealth_d10 |          0  (omitted)
                  _cons |  -.5306111   .4951551    -1.07   0.284    -1.502769    .4415465
-----------------------------------------------------------------------------------------
[RAW+C] r_annual_2022_excl_res on rv563 + rv563^2 + age quad + controls (robust)
note: wealth_d2 omitted because of collinearity.

Linear regression                               Number of obs     =        804
                                                F(15, 787)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0625
                                                Root MSE          =     .40177

-----------------------------------------------------------------------------------------
                        |               Robust
 r_annual_2022_excl_res | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
                  rv563 |  -.0159177   .0182825    -0.87   0.384     -.051806    .0199706
                        |
        c.rv563#c.rv563 |   .0018161     .00181     1.00   0.316    -.0017368    .0053691
                        |
              r15agey_b |  -.0096338   .0252382    -0.38   0.703    -.0591759    .0399083
                        |
c.r15agey_b#c.r15agey_b |   .0000549   .0001819     0.30   0.763    -.0003021    .0004119
                        |
                raedyrs |   .0168577   .0054409     3.10   0.002     .0061773     .027538
              r15inlbrf |   .0655567   .0326364     2.01   0.045     .0014919    .1296215
           married_2020 |   .0630223   .0298189     2.11   0.035     .0044884    .1215563
                born_us |   .0220702   .0390029     0.57   0.572    -.0544918    .0986322
              wealth_d2 |          0  (omitted)
              wealth_d3 |    .375767    .085172     4.41   0.000     .2085758    .5429582
              wealth_d4 |   .2348833   .0576524     4.07   0.000     .1217126     .348054
              wealth_d5 |   .2226605    .059434     3.75   0.000     .1059925    .3393285
              wealth_d6 |   .1867002   .0518824     3.60   0.000     .0848558    .2885445
              wealth_d7 |   .1508435   .0464351     3.25   0.001     .0596922    .2419947
              wealth_d8 |   .1186603    .043525     2.73   0.007     .0332214    .2040991
              wealth_d9 |   .1002794   .0433828     2.31   0.021     .0151197    .1854391
             wealth_d10 |   .0572362    .035706     1.60   0.109    -.0128542    .1273265
                  _cons |   .0361627   .8733153     0.04   0.967     -1.67814    1.750466
-----------------------------------------------------------------------------------------
[RAW+C] r_annual_2022_excl_res_trim on rv563 + rv563^2 + age quad + controls (robust)
note: wealth_d2 omitted because of collinearity.

Linear regression                               Number of obs     =        730
                                                F(15, 713)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0502
                                                Root MSE          =     .17708

-----------------------------------------------------------------------------------------
                        |               Robust
r_annual_2022_excl_re~m | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
                  rv563 |  -.0014088   .0078678    -0.18   0.858    -.0168556    .0140379
                        |
        c.rv563#c.rv563 |   .0007339   .0007796     0.94   0.347    -.0007968    .0022646
                        |
              r15agey_b |  -.0055304   .0089996    -0.61   0.539    -.0231994    .0121386
                        |
c.r15agey_b#c.r15agey_b |   .0000374   .0000648     0.58   0.564    -.0000897    .0001645
                        |
                raedyrs |   .0062404     .00223     2.80   0.005     .0018622    .0106186
              r15inlbrf |    .034816   .0143633     2.42   0.016     .0066166    .0630154
           married_2020 |   .0443777    .014618     3.04   0.002     .0156783    .0730771
                born_us |    .004553   .0179976     0.25   0.800    -.0307816    .0398877
              wealth_d2 |          0  (omitted)
              wealth_d3 |   .1235798   .0300484     4.11   0.000     .0645859    .1825736
              wealth_d4 |   .1256775   .0260315     4.83   0.000     .0745699     .176785
              wealth_d5 |   .1220212    .024912     4.90   0.000     .0731115    .1709308
              wealth_d6 |   .0816679   .0228164     3.58   0.000     .0368725    .1264633
              wealth_d7 |   .0914027   .0247751     3.69   0.000     .0427617    .1400436
              wealth_d8 |   .0794693   .0257962     3.08   0.002     .0288236    .1301149
              wealth_d9 |   .1048111   .0265422     3.95   0.000      .052701    .1569213
             wealth_d10 |   .0524556   .0214485     2.45   0.015     .0103459    .0945653
                  _cons |   .0211391   .3174064     0.07   0.947    -.6020239     .644302
-----------------------------------------------------------------------------------------
[RAW+C] r_annual_2022 on rv564 + rv564^2 + age quad + controls (robust)
note: wealth_d2 omitted because of collinearity.
note: wealth_d10 omitted because of collinearity.

Linear regression                               Number of obs     =        792
                                                F(15, 776)        =       5.42
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1098
                                                Root MSE          =     .49001

-----------------------------------------------------------------------------------------
                        |               Robust
          r_annual_2022 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
                  rv564 |   .0054458   .0210779     0.26   0.796    -.0359307    .0468223
                        |
        c.rv564#c.rv564 |  -.0011383   .0027499    -0.41   0.679    -.0065363    .0042598
                        |
              r15agey_b |  -.0388582   .0262804    -1.48   0.140    -.0904472    .0127309
                        |
c.r15agey_b#c.r15agey_b |   .0002415   .0001865     1.29   0.196    -.0001247    .0006077
                        |
                raedyrs |   .0236148   .0072949     3.24   0.001     .0092946    .0379349
              r15inlbrf |      .0607   .0406357     1.49   0.136    -.0190689    .1404688
           married_2020 |   .0655065   .0369694     1.77   0.077    -.0070654    .1380784
                born_us |  -.0110912   .0526201    -0.21   0.833    -.1143859    .0922035
              wealth_d2 |          0  (omitted)
              wealth_d3 |    .493338   .1137331     4.34   0.000     .2700771    .7165989
              wealth_d4 |   .3002469   .0657773     4.56   0.000     .1711243    .4293695
              wealth_d5 |   .2831982   .0486193     5.82   0.000     .1877573    .3786391
              wealth_d6 |   .1404799   .0520775     2.70   0.007     .0382505    .2427093
              wealth_d7 |   .1407628   .0437239     3.22   0.001     .0549316     .226594
              wealth_d8 |   .0685536    .040283     1.70   0.089     -.010523    .1476303
              wealth_d9 |   .0476155   .0372868     1.28   0.202    -.0255794    .1208105
             wealth_d10 |          0  (omitted)
                  _cons |   1.147456    .938991     1.22   0.222    -.6958075     2.99072
-----------------------------------------------------------------------------------------
[RAW+C] r_annual_2022_trim on rv564 + rv564^2 + age quad + controls (robust)
note: wealth_d2 omitted because of collinearity.
note: wealth_d10 omitted because of collinearity.

Linear regression                               Number of obs     =        719
                                                F(15, 703)        =       4.43
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0833
                                                Root MSE          =     .26318

-----------------------------------------------------------------------------------------
                        |               Robust
  r_annual_2022_trimmed | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
                  rv564 |  -.0056194   .0113193    -0.50   0.620    -.0278431    .0166042
                        |
        c.rv564#c.rv564 |   .0013124   .0014088     0.93   0.352    -.0014536    .0040784
                        |
              r15agey_b |   .0073841   .0141223     0.52   0.601    -.0203428     .035111
                        |
c.r15agey_b#c.r15agey_b |  -.0000613   .0001015    -0.60   0.546    -.0002607     .000138
                        |
                raedyrs |   .0147315   .0036655     4.02   0.000     .0075349    .0219281
              r15inlbrf |   .0488032   .0225162     2.17   0.031     .0045961    .0930102
           married_2020 |   .0544079   .0226734     2.40   0.017     .0098922    .0989237
                born_us |  -.0040656   .0277629    -0.15   0.884    -.0585737    .0504425
              wealth_d2 |          0  (omitted)
              wealth_d3 |   .1461141   .0550101     2.66   0.008     .0381104    .2541179
              wealth_d4 |   .2149355   .0428153     5.02   0.000     .1308744    .2989967
              wealth_d5 |    .229789   .0363037     6.33   0.000     .1585124    .3010656
              wealth_d6 |   .1164583   .0336043     3.47   0.001     .0504816     .182435
              wealth_d7 |    .130004   .0341057     3.81   0.000     .0630427    .1969652
              wealth_d8 |   .0849128   .0320707     2.65   0.008      .021947    .1478787
              wealth_d9 |   .0685757   .0316046     2.17   0.030      .006525    .1306263
             wealth_d10 |          0  (omitted)
                  _cons |   -.438902   .4939131    -0.89   0.375    -1.408624    .5308194
-----------------------------------------------------------------------------------------
[RAW+C] r_annual_2022_excl_res on rv564 + rv564^2 + age quad + controls (robust)
note: wealth_d2 omitted because of collinearity.

Linear regression                               Number of obs     =        801
                                                F(15, 784)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0688
                                                Root MSE          =     .37652

-----------------------------------------------------------------------------------------
                        |               Robust
 r_annual_2022_excl_res | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
                  rv564 |   .0120681   .0147514     0.82   0.414    -.0168888    .0410251
                        |
        c.rv564#c.rv564 |  -.0016107     .00169    -0.95   0.341    -.0049283    .0017068
                        |
              r15agey_b |   .0012273   .0223669     0.05   0.956    -.0426788    .0451333
                        |
c.r15agey_b#c.r15agey_b |   -.000036   .0001575    -0.23   0.819    -.0003452    .0002732
                        |
                raedyrs |   .0133702   .0048102     2.78   0.006     .0039278    .0228125
              r15inlbrf |   .0607557   .0323555     1.88   0.061     -.002758    .1242694
           married_2020 |   .0561109   .0280761     2.00   0.046     .0009977    .1112241
                born_us |   .0168816   .0398033     0.42   0.672     -.061252    .0950152
              wealth_d2 |          0  (omitted)
              wealth_d3 |   .3361721   .0810621     4.15   0.000     .1770476    .4952966
              wealth_d4 |   .2176392   .0513951     4.23   0.000      .116751    .3185275
              wealth_d5 |   .1771094   .0352789     5.02   0.000     .1078571    .2463617
              wealth_d6 |   .1721422    .044145     3.90   0.000     .0854857    .2587986
              wealth_d7 |   .1424023   .0390761     3.64   0.000     .0656961    .2191085
              wealth_d8 |   .1099395   .0358266     3.07   0.002     .0396121     .180267
              wealth_d9 |   .0970482   .0358845     2.70   0.007     .0266071    .1674893
             wealth_d10 |   .0483072   .0252796     1.91   0.056    -.0013165    .0979308
                  _cons |  -.2357801   .8067622    -0.29   0.770     -1.81945     1.34789
-----------------------------------------------------------------------------------------
[RAW+C] r_annual_2022_excl_res_trim on rv564 + rv564^2 + age quad + controls (robust)
note: wealth_d2 omitted because of collinearity.

Linear regression                               Number of obs     =        729
                                                F(15, 712)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0546
                                                Root MSE          =     .17592

-----------------------------------------------------------------------------------------
                        |               Robust
r_annual_2022_excl_re~m | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
                  rv564 |  -.0014745   .0067943    -0.22   0.828    -.0148137    .0118647
                        |
        c.rv564#c.rv564 |   .0009954   .0007962     1.25   0.212    -.0005679    .0025586
                        |
              r15agey_b |  -.0060542   .0090788    -0.67   0.505    -.0238786    .0117702
                        |
c.r15agey_b#c.r15agey_b |   .0000418   .0000653     0.64   0.522    -.0000863    .0001699
                        |
                raedyrs |    .006417   .0021867     2.93   0.003     .0021239    .0107102
              r15inlbrf |   .0348202   .0141139     2.47   0.014     .0071104    .0625301
           married_2020 |   .0453106   .0144422     3.14   0.002     .0169561     .073665
                born_us |   .0094615   .0180707     0.52   0.601    -.0260168    .0449398
              wealth_d2 |          0  (omitted)
              wealth_d3 |   .1471264   .0281545     5.23   0.000     .0918507    .2024021
              wealth_d4 |   .1453562   .0242834     5.99   0.000     .0976805    .1930319
              wealth_d5 |   .1472166   .0239621     6.14   0.000     .1001718    .1942615
              wealth_d6 |   .1039449   .0205501     5.06   0.000      .063599    .1442909
              wealth_d7 |   .1170003   .0217643     5.38   0.000     .0742705    .1597301
              wealth_d8 |   .1037538   .0246482     4.21   0.000      .055362    .1521456
              wealth_d9 |    .134066   .0248948     5.39   0.000     .0851901    .1829419
             wealth_d10 |   .0737322   .0183405     4.02   0.000     .0377244    .1097401
                  _cons |   .0088355   .3205745     0.03   0.978    -.6205489    .6382198
-----------------------------------------------------------------------------------------

. 
. * ----------------------------------------------------------------------
. * PCA of trust variables (rv557-rv564) and regressions using PC1
. * ----------------------------------------------------------------------
. di as txt "=== PCA on trust variables (rv557-rv564) ==="
=== PCA on trust variables (rv557-rv564) ===

. capture drop trust_pca1 trust_pca1_z

. capture noisily pca rv557 rv558 rv559 rv560 rv561 rv562 rv563 rv564, components(1)

Principal components/correlation                 Number of obs    =        970
                                                 Number of comp.  =          1
                                                 Trace            =          8
    Rotation: (unrotated = principal)            Rho              =     0.4493

    --------------------------------------------------------------------------
       Component |   Eigenvalue   Difference         Proportion   Cumulative
    -------------+------------------------------------------------------------
           Comp1 |      3.59438      2.36333             0.4493       0.4493
           Comp2 |      1.23105      .405717             0.1539       0.6032
           Comp3 |      .825336      .120069             0.1032       0.7063
           Comp4 |      .705266      .102935             0.0882       0.7945
           Comp5 |      .602331      .102839             0.0753       0.8698
           Comp6 |      .499493      .138996             0.0624       0.9322
           Comp7 |      .360497      .178854             0.0451       0.9773
           Comp8 |      .181642            .             0.0227       1.0000
    --------------------------------------------------------------------------

Principal components (eigenvectors) 

    --------------------------------------
        Variable |    Comp1 | Unexplained 
    -------------+----------+-------------
           rv557 |   0.2983 |       .6801 
           rv558 |   0.3785 |       .4852 
           rv559 |   0.3750 |       .4945 
           rv560 |   0.3889 |       .4564 
           rv561 |   0.3756 |       .4928 
           rv562 |   0.3503 |        .559 
           rv563 |   0.3775 |       .4878 
           rv564 |   0.2638 |       .7499 
    --------------------------------------

. if _rc==0 {
.     * Proportion of variance explained by PC1 (display only)
.     capture matrix M = e(Prop)
.     if _rc==0 {
.         scalar pc1_prop = M[1,1]
.         di as txt "PC1 variance proportion: " %6.3f pc1_prop
PC1 variance proportion:      .
.     }
.     predict double trust_pca1 if e(sample), score

Scoring coefficients 
    sum of squares(column-loading) = 1

    ------------------------
        Variable |    Comp1 
    -------------+----------
           rv557 |   0.2983 
           rv558 |   0.3785 
           rv559 |   0.3750 
           rv560 |   0.3889 
           rv561 |   0.3756 
           rv562 |   0.3503 
           rv563 |   0.3775 
           rv564 |   0.2638 
    ------------------------
.     egen double trust_pca1_z = std(trust_pca1)
(14,886 missing values generated)
.     quietly count if !missing(trust_pca1_z)
.     di as txt "Non-missing trust_pca1_z: " r(N)
Non-missing trust_pca1_z: 970
.     quietly count if !missing(r_annual_2022) & !missing(trust_pca1_z)
.     di as txt "Overlap with r_annual_2022: " r(N)
Overlap with r_annual_2022: 747
. 
.     di as txt "=== REGRESSIONS: RETURNS on trust_pca1_z (no controls) ==="
=== REGRESSIONS: RETURNS on trust_pca1_z (no controls) ===
.     foreach y of local ret_vars {
  2.         capture confirm variable `y'
  3.         if _rc continue
  4.         quietly count if !missing(`y') & !missing(trust_pca1_z)
  5.         if r(N)==0 continue
  6.         di as txt "[RAW] `y' on trust_pca1_z + trust_pca1_z^2 (robust)"
  7.         regress `y' c.trust_pca1_z c.trust_pca1_z#c.trust_pca1_z if !missing(`y') & !
> missing(trust_pca1_z), vce(robust)
  8.     }
[RAW] r_annual_2022 on trust_pca1_z + trust_pca1_z^2 (robust)

Linear regression                               Number of obs     =        747
                                                F(2, 744)         =       1.39
                                                Prob > F          =     0.2499
                                                R-squared         =     0.0044
                                                Root MSE          =     .51896

---------------------------------------------------------------------------------
                |               Robust
  r_annual_2022 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
   trust_pca1_z |  -.0371565   .0222988    -1.67   0.096    -.0809326    .0066196
                |
 c.trust_pca1_z#|
 c.trust_pca1_z |  -.0071886   .0127816    -0.56   0.574    -.0322809    .0179038
                |
          _cons |   .2059934   .0221143     9.31   0.000     .1625795    .2494073
---------------------------------------------------------------------------------
[RAW] r_annual_2022_trim on trust_pca1_z + trust_pca1_z^2 (robust)

Linear regression                               Number of obs     =        677
                                                F(2, 674)         =       1.26
                                                Prob > F          =     0.2849
                                                R-squared         =     0.0039
                                                Root MSE          =     .27092

---------------------------------------------------------------------------------
                |               Robust
r_annual_2022~d | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
   trust_pca1_z |   -.018016   .0115916    -1.55   0.121     -.040776     .004744
                |
 c.trust_pca1_z#|
 c.trust_pca1_z |  -.0043838   .0086026    -0.51   0.611    -.0212749    .0125073
                |
          _cons |   .1534422   .0130468    11.76   0.000     .1278249    .1790595
---------------------------------------------------------------------------------
[RAW] r_annual_2022_excl_res on trust_pca1_z + trust_pca1_z^2 (robust)

Linear regression                               Number of obs     =        757
                                                F(2, 754)         =       1.06
                                                Prob > F          =     0.3463
                                                R-squared         =     0.0024
                                                Root MSE          =      .3851

---------------------------------------------------------------------------------
                |               Robust
r_annual_2022~s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
   trust_pca1_z |  -.0186681   .0149413    -1.25   0.212    -.0479996    .0106633
                |
 c.trust_pca1_z#|
 c.trust_pca1_z |  -.0080566   .0077351    -1.04   0.298    -.0232414    .0071283
                |
          _cons |   .1137206   .0170031     6.69   0.000     .0803415    .1470997
---------------------------------------------------------------------------------
[RAW] r_annual_2022_excl_res_trim on trust_pca1_z + trust_pca1_z^2 (robust)

Linear regression                               Number of obs     =        690
                                                F(2, 687)         =       3.14
                                                Prob > F          =     0.0438
                                                R-squared         =     0.0072
                                                Root MSE          =     .17759

---------------------------------------------------------------------------------
                |               Robust
r_annual_2022~m | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
   trust_pca1_z |   .0152263   .0072326     2.11   0.036     .0010257    .0294269
                |
 c.trust_pca1_z#|
 c.trust_pca1_z |  -.0019721   .0045873    -0.43   0.667    -.0109789    .0070346
                |
          _cons |   .0621404   .0083856     7.41   0.000      .045676    .0786048
---------------------------------------------------------------------------------
. 
.     di as txt "=== REGRESSIONS: RETURNS on trust_pca1_z (+ controls) ==="
=== REGRESSIONS: RETURNS on trust_pca1_z (+ controls) ===
.     foreach y of local ret_vars {
  2.         capture confirm variable `y'
  3.         if _rc continue
  4.         quietly count if !missing(`y') & !missing(trust_pca1_z)
  5.         if r(N)==0 continue
  6.         di as txt "[RAW+C] `y' on trust_pca1_z + trust_pca1_z^2 + age quad + controls
>  (robust)"
  7.         regress `y' c.trust_pca1_z c.trust_pca1_z#c.trust_pca1_z `age_quad' `ctrl_in'
>  if !missing(`y') & !missing(trust_pca1_z), vce(robust)
  8.     }
[RAW+C] r_annual_2022 on trust_pca1_z + trust_pca1_z^2 + age quad + controls (robust)
note: wealth_d2 omitted because of collinearity.
note: wealth_d10 omitted because of collinearity.

Linear regression                               Number of obs     =        741
                                                F(15, 725)        =       5.21
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1080
                                                Root MSE          =     .49371

-----------------------------------------------------------------------------------------
                        |               Robust
          r_annual_2022 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
           trust_pca1_z |  -.0087937   .0213979    -0.41   0.681    -.0508028    .0332155
                        |
         c.trust_pca1_z#|
         c.trust_pca1_z |  -.0063255   .0132248    -0.48   0.633    -.0322891    .0196381
                        |
              r15agey_b |   -.043718   .0276149    -1.58   0.114    -.0979328    .0104967
                        |
c.r15agey_b#c.r15agey_b |   .0002773   .0001964     1.41   0.158    -.0001083     .000663
                        |
                raedyrs |   .0245442    .007627     3.22   0.001     .0095706    .0395178
              r15inlbrf |   .0579606   .0425937     1.36   0.174    -.0256613    .1415824
           married_2020 |   .0660786   .0383288     1.72   0.085    -.0091701    .1413273
                born_us |  -.0226243   .0506926    -0.45   0.656    -.1221462    .0768976
              wealth_d2 |          0  (omitted)
              wealth_d3 |   .4848646   .1239915     3.91   0.000     .2414394    .7282898
              wealth_d4 |   .3041409    .069338     4.39   0.000     .1680137    .4402681
              wealth_d5 |   .2921555    .049604     5.89   0.000     .1947708    .3895402
              wealth_d6 |   .1501713   .0545526     2.75   0.006     .0430714    .2572712
              wealth_d7 |   .1271977   .0454688     2.80   0.005     .0379315    .2164638
              wealth_d8 |   .0568013    .041514     1.37   0.172    -.0247007    .1383034
              wealth_d9 |      .0435   .0390403     1.11   0.266    -.0331455    .1201455
             wealth_d10 |          0  (omitted)
                  _cons |   1.307455   .9760092     1.34   0.181    -.6086872    3.223596
-----------------------------------------------------------------------------------------
[RAW+C] r_annual_2022_trim on trust_pca1_z + trust_pca1_z^2 + age quad + controls (robust)
note: wealth_d2 omitted because of collinearity.
note: wealth_d10 omitted because of collinearity.

Linear regression                               Number of obs     =        673
                                                F(15, 657)        =       4.01
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0821
                                                Root MSE          =     .26222

-----------------------------------------------------------------------------------------
                        |               Robust
  r_annual_2022_trimmed | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
           trust_pca1_z |  -.0105656   .0120023    -0.88   0.379     -.034133    .0130018
                        |
         c.trust_pca1_z#|
         c.trust_pca1_z |  -.0031194   .0083836    -0.37   0.710    -.0195813    .0133425
                        |
              r15agey_b |   .0127855   .0146204     0.87   0.382    -.0159228    .0414937
                        |
c.r15agey_b#c.r15agey_b |  -.0000998   .0001052    -0.95   0.343    -.0003063    .0001068
                        |
                raedyrs |   .0136726   .0037131     3.68   0.000     .0063816    .0209637
              r15inlbrf |   .0527125   .0228106     2.31   0.021     .0079221    .0975029
           married_2020 |   .0432391   .0231752     1.87   0.063    -.0022673    .0887455
                born_us |  -.0117743   .0283496    -0.42   0.678    -.0674409    .0438924
              wealth_d2 |          0  (omitted)
              wealth_d3 |   .1192074   .0592841     2.01   0.045     .0027982    .2356167
              wealth_d4 |   .2106893   .0441924     4.77   0.000     .1239139    .2974648
              wealth_d5 |    .222086   .0377395     5.88   0.000     .1479815    .2961905
              wealth_d6 |   .1206116   .0345341     3.49   0.001     .0528011    .1884221
              wealth_d7 |   .1133609   .0343556     3.30   0.001     .0459008     .180821
              wealth_d8 |   .0691954   .0325142     2.13   0.034     .0053512    .1330397
              wealth_d9 |   .0627108   .0329743     1.90   0.058    -.0020369    .1274586
             wealth_d10 |          0  (omitted)
                  _cons |  -.5870114    .511128    -1.15   0.251    -1.590653      .41663
-----------------------------------------------------------------------------------------
[RAW+C] r_annual_2022_excl_res on trust_pca1_z + trust_pca1_z^2 + age quad + controls (rob
> ust)
note: wealth_d2 omitted because of collinearity.

Linear regression                               Number of obs     =        750
                                                F(15, 733)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0693
                                                Root MSE          =     .37647

-----------------------------------------------------------------------------------------
                        |               Robust
 r_annual_2022_excl_res | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
           trust_pca1_z |  -.0023642   .0144321    -0.16   0.870    -.0306974    .0259691
                        |
         c.trust_pca1_z#|
         c.trust_pca1_z |  -.0049143   .0081646    -0.60   0.547    -.0209432    .0111145
                        |
              r15agey_b |   .0001696   .0242443     0.01   0.994     -.047427    .0477661
                        |
c.r15agey_b#c.r15agey_b |  -.0000287   .0001711    -0.17   0.867    -.0003647    .0003073
                        |
                raedyrs |   .0165436   .0048655     3.40   0.001     .0069915    .0260956
              r15inlbrf |   .0524575   .0335939     1.56   0.119    -.0134942    .1184093
           married_2020 |   .0583653   .0294373     1.98   0.048     .0005738    .1161569
                born_us |  -.0089614   .0392834    -0.23   0.820    -.0860828    .0681601
              wealth_d2 |          0  (omitted)
              wealth_d3 |   .3376636   .0877729     3.85   0.000     .1653473    .5099799
              wealth_d4 |   .2178417    .054523     4.00   0.000     .1108019    .3248815
              wealth_d5 |   .1754282   .0374846     4.68   0.000     .1018383    .2490181
              wealth_d6 |   .1808714   .0486466     3.72   0.000     .0853682    .2763747
              wealth_d7 |   .1353491   .0414454     3.27   0.001     .0539832    .2167151
              wealth_d8 |   .0967594   .0399568     2.42   0.016      .018316    .1752027
              wealth_d9 |   .0864016   .0407659     2.12   0.034     .0063697    .1664335
             wealth_d10 |    .043433   .0301527     1.44   0.150    -.0157629    .1026289
                  _cons |  -.2026743   .8622847    -0.24   0.814    -1.895516    1.490168
-----------------------------------------------------------------------------------------
[RAW+C] r_annual_2022_excl_res_trim on trust_pca1_z + trust_pca1_z^2 + age quad + controls
>  (robust)
note: wealth_d2 omitted because of collinearity.

Linear regression                               Number of obs     =        683
                                                F(15, 666)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0581
                                                Root MSE          =     .17422

-----------------------------------------------------------------------------------------
                        |               Robust
r_annual_2022_excl_re~m | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------------+----------------------------------------------------------------
           trust_pca1_z |   .0196384    .007192     2.73   0.006     .0055168    .0337601
                        |
         c.trust_pca1_z#|
         c.trust_pca1_z |  -.0010655   .0045925    -0.23   0.817    -.0100829     .007952
                        |
              r15agey_b |  -.0094532   .0094822    -1.00   0.319    -.0280718    .0091654
                        |
c.r15agey_b#c.r15agey_b |   .0000641   .0000679     0.94   0.345    -.0000692    .0001974
                        |
                raedyrs |   .0059224   .0022405     2.64   0.008     .0015231    .0103216
              r15inlbrf |   .0391358   .0144194     2.71   0.007     .0108228    .0674488
           married_2020 |   .0448297   .0148302     3.02   0.003     .0157101    .0739493
                born_us |  -.0010336   .0186725    -0.06   0.956    -.0376977    .0356305
              wealth_d2 |          0  (omitted)
              wealth_d3 |   .1232328   .0298104     4.13   0.000     .0646992    .1817664
              wealth_d4 |   .1142087   .0234357     4.87   0.000      .068192    .1602254
              wealth_d5 |    .111991   .0244676     4.58   0.000     .0639481    .1600339
              wealth_d6 |   .0721763   .0208363     3.46   0.001     .0312635    .1130892
              wealth_d7 |   .0748361   .0222338     3.37   0.001     .0311792     .118493
              wealth_d8 |   .0653363    .024066     2.71   0.007     .0180819    .1125906
              wealth_d9 |   .0895847   .0257718     3.48   0.001     .0389809    .1401884
             wealth_d10 |   .0424009   .0210009     2.02   0.044     .0011649    .0836369
                  _cons |   .1936743   .3370723     0.57   0.566    -.4681781    .8555268
-----------------------------------------------------------------------------------------
. }

. else {
.     di as error "PCA failed; trust PCA regressions skipped."
. }

. 
. di as txt "All regressions completed. Review coefficients, SEs, R2, and N above."
All regressions completed. Review coefficients, SEs, R2, and N above.

. 
. log close
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-BeliefsandTrust/Code/Data/HRS_Long/randhrs
> 1992_2022v1_STATA/reg_ret_trust_2020.log
  log type:  text
 closed on:   3 Oct 2025, 10:44:33
------------------------------------------------------------------------------------------
